[{
    "title": "Daily General Discussion - January 31, 2018",
    "score": 115,
    "comments": [{
        "score": 55,
        "matches": ["ethereum"],
        "content": "Ethereum - can't wait to be king"
    }, {
        "score": 168,
        "matches": ["icon"],
        "content": "I literally just threw half of my net worth at ICX because their speaker announced that their summit is during the first blood moon in 150 years and their presidents name is Moon. This is the tipping point for me. We are 100% living in a simulation."
    }, {
        "score": 41,
        "matches": ["request"],
        "content": "Technology in action... They used to use Chinese water torture now they get you to buy REQ and make you watch 5 minute candles."
    }, {
        "score": 35,
        "matches": ["icon"],
        "content": "ICX unveils incredible blockchain 3.0 technology with real use cases and projects and drops 20%. XRB changes it's name and logo and goes up 20%. What a world!"
    }, {
        "score": 63,
        "matches": ["request"],
        "content": "Req what is you doing baby "
    }, {
        "score": 33,
        "matches": ["request"],
        "content": "Go REQ go!"
    }, {
        "score": 12,
        "matches": ["icon"],
        "content": "Just saw a 90,000 buy order filled on icx ... Crazy that ppl move money like that all day. "
    }, {
        "score": 21,
        "matches": ["icon"],
        "content": "The way ICX can dump after that news yesterday just proves i don't know what the fuck i'm doing. \n\n"
    }, {
        "score": 10,
        "matches": ["request"],
        "content": "REQ pumping on Binance, KuCoin yet to catch up!\n\nDamn it should've kept my mouth shut now you're all selling.  Lol"
    }, {
        "score": 9,
        "matches": ["neo"],
        "content": "Gonna bank on XRP, XLM, and/or NEO for new coinbase coins"
    }, {
        "score": 19,
        "matches": ["binance"],
        "content": "So XRB just rebranded to NANO,should we expect listing on binance in the next week or so?"
    }, {
        "score": 9,
        "matches": ["stellar"],
        "content": "New Stellar Node in US labelled FairX LLC.\n\nhttps://i.redd.it/3jyq9biougd01.png"
    }, {
        "score": 15,
        "matches": ["neo"],
        "content": "Might have to pick up some NEO with it being under $150 again"
    }, {
        "score": 9,
        "matches": ["tron"],
        "content": "These BNTY and PRL bags are starting to get realllllly heavy. \n\nI’m starting to wonder if I’m delusional just like all of those Tron holders last month, insisting that it would go back up when everybody else knew otherwise. "
    }, {
        "score": 8,
        "matches": ["stellar"],
        "content": "Time to buy XLM and XRP?"
    }, {
        "score": 16,
        "matches": ["ripple"],
        "content": "I know this sub hate and downvote every post about ripple, but did you see which 3 big firms agreed to use xrp for pilot project? It brings down all the FUD of not using xrp, i think that hate is what keeps it low "
    }, {
        "score": 24,
        "matches": ["icon"],
        "content": "ICX Min is totally memeing. ROCKETSHIP, blood MOON. SPACESHIP! WHAT. President MOON"
    }, {
        "score": 23,
        "matches": ["icon"],
        "content": "CALM DOWN PEOPLE....\n\nICX DAPP PRESENTATIONS ARE BEING DONE BY NERDS... NOT STEVE JOBS. FUCKERS ARE AWKWARD. GIVE EM A BREAK LOL.\n\nONLY FOCUS ON THE TECH ITSELF"
    }, {
        "score": 22,
        "matches": ["icon"],
        "content": ">\tICX cures cancer!\n\n*drops 50%*\n\n>\tAnd AIDS!\n\n*drops 90%*\n\n>\tAnd poverty!!!\n\n*drops 99%*\n\n>\t...ICX dogs?\n\n*up 10000%*"
    }, {
        "score": 21,
        "matches": ["ethereum", "ripple"],
        "content": "Some analysis time.  \n\nThe crypto market was at its peak 1/7/2017 at little bit over 820 billion.  Right now, it has plummeted to around 500 billion.  In that span of time, Ethereum went from 1043 dollars to 1100 dollars.  It is amazing that the 2nd largest cryptocurrency actually increased during one of the worst periods.  In contract, BTC went from 17k to 10k.  Ripple plummeted from 3.09 dollars to 1.13 dollars.  Now, there are some rare cases of smaller alts gaining during this period, but nothing is impressive as the 2nd largest currency not losing any ground. \n\nI think the jury is out.  During these times, put everything in ETH and only start to invest in other alts when the market recovers.  That is the best move to make right now. "
    }, {
        "score": 7,
        "matches": ["icon"],
        "content": "I've decided that the ICX sell off can end now. "
    }, {
        "score": 8,
        "matches": ["icon"],
        "content": "Huge ICX buy wall!"
    }, {
        "score": 8,
        "matches": ["icon"],
        "content": "Good article from an actual attendee on his thoughts of the ICX summit.  Smh at the doubters and their comments stating that ICX will fall to 3-4 dollars, and I still believe this is my chance to get in a promising platform early after missing out on antshares \n\nhttps://blokt.com/news/thoughts-impressions-and-bonus-info-from-icons-first-annual-summit"
    }, {
        "score": 7,
        "matches": ["icon"],
        "content": "ICX looking like its back on the rails."
    }, {
        "score": 13,
        "matches": ["icon"],
        "content": "ICX top 10 inc?"
    }, {
        "score": 18,
        "matches": ["icon"],
        "content": "Those icx sell walls are collapsing one by one "
    }, {
        "score": 17,
        "matches": ["vechain"],
        "content": "Another Vechain partnership announced. These guys don't stop."
    }, {
        "score": 6,
        "matches": ["icon"],
        "content": "What happened to ICX  just now? Sell the hype? Might get some more FOMO coin instead"
    }, {
        "score": 6,
        "matches": ["icon"],
        "content": "Thoughts on Ian Balina? He hyped the ICX summit and well, nothing seemed worthy of said hype. Here's the\n[Tweet](https://twitter.com/diaryofamademan/status/958576514861293568). What is his game?\n"
    }, {
        "score": 6,
        "matches": ["icon"],
        "content": "Can anyone give an objective opinion on whether or not the ICX summit was a success or failure? From what I understand the dAPPS were really bad, but everything else was great.\n\nDoes the summit make you want to but or hold ICX, or sell it off?"
    }, {
        "score": 5,
        "matches": ["neo"],
        "content": "This is definitely harder to watch than I expected. Being a NEO holder the China FUD was difficult. This is excruciating though. Watching the red all over the portfolio. I just hope we start seeing the end of the bad news. If it isn't politicians in Davos talking it down, there are countries talking about regulations. Then doubts over tether. Major theft by hacking. There has been even more bad news that I can't even recall right now, At least we can't expect any worse news. Surely we can't! Hopefully it will be a steady, slow, uphill climb from here...."
    }, {
        "score": 6,
        "matches": ["ethereum"],
        "content": "Ethereum is one of the only top cryptos to outperform the S&P 500 over the last year on a risk reward basis:\nhttps://www.sifrdata.com/cryptocurrency-sharpe-ratios/\n\n"
    }, {
        "score": 6,
        "matches": ["icon"],
        "content": "when do you guys think ICX will get a KRW pairing??? Would make sense to do it soon before any price increase???"
    }, {
        "score": 6,
        "matches": ["ethereum", "ripple", "neo"],
        "content": "BTW, people who say XRP can't be listed because it is centralized, yet believe NEO or VEN would get added....come on people. You do realize NEO and VEN are also centralized? Let's be clear on what decentralized/centralized means.\n\nIf there is a corporate entity that is overseeing the network/platform, then obviously it is centralized. All this FOMO about \"partnerships\" you hear about VEN, is possibly precisely because VEN is a legally functioning entity that is able to enter into legal partnership agreements with counterparties. \n\nAn example of a truly decentralized coin is ETH. ETH has no partnerships, precisely because it has no corporate entity. "
    }, {
        "score": 6,
        "matches": ["icon"],
        "content": "Man, I liked the ICX conference yesterday.  WTH is up with this dip"
    }, {
        "score": 15,
        "matches": ["icon"],
        "content": "ICX people gonna keep #pounding"
    }, {
        "score": 15,
        "matches": ["ethereum", "icon"],
        "content": "ICX reminding me of early days Ethereum. I'm not saying it's ever going to up as high as ETH but I'm seeing a lot of comparisons in tech. The fact that they're going to be incentivizing people to use their platform is really exciting. "
    }, {
        "score": 22,
        "matches": ["icon"],
        "content": "ICX is literally going to be the talk to the town for the next day. So much awesome information and hype from this summit. I'm so excited for this coin!"
    }, {
        "score": 14,
        "matches": ["icon"],
        "content": "VEN keeping my portfolio very very green. Come on ICX make me greener!"
    }, {
        "score": 14,
        "matches": ["icon"],
        "content": "I already bought some ICX 2 days ago, but after the news I'm considering investing more. Not sure if reasonable or FOMO. "
    }, {
        "score": 14,
        "matches": ["icon"],
        "content": "i swear if they banned people from talking about nano and icx in here there would be no posts"
    }, {
        "score": 6,
        "matches": ["lisk"],
        "content": "LISK is now listed in Bitflyer. Only 4 pairs are listed on that exchange, so the price is rising because of that + the fact that we are approaching rebranding day "
    }, {
        "score": 5,
        "matches": ["ethereum"],
        "content": "Is this period of time or thereabouts the closet we have ever had market cap of Ethereum to Bitcoin. Ethereum has approximately 63% the market cap of Bitcoin. "
    }, {
        "score": 5,
        "matches": ["neo"],
        "content": "Thinking it’s time to put some of my LTC stash into NEO before NEO passes LTC, shill me some more "
    }, {
        "score": 16,
        "matches": ["icon"],
        "content": "These ICX announcements are blowing my mind. "
    }, {
        "score": 9,
        "matches": ["neo"],
        "content": "Is it me or do people wish they could have more coins? I hold VEN, ICX, REQ, XLM, and ENG. I want to hold NEO as well as ETH. I dont want to add more fiat in because I’m playing with house money. Blaahhh what to do. So many promising projects"
    }, {
        "score": 12,
        "matches": ["icon"],
        "content": "Icon doing some next level maneuvers. So comfy."
    }, {
        "score": 9,
        "matches": ["icon"],
        "content": "Dammit, I wish I remembered to sell some ICX before the summit, as I originally planned to do. I slept in (I live in Australia).\n\nOh well. Just gonna have to HODL."
    }, {
        "score": 7,
        "matches": ["icon"],
        "content": "Ian told me that the big news he learned was that ICX is being added to coinbase.."
    }, {
        "score": 8,
        "matches": ["ethereum"],
        "content": "Ethereum is literally the holy spirit right now, go go go!! "
    }, {
        "score": 4,
        "matches": ["vertcoin", "request"],
        "content": "What do you guys think about VTC nowadays? Use to be in the same position as REQ in terms of hype/reddit stance but now you never hear of it."
    }, {
        "score": 3,
        "matches": ["lisk"],
        "content": "Wow, Lisk made quite a jump"
    }, {
        "score": 5,
        "matches": ["icon"],
        "content": "Smilegate + Icon https://mobile.twitter.com/PretzelMiser/status/958631185919262720"
    }, {
        "score": 4,
        "matches": ["icon"],
        "content": "So has the opinion on ICX improved or gotten worse? I heard the dAPPs were underwhelming, but the other news was strong.\n\nI don't even get why it's getting dumped now. The price was barely pumped from its point last week. "
    }, {
        "score": 4,
        "matches": ["enigma"],
        "content": "More AMB or ENG at these prices? ( I'm already hodling both.)"
    }, {
        "score": 4,
        "matches": ["stellar"],
        "content": "How does one gain exposure to Bitcoins lightning network? In order to gain exposure to it's potential due to the use of smart contract and near instant payments, would the buy be BTC or Stellar (due to their plans to implement it)? How long term is a play for the lightning network? A few years?"
    }, {
        "score": 4,
        "matches": ["ethereum"],
        "content": "I do feel like IF the script flips and ETH becomes #1 over Bitcoin, that jolt of a news would ignite the newbies to come into crypto.  I think there would be some (false) idea that this is a new game now and that they can get in on it.  "
    }, {
        "score": 4,
        "matches": ["ethereum"],
        "content": "It seems like Bitcoin is destined to hit 8000 and potentially even lower. But from what we saw yesterday, maybe the correction won't take the whole market with it. It seems like Ethereum was not hurt too bad yesterday and Bitcoin just keeps losing marketshare. What do you guys think?"
    }, {
        "score": 5,
        "matches": ["neo", "icon", "request"],
        "content": "My portfolio for February and hopefully for long-term: VEN, WTC, ICX and ETH. I was holding REQ for a looooooong time and I still believe in it but until I see (and hopefully don't miss) some good movement, I'm keeping those funds elsewhere. Hoping to pick up some NEO this month as well, if I can afford it.  \n  \nAnyway, here's to a good February for us all. :)"
    }, {
        "score": 4,
        "matches": ["ethereum", "icon", "binance"],
        "content": "This is probably stupid but when cashing out ven or icx for fiat does it matter if it goes to eth or btc from Binance to gdax to then my bank? Will I get the same amount of fiat or no? "
    }, {
        "score": 10,
        "matches": ["ethereum"],
        "content": "ETH up 2.5% over the week.\n\nBTC _down_ 12.5% over the week.\n\nThe flippening."
    }, {
        "score": 14,
        "matches": ["icon"],
        "content": "ICX and VEN seems like brothers to me. I will hold them dearly."
    }, {
        "score": 8,
        "matches": ["icon"],
        "content": "So is ICX the next big Reddit shill? IOTA, then XRB, then PRL (lol 80% down), then VEN, now ICX.\n\nWell shit, I'm in. "
    }, {
        "score": 7,
        "matches": ["binance"],
        "content": "I just won a Binance hoodie. There was a fortune in the pocket that says ‘Binance coin will be added to coinbase’ I’m going to get me some BNB."
    }, {
        "score": 6,
        "matches": ["request"],
        "content": "Was considering buying REQ then it goes up 15% "
    }, {
        "score": 7,
        "matches": ["ethereum"],
        "content": "Transfered my ETH holdings into XRB y'day at the dip. Wish me luck. "
    }, {
        "score": 7,
        "matches": ["ethereum"],
        "content": "At what point do we seriously start considering the flippening of BTC/ETH? ETH now up on the daily charts."
    }, {
        "score": 6,
        "matches": ["neo"],
        "content": "What coins like NEO and VEN are or will be passive earners?"
    }, {
        "score": 8,
        "matches": ["request"],
        "content": "Why is REQ pumping?  Seems like weird timing.  Any news about REQ? "
    }, {
        "score": 14,
        "matches": ["icon"],
        "content": "ICX game changing stuff! Transfers without complicated adresses will be really nice. You go ahead and \"sell the news\" ill hodl "
    }, {
        "score": 3,
        "matches": ["icon"],
        "content": "Silkroad is the best ICX dapp presented so far. Blue Whale was interesting and could go far if they do it right. Tink is a mountain of donkey shit. "
    }, {
        "score": 3,
        "matches": ["icon"],
        "content": "Fuckin bitcoin ruined my ICX profit, back to initial investment. Guess im hodling it instead."
    }, {
        "score": 3,
        "matches": ["icon", "walton"],
        "content": "When WTC had its big news, did it also dump like ICX before going up?"
    }, {
        "score": 3,
        "matches": ["ethereum", "ripple", "cardano", "neo", "stellar", "icon"],
        "content": "Looking for advice please!! I bought 4 litecoin back when it was $250. I dont feel great about it.. im wondering if i should just stick with it and ride it out in hopes of it rebounding or trade it at a loss for something else? If so, which coin to make up for that loss? My portfolio is about 50% ETH then in order of BTC  LTC  NEO  ICX  XRP  XLM  ADA"
    }, {
        "score": 3,
        "matches": ["ethereum", "ripple"],
        "content": "ETH 60% XRP 20% TIE 10% XVG 10%\n\nGood, Bad or Ugly?\n"
    }, {
        "score": 3,
        "matches": ["binance"],
        "content": "I have some questons about xrb. Right now I've got my xrb over on kucoin marketplace.  xrb is rebranding to nano and the binance listing is coming soon. \n\nShould I be planning to move my xrb to binance as soon as it goes live? \n\nShould I just toss it in a wallet and hodl? Or should I sell on the inevitable spike and try to time the correction to buy back in??\n\nWhat are my fellow xrb hodlers planning to do???"
    }]
}, {
    "title": "Weekly Skeptics Thread - January 28, 2018",
    "score": 101,
    "comments": [{
        "score": 5,
        "matches": ["ethereum"],
        "content": "I think the ultimate question that will determine prices in the next 5 years is how much do people value trustless money storage. Almost every crypto I've seen has a currency that seems disconnected from the platform/goals/capabilities of the technology. How does me having a million ETH help me make a dAPP? \n\nIMO people really got on the tech gravy train last yr and the market boomed because people began to see crypto as something more than a payment system and attached that sentiment to coin value. I do think crypto can probably extend beyond money but in most cases i don't think this has anything to do with the currency, and most ICO's (past and present) have been using the currency model as a way to get funding. They're basically securities lol.\n\nI personally think trustless money is huge, but I'm not so convinced a lot of other people put much weight into it."
    }]
}, {
    "title": "Mooning in January",
    "score": 12268,
    "comments": [{
        "score": 109,
        "matches": ["tron"],
        "content": "Tron hodler?"
    }, {
        "score": 3,
        "matches": ["ripple", "tron"],
        "content": "In the weeks I've been in this show, I went from TRX and XRP to TIE and VEN. Made some dumb decisions but nothing that destroyed my investment. Now I'm some secure investments, fascinated with the tech"
    }, {
        "score": 3,
        "matches": ["walton"],
        "content": "Glad I held wtc through January "
    }]
}, {
    "title": "RaiBlocks rebrand to Nano",
    "score": 4041,
    "comments": [{
        "score": 471,
        "matches": ["binance"],
        "content": "I guess the Binance listing has waited for this as well. Exciting times for Nano! :)"
    }, {
        "score": 234,
        "matches": ["binance"],
        "content": "I would bet Binance lists in the next few days.  Would make sense for them to have waited for rebrand.  "
    }, {
        "score": 230,
        "matches": ["binance"],
        "content": "This explains the delayed Binance listing. XRB will be NANO"
    }, {
        "score": 26,
        "matches": ["tenx"],
        "content": "Should have also split it, 1 rai = 1000 nano - don't wanna pay 0.00312 for a beer... "
    }, {
        "score": 12,
        "matches": ["binance"],
        "content": "Very smart of them to do this before the Binance listing and the name Nano just likes to roll off the tongue! New website looks great as well!"
    }, {
        "score": 3,
        "matches": ["tenx"],
        "content": "I panicked when I visited Coinmarketcap and couldn't find RaiBlocks. Genuinely feared the worst, thought it had dropped off the top 100 or been removed as a scam. Instead it has gone up more than 22%.\n\nI've got to say, Nano looks really cool. I like the name and the logo. I can really imagine seeing \"Nano Pay\" on contactless readers in the future and asking \"Can I pay with nano\". Oh man, I'm excited."
    }, {
        "score": 4,
        "matches": ["binance"],
        "content": "I'm hating on myself right now pretty hard.  Stupidly lost my 5 xrb on that betting site literally 2 days ago.  I feel really embarrassed for myself, and of course they rebrand and probably will be up on binance in not to long.  Lesson learned I guess..."
    }, {
        "score": 2,
        "matches": ["binance"],
        "content": "So, how long until Binance listing? Can't wait!"
    }, {
        "score": 2,
        "matches": ["walton"],
        "content": "Same thing happened to WTC a couple of days ago. The most important and relevant post was deleted, and a dead link was kept on the frontpage instead of removing the old dead link and having the new one stay open. "
    }]
}, {
    "title": "Rai.Exchange/Nanex has finally launched",
    "score": 1691,
    "comments": [{
        "score": 19,
        "matches": ["binance"],
        "content": "AND Binance around the corner? MOOOOON."
    }, {
        "score": 3,
        "matches": ["binance"],
        "content": "So this is just a traditional type of exchange, not a decentralized one?\n\nMeh. So why would I use it over the other exchanges? I'm certainly not impressed by the fees, which at best are competitive with Kucoin and Binance for trading. Maybe if they only had a 0.1% taker, fee..."
    }]
}, {
    "title": "Ethereum and Bitcoin appear to be separating. ETH is in a 14 day uptrend while BTC is still in a 25 day downtrend.",
    "score": 1906,
    "comments": [{
        "score": 326,
        "matches": ["ethereum"],
        "content": "Yep - still have a ways to go though. Bitcoin market cap is $170,515,497,088 vs ETH at $107,997,859,758. If Bitcoin starts going on a bull run it's going to pull back away. \nEDIT: ETH has to reach a price of $1,752 to overtake Bitcoin right now. That's not impossible, either."
    }, {
        "score": 427,
        "matches": ["ethereum"],
        "content": "ETH has so much less drama than Bitcoin."
    }, {
        "score": 93,
        "matches": ["ethereum", "neo"],
        "content": "I traded all of my BTC for more ETH and NEO yesterday..."
    }, {
        "score": 54,
        "matches": ["ethereum"],
        "content": "Now if only every altcoin would follow ETH instead of BTC"
    }, {
        "score": 4,
        "matches": ["ethereum"],
        "content": "Noticed this when Bitcoin and Litecoin were on an upward trend last month and ethereum started to stagnate. Since then it's been fairly divergent from the other popular coins."
    }, {
        "score": 4,
        "matches": ["ethereum"],
        "content": "Hopefully, we will see more price uncoupling so the currencies don't all move in sync. Love to see some break out of the overall market moves. Would be very healthy sign. ETH is clearly heading into the leading position."
    }, {
        "score": 5,
        "matches": ["ethereum"],
        "content": "ETH is a safe haven now often during a sell off you will profit with ETH in one day as everyone liquidates"
    }, {
        "score": 6,
        "matches": ["ethereum"],
        "content": "Yup, ETH is over 1 million satoshi now"
    }, {
        "score": 5,
        "matches": ["neo"],
        "content": "I noticed this as well. NEO held fairly strong against BTC drops but nowhere near as strong as ETH."
    }, {
        "score": 2,
        "matches": ["ethereum"],
        "content": "I've also noticed a different dynamic in Ethereum more or less since last summer. Here and there Ethereum acted differently than Bitcoin. But overall it has always followed the general crypto trend. Maybe this was just a lucky week.\n\nWould be nice though if more exchanges integrated Ethereum as base exchange and as a result it disconnected from Bitcoin. Ethereum is different enough from Bitcoin to have its own growth dynamic."
    }, {
        "score": 4,
        "matches": ["ethereum"],
        "content": "https://www.tradingview.com/x/bX4TtyWV/\n\nThe trend is in place. I personally am charting all my alts vs ETH now rather than BTC. "
    }, {
        "score": 3,
        "matches": ["ethereum"],
        "content": "People (used to?) say that Bitcoin might become the MySpace of crypto when we find the Facebook of crypto. Could Ethereum become the Facebook of crypto?"
    }, {
        "score": 11,
        "matches": ["ethereum"],
        "content": "Great, now can alts please start pairing with ETH & LTC (Shitcoins obvious replacement)?\n\nLiterally the only reason why anyone wants BTC to succeed right now:\n\n- They are idiots\n- They have heavy bags\n- They are afraid of the market crashing because normies don't know that there are things besides Bitcoin\n\nHeavy bags suck but we all got fucked by the crash.\n\nConsolidate into ETH, LTC & any other alts you like. Except Tether. Don't be a fucking idiot trading into Tether.\n\nGod if we have to have another 75% crash just to get rid of BTC it would so be worth it. RIP all my gains for a few years but at least we can be done with this garbage shitcoin."
    }]
}, {
    "title": "First Restaurant accepting XLM as Payment!",
    "score": 1134,
    "comments": [{
        "score": 83,
        "matches": ["stellar"],
        "content": "XLM might not be a 100x roi in the next month that noob traders are looking for... but this imo is one of the best hodl investments you can find.."
    }, {
        "score": 12,
        "matches": ["stellar"],
        "content": "Absolutely amazing! I am thinking of starting a tea Cafe in India, which would be stellar exclusive but not getting any support. I need to work on the economics until I get sufficient liquidity here in India.\n\nI am ready to bootstrap (CAPEX) the cafe with my own funds but need to figure out how to keep funds rolling for opex.\n\nAny guidance on this is highly appreciated.\nIf I can set up this, then it would be a good beginning in the adoption of the XLM from a country as populous as India. \n"
    }, {
        "score": 9,
        "matches": ["tenx"],
        "content": "I hope you didn't just pay $2980 for a $30 tab.  There's a period missing there right?"
    }, {
        "score": 7,
        "matches": ["stellar"],
        "content": "Think you got ripped off... 5k xlm for a $30 bill? "
    }]
}, {
    "title": "VeChain partners with iTaotaoke, an online self-publishing content platform, to establish fairness and accountability for content creators on a digital copyright protection platform",
    "score": 904,
    "comments": [{
        "score": 90,
        "matches": ["vechain"],
        "content": "Vechain is so broad encompassing that it is shocking. Partners with Universities, Tobacco industry, Chinese providential governments, Auditing powerhouse Pwc, and the list goes on and on. Truly amazing."
    }, {
        "score": 147,
        "matches": ["tron", "vechain"],
        "content": "Isn't this pretty much what Tron is trying to do? Vechain takes care of it with just one partnership lol."
    }, {
        "score": 52,
        "matches": ["vechain"],
        "content": "It seems Vechain is building a blockchain that is not only limited to use cases in supply chain or counterfeit area, but also in data security, identity verification, copyright protection, etc. etc. It is a comprehensive solution to all problems that blockchain tech can solve"
    }, {
        "score": 30,
        "matches": ["vechain"],
        "content": "When I need a laugh, I remind myself that there are people who think VeChain is a \"shitcoin\" and/or a \"scam\"."
    }, {
        "score": 13,
        "matches": ["vechain"],
        "content": "Can't wait for VeChain to partner with NASA so its rocket ship to the MOON soars high. Seriously though, they're everywhere and trying to do everything. Hope it won't be too much to handle"
    }, {
        "score": 41,
        "matches": ["vechain", "power"],
        "content": "I think we really need to distinguish between 'partners' and 'customers'.  This looks like a straight-up customer: they are going to be using the VeChain platform\n\n>to digitally identify every piece of content or media created as released by content providers, safeguarding and securing intellectual property rights of their entire user base.\n\nThey will be using the THOR token to power their tracking on the platform.  That's a customer.  Things like a collaboration with a university, membership in the IoT Trusted Alliance, or the set-up with PwC and DNV are partnerships.  It's worth making the distinction because actual customers are the things that make businesses profitable.  Partnerships are a way of getting those customers or developing the tech that the customers will need but this example is proper end-user adoption."
    }, {
        "score": 11,
        "matches": ["tron"],
        "content": "RIP Po.et and Tron"
    }, {
        "score": 20,
        "matches": ["vechain"],
        "content": "VeChain is going to make me rich this year, I can feel it in my ~~bones~~ boner. "
    }, {
        "score": 8,
        "matches": ["vechain"],
        "content": "Pls Vechain I'm out of fiat. I can't buy more."
    }, {
        "score": 41,
        "matches": ["vechain"],
        "content": "'Can VeLosers stop shilling VeChain so hard'\n\nIncoming."
    }, {
        "score": 25,
        "matches": ["vechain"],
        "content": "I think vechain has so much great news and partnerships, its starting to turn into a curse 😂 "
    }, {
        "score": 22,
        "matches": ["tron"],
        "content": "So, Tron will be irrelevant by the time their platform is ready? Got it."
    }, {
        "score": 26,
        "matches": ["vechain"],
        "content": "No wonder VeChain was the best perfoming crypto in January and there are no signs of stopping. So excited."
    }, {
        "score": 3,
        "matches": ["vechain"],
        "content": "VeChain is 60% of my portfolio and watching all these partnerships makes me very excited! I am def looking forward to the rebrand this month."
    }, {
        "score": 4,
        "matches": ["vechain"],
        "content": "& like usual, vechain drops another 10 cents..."
    }, {
        "score": 6,
        "matches": ["vechain"],
        "content": "As a VeChain investor, does the frequency and variety of these partnerships concern anyone else,?"
    }]
}, {
    "title": "Co-founder and CEO of Twitter: We Support Bitcoin; It Is A Path Towards Greater Financial Access For All",
    "score": 643,
    "comments": []
}, {
    "title": "OmiseGO primed for 2018! A breakdown of what we know.",
    "score": 229,
    "comments": [{
        "score": 32,
        "matches": ["ethereum", "omisego"],
        "content": "Excellent write up! OmiseGO has a LOT going for it right now. There are a lot of different products and projects:\n\n1. Whitelabel wallet SDK\n2. Decentralized exchange\n3. Cash in / cash out points\n4. Plasma development\n\nThe fact that it’s not one product can be confusing for people not familiar with the project, but it is exactly this point why OmiseGO will be successful in the future.\n\nI would encourage everyone to look into it further, if you are interested in the Ethereum community. OmiseGO are creating their own exciting products as well as working on a scaling solution for not only Ethereum, but they said it could help scale Bitcoin and Bitcoin like cryptos too."
    }, {
        "score": 16,
        "matches": ["omisego"],
        "content": "Omg is so good that it hurts. "
    }, {
        "score": 12,
        "matches": ["omisego"],
        "content": "Has all the ingredients doesn't it? Solid proven and trusted base platform, very strong development and advisory team, advancing existing proven tech instead of starting new, announced legitimate partnerships, excellent communication to the public, clear paths and goals. No BS or hype, just honest info. Refreshing really. OMG is arguably the most 'business like' model around I can see. Hard to believe they won't be one of the few major players when it all washes out. Other 'coins' should look at OMG as a 'how it's done' on quite a few levels.\n\nWhile it's no guarantee of future success, certainly more confident in this than most others I've researched. \n\nAppreciate the clear and evidence based communications. Keep it up."
    }, {
        "score": 15,
        "matches": ["omisego"],
        "content": "Well thought out post. This deserves to be on the front page. \n\nThe future of OmiseGo is very bright. We'll be seeing OMG climb the charts this year."
    }, {
        "score": 11,
        "matches": ["omisego"],
        "content": "I liked OmiseGO since I saw it rising from 0.50 to 1$. That time I regret I dropped only 20$ on Bitfinex, just for the giggles. Then I saw it rising to the level it is now, even though I have multiplied my \"investment\" I missed another \"BTC\" chance. I believe it will reach or maybe pass the price of NEO."
    }, {
        "score": 4,
        "matches": ["omisego"],
        "content": ">not having your omg bags filled already "
    }, {
        "score": 3,
        "matches": ["omisego"],
        "content": "Curious, are you guys able to store your OMG on the ledger?"
    }, {
        "score": 3,
        "matches": ["omisego"],
        "content": "Very well written and researched write up, Omisego is definitely poised for a steady rise in 2018"
    }]
}, {
    "title": "Welcome to crypto how tough are you?",
    "score": 205,
    "comments": [{
        "score": 35,
        "matches": ["ripple"],
        "content": "I bought XRP at 2.58$, still hodling ┌∩┐(ಠ_ಠ)┌∩┐"
    }]
}, {
    "title": "6 months ago I quit my job... 100,000 lines of code, 2 apps (native iOS & Android) and 1 product later, I'm eager to share with you my dream, Cryptonomy",
    "score": 112,
    "comments": []
}, {
    "title": "Ethereum Enterprise Alliance welcome over 80 new members.",
    "score": 291,
    "comments": [{
        "score": 39,
        "matches": ["ethereum"],
        "content": "List of new members:\n\nNewest Members The Enterprise Ethereum Alliance connects Fortune 500 enterprises, startups, academics, and technology vendors with Ethereum subject matter experts. With over 200 member organizations, the EEA is the world's largest blockchain initiative and we've recently welcomed over 80 new members!\n\n8base Inc.\n\nADS Securities\n\n**Advanced Micro Devices (AMD)**\n\nAmberdata\n\nAmbrosus Technologies GmbH\n\nAmerican Family Insurance\n\nApical IT Solutions Ltd\n\nArcBlock Inc.\n\nArtisan Productions, Inc.\n\nAsset Token\n\nB9lab Ltd\n\nBerkeley\n\nBeyond Manufacturing\n\nBitdegree Blockchain Learning Foundation\n\nbitfly gmbh\n\nBKX Corp\n\nBlockchain Association\n\nBlockchain Research Institute\n\nBLOCKSKYE INC\n\nBlockTech Ventures\n\nBlueMeme Inc.\n\nBrane Inc\n\nCharityStars.io\n\nCipherTrace\n\nCircularise B.V.\n\nCoinvest\n\nComae Technologies\n\nConfideal Limited\n\nCountyBlock\n\nCrowdz\n\nCryptica Capital\n\nCurrent\n\nDigital Treasury Corporation\n\nElement ASA\n\nEpiq Systems, Inc.\n\n**Ernst & Young (EY)**\n\nEth Capital Asset Management & Hedge LLC\n\nEUPSProvider s.r.o. (Worldcore)\n\nFedChoice Federal Credit Union\n\nGolden Gate University, Law School\n\nHADE Technologies LLC\n\nHefei Institutes of Physical Science, Chinese Academy ofSciences\n\nHM Government of Gibraltar\n\nHodlion.com\n\nidentitii Pty. Ltd.\n\nIGNATIUS COBB\n\nIndian Blockchain Council\n\nIndustrial Technology Research Institute\n\nInnodata\n\n**Kaspersky Lab**\n\nLaw Offices of Nathan Mubasher\n\nMarquette University\n\nmatrics.io (formorly Frost Fire)\n\nMonetha GmbH\n\nMTRM Industries Ltd. (\"Mattereum\")\n\nNAFCU\n\nOaken Innovations, Inc.\n\nOriginTrail Ltd\n\nPeregrine Foundation\n\nPetroteq Energy\n\n**Pfizer**\n\nQuisitive\n\nRipio International Ltd\n\n**Royal Bank of Canada**\n\nSEAL Network\n\n**SK Telecom**\n\nSmartKargo\n\nSmeSavings\n\nSpherik\n\nSteptoe & Johnson LLP\n\nTesla Foundation  **( Not Tesla Motor https://teslafoundationgroup.org/ )**\n\nThe Abyss\n\nThe Ananas Foundation\n\nThe BlockchainHub\n\nThe Institution of Engineering and Technology\n\nthecoinlab ltd\n\nTranscosmos Inc.\n\nTransformationWorx\n\nUnionBank of the Philippines\n\nUnited Traders\n\nUNIVERSAL COIN INTERNATIONAL INC\n\nViberate d.o.o.\n\nXAIN AG\n\nXinFin Fintech Pte. Ltd\n\nZap\n\nZenoic Pty Ltd\n\nEdit: Bold on \"most important\". Put other suggestions if you know some big one!"
    }, {
        "score": 2,
        "matches": ["ethereum"],
        "content": "Call me back Ethereum Enterprise Alliance"
    }]
}, {
    "title": "Bittrex adding USD trading pairs! Huge deal! Should help USDT concerns. Other exchanges should follow.",
    "score": 341,
    "comments": [{
        "score": 8,
        "matches": ["neo"],
        "content": "How about letting us access our neo first"
    }]
}, {
    "title": "The Tangle: an Illustrated Introduction – IOTA",
    "score": 271,
    "comments": []
}, {
    "title": "US Court freezes bitconnect's assets after lawsuits!",
    "score": 355,
    "comments": []
}, {
    "title": "ICON transactions are instantaneous, blocks are generated as transactions need them. It supports 3000 TPS right now, with 9000+ TPS with side channels!",
    "score": 664,
    "comments": [{
        "score": 43,
        "matches": ["icon"],
        "content": "All the news coming out from ICON summit seems to be great yet the prices are tanking like crazy. Cryptocurrency really is a piece of work to predict "
    }, {
        "score": 69,
        "matches": ["ethereum", "icon"],
        "content": "Everyone who doesn't buy this dip will regret it later on. ICX is quickly becoming a force to be reckoned with, I won't say the next/Korean Ethereum yet, but it's getting close! "
    }, {
        "score": 4,
        "matches": ["icon"],
        "content": "well im all in on ICON. im a crypto noob. but i have a feeling out of the 1500 coins on coinmarket bout 1400 will crash and burn. out of the 100 left, ICON seemed the best project at the lowest price.  hope i made the right choice!"
    }, {
        "score": 7,
        "matches": ["icon"],
        "content": "What's more exciting to me is all of the local, real world use cases for ICX in South Korea. When real businesses are relying on ICX to get stuff done, it'll be valuable by default whether it does 1mm TPS or not. "
    }, {
        "score": 2,
        "matches": ["icon"],
        "content": "ICON has the potential to be a $50-$100 by the end of 2018.  Personally holding a huge bag and excited to see to see their developments in the upcoming quarters.  "
    }, {
        "score": 2,
        "matches": ["icon"],
        "content": "Not to troll but how is Icon not just another Tron?"
    }]
}, {
    "title": "Bittrex USD Pairs soon :)",
    "score": 345,
    "comments": [{
        "score": 8,
        "matches": ["neo"],
        "content": "Now fix the neo wallet and you maybe have my interest again"
    }, {
        "score": 5,
        "matches": ["binance"],
        "content": "Thats absolutely incredible. As a BNB bag holder im upset I didn't sell at the peak, but these new fiat and decentralized exchanges coming out in the next 2 quarters are absolutely amazing."
    }]
}, {
    "title": "There are 3 types of work",
    "score": 269,
    "comments": []
}, {
    "title": "Iconomi announces first 7-figure buyback and much more!",
    "score": 164,
    "comments": [{
        "score": 4,
        "matches": ["ethereum"],
        "content": "Hmmmm original comment I had disappeared....\n\nThis is great news! I’m excited to see them keep expanding. The Big 4 Audit will be important, as well as the fiat gateway. I would love to see them try to tackle the legal environment in the US like Coinbase, Gemini, Robinhood, and Cash have and grant access to the US investors. This would be particularly big for the fiat gateway. Until then, I may slowly add some more ICN once I’m satisfied with how much ETH I’m holding onto. "
    }]
}, {
    "title": "INT/Internet Node Token mainnet launch in 7 hours.",
    "score": 92,
    "comments": []
}, {
    "title": "Welcome Alisa Maas to the IOTA Foundation",
    "score": 117,
    "comments": [{
        "score": 23,
        "matches": ["power"],
        "content": "\"The IOTA Foundation has it all: team, technology, form of organisation & ecosystem. I am very excited to be part of this movement to contribute pushing the envelope of technology and unlock the potential of IOTA for the mobility sector.\nPersonally, I believe that decentralized systems will also have a tremendous impact on society as the distribution of power & responsibility is a key tenet. The IOTA Foundation has the perfect setup to explore the potential of this technology in all dimensions.\"\n\n-Alisa Maas"
    }]
}, {
    "title": "South Korea will NOT ban Cryptocurrency exchanges. Phew!",
    "score": 727,
    "comments": []
}, {
    "title": "Day 31 of $15,000 Deposit 'On Hold' kraken.com",
    "score": 124,
    "comments": []
}, {
    "title": "ICON announces partnership with massive billion dollar Korean gaming company Smilegate",
    "score": 34,
    "comments": [{
        "score": 4,
        "matches": ["tron"],
        "content": "MEANWHILE TRON FANS ARE HIGHLY ANTICIPATING TRON DOGS"
    }]
}]