[{
    "title": "Daily General Discussion - January 21, 2018",
    "score": 131,
    "comments": [{
        "score": 48,
        "matches": ["walton"],
        "content": "Thank you VEN and WTC to keep my portfolio afloat! "
    }, {
        "score": 49,
        "matches": ["request"],
        "content": "Come on REQ you're killing me"
    }, {
        "score": 12,
        "matches": ["request"],
        "content": "Why are the mods sorting some posts with controversial first?\n\nI saw it happen with the Request announcement to fund projects build on their platform. And I've seen it with others too. Why is linking to a legitimate project update controversial? \n\nAll it did was put FUD and misunderstaing to the top.\n\n"
    }, {
        "score": 10,
        "matches": ["stellar"],
        "content": "I think I've got the Ultimate reddit shill portfolio - Ven, WTC, Xrb, eth, Req, Xlm and Eng, in that order. All I need is some neo/Icx, Any others you guys could reccomend? Holding long term."
    }, {
        "score": 25,
        "matches": ["vechain"],
        "content": "It always surprises me...the lack of selfawareness and immaturity of this community. People have turned this shit into like...sports, my team vs your team, and it makes NO sense at all.\n\nTake VeChain for example, lots of news has been coming out, and so there's been a lot of posts about it. It's been legitimate things, not just shilling, yet you have people in there FUDing the coin for no reason and shitting on it.\n\nI almost get the impression that these people are salty that they didn't get in on it before it started getting popular, and instead of just ignoring it and focusing on their own investments, they try to shit on it. It's like...if they can't have anything good, they don't want anyone else to either."
    }, {
        "score": 22,
        "matches": ["icon"],
        "content": "If this thing recovers fairly soon, ICX and VENs' prices will surge up as people who couldn't get in will get in at this opportunity.  "
    }, {
        "score": 13,
        "matches": ["ethereum", "neo"],
        "content": "Right, I bought in to BTC on 12th Dec just before the ATH, and had the excitement of seeing it go from 15k to 19k before the reality of the dip. Bought hard (relatively for me) in the dip, and spent yesterday understanding that Delta can organise all my holdings. Transferred all my transactions from my spreadsheet to Delta, and synced/backed it up to another device - plugging all those transactions in again would kill me! \n\nI like having everything organised and tracked in one place. Now feel like I can just hold, and keep an eye once a day (yeah right, that's an aspiration) in one place.\n\nI have split between BTC (25%), ETH (18%), VEN (13%), NEO (13%), \n\nRemaining ~30% is split between several others (XRP, REQ, XLM, ICN, ICX, BNB, AMB)\n\nIt's taken me about 6 weeks to get used to the dynamics of the whole thing, start 'understanding' some of the real world uses, rather than just speculating blindly. Learning how to try and identify a shill from a genuine recommendation.\n\nBasically I distrust you all equally, but as you can tell from my portfolio I've taken advice from this sub - so thanks for the chatter, especially guiding through apps etc. \n\nOpen to comments and suggestions."
    }, {
        "score": 17,
        "matches": ["request"],
        "content": "REQ is at a discount right now, it'll 1.5x within a week at most."
    }, {
        "score": 13,
        "matches": ["request"],
        "content": "REQ kind of looks like it wants to break out and surge, but I think the current BTC price is too risky for anything to really surge.  "
    }, {
        "score": 13,
        "matches": ["stellar"],
        "content": "IBM & Stellar XLM <3"
    }, {
        "score": 5,
        "matches": ["ethereum", "binance"],
        "content": "Sorry if this is a stupid question but I am new to cryptocurrency and just purchased a Ledger Nano S.  I currently do most of my exchanges on Binance.  It looks like Binance (and other exchanges) have fixed withdrawal fees.  Does that mean it's not worth moving your coins to a wallet until you have a lot?  \n\nFor example, ETH has a minimum withdrawal of 0.1 and a fixed withdrawal fee of 0.01.  So if I only moved the minimum, that's a whopping 10% withdrawal fee.  Of course if I moved 10 ETH, that's only a 0.1% fee which is much more palatable.  At what point is it worth it to move coins, especially if you do a lot of trading on exchanges?\n\nThanks in advance!"
    }, {
        "score": 4,
        "matches": ["enigma"],
        "content": "Enigma is close to 50% down from ATH, any developments coming in next few weeks for it to go up? "
    }, {
        "score": 6,
        "matches": ["icon"],
        "content": "Where’s the new up and coming r/cryptocurrency ie. this place 4 months ago, any other decent daily discussions (already check ethtrader 3 tines a day)? Anywhere that’s not obsessed with VEN ICX AND XRB.... please... I need this, Marla Singer. "
    }, {
        "score": 9,
        "matches": ["stellar"],
        "content": "Ok so it's time for xlm to moon. "
    }, {
        "score": 12,
        "matches": ["ethereum"],
        "content": "Really loving $8+ VEN right now. Stabilizing above .0075 ETH would be fantastic today..."
    }, {
        "score": 13,
        "matches": ["stellar"],
        "content": "The people who think the IBM blockchain supply chain commercial = a public commercial for Stellar are completely delusional.\n\nThat said, if I were a whale, I'd definitely spring for some super bowl air time for my largest bags"
    }, {
        "score": 8,
        "matches": ["binance"],
        "content": "[Not sure if anyone's seen this video from the Binance Ceo](https://www.youtube.com/watch?v=l8XNRTfPgZI)\n\n - basically explains how ico's get on Binance, how things work, future goals, and what they expect from ico's\n\n"
    }, {
        "score": 16,
        "matches": ["neo"],
        "content": "NEO is very low right now, so it’d be a steal for anyone who wants to dive in before she hits $150+ again"
    }, {
        "score": 5,
        "matches": ["binance"],
        "content": "Have they allowed new users onto binance yet? We need more new money coming in. "
    }, {
        "score": 5,
        "matches": ["neo"],
        "content": "Neo or WTS?"
    }, {
        "score": 3,
        "matches": ["cardano", "power", "request"],
        "content": "I'm an idiot and bought PRL near ATH and now I'm regretting it. I had intended to hold the coins I have now (ICX REQ POWR XRB ADA PRL) till the end of the year, but now I'm wondering if PRL was actually a decent long term hold."
    }, {
        "score": 3,
        "matches": ["icon"],
        "content": "ICX or XRB? Looking to hold longish term (<1 year)"
    }, {
        "score": 4,
        "matches": ["stellar", "request"],
        "content": "thinking of selling all for my XLM for REQ & OST. Any thoughts? Of course I've done my own research, I'm just looking for alternative perspectives as well."
    }, {
        "score": 4,
        "matches": ["tron"],
        "content": "Who the fuck still buys TRX besides PnD groups?"
    }, {
        "score": 14,
        "matches": ["walton"],
        "content": "Both WTC & VEN have been holding well or gaining when other coins have been dipping lately. Wondering if it’s people moving their money into more fundamentally solid coins. If so definitely a good trend!"
    }, {
        "score": 6,
        "matches": ["ethereum"],
        "content": "Guys, if I were to assume another big dip will come when the futures expire 26/1 and I wanna pull out the 25th to buy the 27th, whats the smartest way to do it?\n\nETH would drop with it so I wouldnt think converting into that. Tether?"
    }, {
        "score": 7,
        "matches": ["stellar"],
        "content": "If anyone is wondering about the xlm commercial during the afc championship game, no they don't mention xlm, only \"blockchain\". Still cool though"
    }, {
        "score": 10,
        "matches": ["vechain"],
        "content": "While I don't like all the hype and fomoing about VEN I still don't think this all hype is for nothing, VeChain is actually a great project, mb people are overreacting a little..."
    }, {
        "score": 10,
        "matches": ["walton"],
        "content": "WTC doesn't give a fuck about your dip "
    }, {
        "score": 7,
        "matches": ["binance"],
        "content": "Is it worth buying XRB now before it hits Binance or will it just be pumped and dumped?"
    }, {
        "score": 7,
        "matches": ["request"],
        "content": "Stocking up on REQ is really tempting but it's already 36% of my portfolio..."
    }, {
        "score": 8,
        "matches": ["tron"],
        "content": "Tom Brady goes all in on tron"
    }, {
        "score": 12,
        "matches": ["walton"],
        "content": "VEN has done well recently but I can't help but notice how easily WTC is moving up.\n\nWTC market cap is tiny in comparison, for what is an extremely promising project. Considering moving my stack from VEN to WTC."
    }, {
        "score": 3,
        "matches": ["binance"],
        "content": "Question for you guys - when you want to buy Binance altcoins with Coinbase/GDAX coins, do you buy Bitcoin or Ethereum? (or LTC/BCH but I figure no)"
    }, {
        "score": 3,
        "matches": ["enigma"],
        "content": "Is there any hype on the way that might get REQ, ENG and DBC back on their feet?"
    }, {
        "score": 3,
        "matches": ["ethereum"],
        "content": "I want to \"uprgade\" one of my mid sized holdings to my large size holdings. Currently my big holdings are VEN, NEO, ICX, BAT, and the midsized ones I'm considering buying more of are XLM, LINK, WTC, XRB, and ENG. In your opinion, which of the five should I buy more of?\n\nEdit: I also hold BTC and ETH\n"
    }, {
        "score": 3,
        "matches": ["tenx", "walton"],
        "content": "I currently hold xrp, snov  wtc and Ven. I want to eventually get rid of snov, should I invest more on wtc or ven? For what I read, it seems like Wtc is better, but Ven seems to have more hype.\n\nEdit: i really want to get xrb, but I'm cheap enough to not want to pay btc transfer fees (only able to buy in bitso)."
    }, {
        "score": 6,
        "matches": ["ethereum", "request"],
        "content": "I forgot I was using USD prices so instead of buying $50 each of REQ and XLM, it ended up being about $62-63 worth each...on the bright side maybe I bought about 25% more of good coins that will moon \n\nEdit: what should I swap about $60 of ETH for?"
    }, {
        "score": 6,
        "matches": ["walton"],
        "content": "Why WTC mooning? "
    }, {
        "score": 5,
        "matches": ["ethereum"],
        "content": "trade my ETH for NEO. thoughts?"
    }, {
        "score": 6,
        "matches": ["neo"],
        "content": "Neo looks so tempting at that price but Ven is just going to give back more profit when the market goes back up"
    }, {
        "score": 9,
        "matches": ["request"],
        "content": "The REQ subreddit seems extremely small for the amount of talk it gets on here. It also has as much subscribers as many big coins although the users currently online only stays at 400-600. Has me slightly concerned if there's any manipulation going on. Not here to spread FUD but as someone who holds it, it is something I think about. For example, the VEN subreddit has 10x more active users with less subs."
    }, {
        "score": 4,
        "matches": ["ethereum"],
        "content": "I’m ready to buy if there’s a crash. After last week, it’s a no brainer to buy on crashes. Also for those who are selling, are you just keeping the eth or btc or converting that into fiat?"
    }]
}, {
    "title": "New AutoModerator CryptoWikis Comments",
    "score": 25,
    "comments": []
}, {
    "title": "VeChain passes the first ever Cryptocurrency Disaster Recovery Plan from PwC",
    "score": 4600,
    "comments": [{
        "score": 132,
        "matches": ["vechain"],
        "content": "By completing this process, to the standards set by PwC and global enterprises, VeChain Thor and VeChain are one step further to cater to mass adoption.   This sentence interests me the most"
    }, {
        "score": 136,
        "matches": ["vechain"],
        "content": "Huge for enterprise adoption, while showing VeChain and PwC are committed to supporting the crypto-based business ecosystem VEN holders have invested in.\n\nBullish."
    }, {
        "score": 51,
        "matches": ["vechain"],
        "content": "Just read the article after seeing the tweet pop up. Very exciting, it's a step in the right direction and this will help people take VeChain more seriously when looking to transition. VeChain seems to be doing everything right at the moment :) it's nice to see companies starting to come up with solutions for mass adoption and gaining trust. \n\n"
    }, {
        "score": 7,
        "matches": ["vechain"],
        "content": "Do you guys actually read the article ? Has nothing to do with vechain technology. Wtf is wrong with you ppl "
    }, {
        "score": 36,
        "matches": ["vechain"],
        "content": "When I applied for a license for my hedge fund in China, this part is one of the biggest part that the Chinese government will look at.  This is serious stuff guys. Just making an analogy here. Vechain is setting new standards within the Cryptocurrency community! "
    }, {
        "score": 41,
        "matches": ["vechain"],
        "content": "This is big not only for Vechain but for the WHOLE cryptosphere. We're one step closer to mainstream adoption! "
    }, {
        "score": 71,
        "matches": ["ethereum"],
        "content": "VEN will have run like ETH had in the past year, jump in while you can."
    }, {
        "score": 24,
        "matches": ["vechain"],
        "content": "We've seen many projects and icos that got rekt by security or wallet issues. I'm glad Vechain step up their game and prepare for the worst."
    }, {
        "score": 53,
        "matches": ["binance"],
        "content": "Guys common. Disaster recover plan is the basic stuff in IT industry. Any IT organization over few million dollars profits should have disaster recovery plan. I design, draft and execute these plans in banks. Most of the exchanges have it. Binance have this. They don't boost that they have DCp. Becoz it is a basic stuff.   U can down vote. Very excited to see ur responses "
    }, {
        "score": 5,
        "matches": ["vechain"],
        "content": "Can someone explain to me what the value of the VeChain token is. Like what does it represent, do customers need it?"
    }, {
        "score": 9,
        "matches": ["vechain"],
        "content": "Posted to the Breyer reddit post, but it applies here, too:\n\n> These two tweets are not moon boy material, but smart investors will see what's happening.\n> \n> In order for BAAS to prosper, businesses must adhere to certain security standards. Those standards haven't been formalized yet. PWC is developing those standards with Vechain as the paradigmatic case and service provider.\n> \n> They're smoothing out the path to wide spread enterprise adoption by creating exhaustive security standards that will coexist with other network safeguards. Eventually, I expect PWC will sell the certification alongside Vechain's BAAS. It's a smart move and absolutely necessary if we want big business to buy Vechain services.\n> \n> Breyer's coincident Tweet and Medium article is no accident. In his role as adviser, I suspect he'll open up his network of business partners. Now, with one hurdle out of the way, security, Vechain is an easy sell to an business that can take advantage of blockchain tech.\n> \n> They sweetened the candy and Breyer will have an easy time selling it. Fantastic. Moon boys be damned; Vechain is something else entirely."
    }, {
        "score": 17,
        "matches": ["vechain"],
        "content": "vechain passes a plan designed by itself\n\n/r/unexpected"
    }, {
        "score": 3,
        "matches": ["vechain"],
        "content": "the heavy hitters involved with vechain and the huge partnerships they've been announcing have caused me to wondered if vechain is so plugged into to the market forces that led to these two january dips that they changed the date of the rebrand to coincide with a time that will be more generally bullish with the market. thoughts? "
    }, {
        "score": 13,
        "matches": ["vechain"],
        "content": "VeChain and VeChain Thor are really going places! PwC and the enterprises will make us great. New standards!"
    }, {
        "score": 8,
        "matches": ["vechain"],
        "content": "So Vechain uses cold wallets that are guarded by security to something similar to Fort Knox for the Vechain foundation fund? Sounds like a great way to guarantee partners any funds involving Vechain are safe and secure since the general perception of cryptocurrency is that it's high risk."
    }, {
        "score": 28,
        "matches": ["vechain"],
        "content": "Shills - shills everywhere.  Yes everyone knows VeChain is promising, but christ does every post have to be “Bullish!”, “Top coin!”, “Get in early!”\n\nThe more I see this the more I feel like were all getting played in the short term pump/gains while were flirting with a bearish market."
    }, {
        "score": 11,
        "matches": ["vechain"],
        "content": "I have said it once and I am going to say it again.  Vechain is going to be the biggest crypto thing since Bitcoin and Ethereum."
    }, {
        "score": 5,
        "matches": ["vechain"],
        "content": "Is VeChain a working product yet? I know they have  Chinese. clients lined up, and I understand what their tech does for food supply chain. But is it fully functional?"
    }, {
        "score": 3,
        "matches": ["vechain"],
        "content": "At first glance Vechain seems promising and I've decided to invest a little bit into it. But I don't understand why all the comments are 100% either in support of Vechain or against Vechain. I agree this accomplishment does seem news-worthy. But I do also see Vechain posts a lot on here. I understand people being excited about their coins but is that what is actually causing people to dismiss recent news from Vechain? Are there other factors causing people to dismiss Vechain other than being bombarded with news about it?"
    }, {
        "score": 3,
        "matches": ["vechain"],
        "content": "so do i read that right, vechain foundation invented that test themselves ? how is this news"
    }, {
        "score": 4,
        "matches": ["vechain"],
        "content": "Why does even vechain need a coin? Isn't that unnessesary? "
    }]
}, {
    "title": "Can't regulate crypto if..",
    "score": 1560,
    "comments": [{
        "score": 57,
        "matches": ["achain"],
        "content": "This post is obviously made in jest, but please remember that when the first major American regulation push comes, it will come from an administrative agency that will not be required to go through any Congressional hurdles.\n\nIn my opinion, the SEC will make the first move. Good crypto lawyers should be learning everything possible about the Administrative Procedures Act to try to head them off. "
    }]
}, {
    "title": "VeChain Tweet : 'I am proud to announce that as of today, Breyer Capital has agreed to support VeChain through an official advisory role,' - Jim Breyer, founder of Breyer Capital.",
    "score": 1839,
    "comments": [{
        "score": 151,
        "matches": ["vechain"],
        "content": "> James W. Breyer (born July 1961) is an American venture capitalist, founder and CEO of Breyer Capital, an investment and venture philanthropy firm, and a partner at Accel Partners, a venture capital firm. Breyer has invested in over 40 companies that have gone public or completed a merger, with some of these investments, including Facebook, earning over 100 times cost and many others over 25 times cost. On the Forbes 2016 list of the world's billionaires, with a net worth of US$2.4 billion.\n\nThis guy does his homework and is an expert in China's markets and investments, this just more solidifies VeChain's bright future.\n\nEDIT: \n\nNeed more proof how big this is? [Here he is](https://imgur.com/Z4jyVkB) standing in the center, on the right side of the president of **CHINA** (Xi Jinping). Oh, you might also notice Tim Cook (CEO of Apple) and Mark Zuckerberg (CEO of Facebook), who are barely noticeable among other elite.\n\n\nPhotos like this are very carefully staged in China. The closer you are to the president, the better the connection you have. What does it mean that the billionaire advisor to VeChain is standing directly side by side with the president? You decide..."
    }, {
        "score": 57,
        "matches": ["vechain"],
        "content": "> I am most interested in VeChain’s **top-percentile crypto team**. Additionally, I’ve found VeChain’s **enterprise partnerships and deep relationships with PwC and DNV GL to be compelling.**\n\nVechain is de facto the leading blockchain for enterprise solutions at the moment in terms of partnerships and so much more. Period. It is only a matter of time before we see Vechain in the top 5. "
    }, {
        "score": 50,
        "matches": ["vechain"],
        "content": "These two tweets are not moon boy material, but smart investors will see what's happening.\n\nIn order for BAAS to prosper, businesses *must* adhere to certain security standards. Those standards haven't been formalized yet. PWC is developing those standards with Vechain as the paradigmatic case and service provider.\n\nThey're smoothing out the path to wide spread enterprise adoption by creating exhaustive security standards that will coexist with other network safeguards. Eventually, I expect PWC will sell the certification alongside Vechain's BAAS. It's a smart move and absolutely necessary if we want big business to buy Vechain services.\n\nBreyer's coincident Tweet and Medium article is no accident. In his role as adviser, I suspect he'll open up his network of business partners. Now, with one hurdle out of the way, security, Vechain is an easy sell to an business that can take advantage of blockchain tech.\n\nThey sweetened the candy and Breyer will have an easy time selling it. Fantastic. Moon boys be damned; Vechain is something else entirely.\n\nEDIT: Shared via Telegram, seemed a worthwhile addition.\n\n> Anyone in IT will see parallels to Microsoft here.\n\n> MS didn't succeed by selling Windows. They sold certification services for network security, as well as software training. Microsoft became THE vendor for businesses and the onramp for widespread computer and network adoption.\n\n> Vechain is bringing the polish of Apple to the hungry enterprise market like Microsoft did in the 90's."
    }, {
        "score": 42,
        "matches": ["vechain"],
        "content": "Man it's starting to be uncommon when VeChain doesn't announce anything big haha"
    }, {
        "score": 52,
        "matches": ["vechain"],
        "content": "Oh, look who happens to be standing next to CHINESE PRESIDENT XI JINPING in this photograph... Could it be OFFICIAL VECHAIN ADVISOR JIM BREYER? \n\nhttps://www.np.reddit.com/r/Vechain/comments/7rv12o/more_proof_of_chinese_government_connection/?utm_source=reddit-android\n\nPhotos like this are very carefully staged in China. The closer you are to the president, the better the connection you have. What does it mean that the billionaire advisor to VeChain is standing directly side by side with the president? You decide.... "
    }, {
        "score": 18,
        "matches": ["vechain"],
        "content": "Is it just me or does VeChain announce a new partnership every other day? How substantial are these partnerships?"
    }, {
        "score": 12,
        "matches": ["vechain"],
        "content": "He does state that crypto businesses are generally over valued. I like that he chose VeChain, because as a VC, this guys wants to see money in a 3-5 year timeframe. It probably means that VeChain has room to grow, even though other cryptos may lower in value. I like the realistically approach and I guess this must make some headlines."
    }, {
        "score": 10,
        "matches": ["vechain"],
        "content": "vechain 100+ EOC."
    }, {
        "score": 23,
        "matches": ["ethereum"],
        "content": "Getting in on VEN at sub $10 is like getting in on ETH at sub $100"
    }]
}, {
    "title": "RaspPi + Lego BTC/ETH Ticker",
    "score": 530,
    "comments": []
}, {
    "title": "IOTA - Johann Jungwirth, the Chief Digital Officer of Volkswagen AG is joining the IOTA Foundation",
    "score": 1027,
    "comments": []
}, {
    "title": "High withdrawal fee on Binance is BS. Check the latest gas prices. Binance is gouging its customers",
    "score": 883,
    "comments": [{
        "score": 226,
        "matches": ["binance"],
        "content": "You are correct. They are not alone.  We continue to take business there. Also, the decimals points and dust issue, that's a Binance \"issue\". They love it and are actively working on it.   *Right*"
    }, {
        "score": 86,
        "matches": ["binance"],
        "content": "We need to get a large group together to tweet the shit out of the offical Binance account and CEO on twitter until something changes. I totally agree, they must be making an absolutely disgusting amount of money from just withdrawal fees alone"
    }, {
        "score": 26,
        "matches": ["ethereum", "tenx"],
        "content": "Agree. I believe that the withdrawal cost should be dynamic.  0.01 ETH is > $10, while these days $0.25 - $1.25 is what I pay for quick transactions. Most of the time it is < $1."
    }, {
        "score": 10,
        "matches": ["binance"],
        "content": "I was banned for criticizing Binance on its subreddit."
    }, {
        "score": 7,
        "matches": ["stellar"],
        "content": "0.01 XLM ain't too bad. "
    }, {
        "score": 7,
        "matches": ["ethereum"],
        "content": "Anyone know of a cheaper exchange that supports Equihash coins and ETH or LTC?"
    }, {
        "score": 7,
        "matches": ["binance"],
        "content": "Hate to say it but this is a product of lack of viable competition. Binance can gouge because their competitors suck. Bittrex has been a mess lately and need to get their shit together."
    }, {
        "score": 13,
        "matches": ["binance"],
        "content": "Like it or not, withdrawal fees are part of a business model.  Each of us needs to take the combined fees (trade, deposit, withdraw, etc.) in to account when choosing an exchange.  I believe the number of complaints are due to the fact that Binance is really the one stop shop for exchanges.  It is at the top of the list. Until more competitive exchanges come to market, all of us don't have a choice... or really any say in the matter.\n\nTLDR: It sucks, but **without leverage, customers have no voice.** I think in the next few months we will start to see the rise of other exchanges, then, and only then, will big exchanges take notice."
    }, {
        "score": 3,
        "matches": ["neo"],
        "content": "At the same time they have never charged for a NEO withdrawal when Bittrex was charging 1 ANS at its peak just for the privilege of taking your crypto off the exchange.  "
    }, {
        "score": 4,
        "matches": ["binance"],
        "content": "I bought 1.38 Salts with Ether on Binance. Then I transferred the 1.38 Salts to my Exodus and it showed up as 0.17 Salts. The Salt is now gone from Binance and it's not in my Exodus... so where is it?     \n     \nHas anyone ever had fifteen dollars worth of value (this was pre-crash) just disappear after a transaction from Binance? I'm scared to use them ever again"
    }, {
        "score": 5,
        "matches": ["neo"],
        "content": "Use Neo on binance. 0 fees. "
    }, {
        "score": 2,
        "matches": ["stellar", "binance"],
        "content": "Use XLM as an intermediary. Fees to send is essentially a cent and is crazy fast. Sending between Binance and Bittrex is a breeze now."
    }, {
        "score": 2,
        "matches": ["request"],
        "content": "20 REQ and 2 VEN are outrageous withdrawal fees"
    }]
}, {
    "title": "The ICON team seems to be extremely confident on their upcoming Annual Summit on 31st Jan. Let's find out what will their deliver!",
    "score": 325,
    "comments": [{
        "score": 21,
        "matches": ["icon"],
        "content": "And the ICON main net is launching publicly in 3 days (24th Jan) for those who didn't know!"
    }, {
        "score": 46,
        "matches": ["icon"],
        "content": "Mark my words, Icon is going to to be 20 $ by end of month! At worst! It's so cheap now only because of huge sell walls. Korean exchanges, Main net launch and Summit, too many huge things coming."
    }, {
        "score": 12,
        "matches": ["icon"],
        "content": "This is a cryptic tweet. There is more to it than just \"going to the moon\". They talk about the coincidence of the super blue red moon that is happening the day of the icx summit....but they made it sound like it was a hint for something. Super blue red moons is based off three events occurring simultaneously. In relation to icx 1) mainnet 2) the summit and 3) a third event. Possibly a major partnership?\n\nSo started looking and Visa is a blue logo....MasterCard logo having *two moons*, one being red. (A blue moon is when two full moons appear in one month).\n\nThen I see this posted...\n\nhttps://medium.com/@gregjanderson20/visa-secure-banking-with-icon-d915f9b0b5bb"
    }]
}, {
    "title": "Mining on your parents' power",
    "score": 501,
    "comments": [{
        "score": 6,
        "matches": ["tenx"],
        "content": "Well and you should pay for it with your mined money."
    }]
}, {
    "title": "Stellar Lumens Has all it takes To Be a Top Cryptocurrency",
    "score": 269,
    "comments": [{
        "score": 66,
        "matches": ["stellar", "binance"],
        "content": "I love using XLM to transfer funds from Bittrex to Binance and back again. No matter how large, it costs me 5cents."
    }, {
        "score": 31,
        "matches": ["stellar"],
        "content": "I have faith in Stellar because of IBM. Have to be patient and wait it out."
    }, {
        "score": 6,
        "matches": ["stellar"],
        "content": "I got airdropped Stellar last year. No complaints."
    }, {
        "score": 3,
        "matches": ["stellar"],
        "content": "I think the major issue with xlm is the ability for it to moon much further. Yes, its a coin with good fundamentals but i guess new blood are looking for massive gains. With the current market cap, people dont see how it will ‘x1000’.  The recent continuous dip without much rebound probably has shunned investors away too. I too am holding quite a big % but has been considering to shift for others that has more promising gains. Alot of people are in for the moolah anyway. "
    }, {
        "score": 2,
        "matches": ["stellar"],
        "content": "Yesterday I transferred XLM to a new wallet in order to buy MOBI. It took about a second or less, literally. The more I read about this coin the more I like it. "
    }]
}, {
    "title": "Trevon James is at it again, so please be aware of his latest BitConnectesque scams folks. !!! DavorCoin and ThornCoin !!!",
    "score": 240,
    "comments": []
}, {
    "title": "VeChain overtakes RaiBlocks to make it to the Top20",
    "score": 114,
    "comments": [{
        "score": 12,
        "matches": ["binance"],
        "content": "Lol wait till Rai gets on binance "
    }, {
        "score": 2,
        "matches": ["vechain"],
        "content": "VeChain VeChain VeChain VeChain VeChain VeChain...... I am big into VeChain but the 10+ post a day about unimportant fluff is starting to get annoying asf! And if I'm getting pissed off I'm sure many others are too. Just stop the constant shilling we've heard about VeChain for the last month non-stop can you please now SHUT THE FUCK UP ABOUT VECHAIN!"
    }]
}, {
    "title": "I work for one of Canada's big banks and our organization was sent an email about cryptocurrency! I thought I would share.",
    "score": 361,
    "comments": [{
        "score": 71,
        "matches": ["ethereum"],
        "content": "I use RBC and have never had an issue, in fact they've been really welcoming at a few different levels. My account manager is an early Ethereum investor as well lol"
    }, {
        "score": 3,
        "matches": ["achain"],
        "content": "This feels like a final act of desperation that will end very poorly for the bank.\n\nHow do they expect this to work out, except for people leaving with their funds and going to another bank who is willing to work with them?\n\n"
    }]
}, {
    "title": "I created a valuation model for Ethereum (ETH)",
    "score": 537,
    "comments": [{
        "score": 71,
        "matches": ["ethereum", "neo", "power", "request"],
        "content": "This a continuation in my series of analytical reports for various cryptocurrencies, from a fundamental and quantitative Excel modeling perspective. These are the previous valuation reports:\n\n* Part 1 - [A fundamental quantitative valuation of Bitcoin](http://np.reddit.com/r/CryptoCurrency/comments/7n47be/i_built_these_3_fundamental_valuation_models_for/)\n\n* Part 2 -  [A fundamental quantitative valuation of REQ (Request Network)](http://np.reddit.com/r/CryptoCurrency/comments/7njeff/a_fundamental_quantitative_valuation_of_req/)\n\n* Part 3 - [A fundamental quantitative valuation of VEN (VeChain)](http://np.reddit.com/r/CryptoMarkets/comments/7p7ssy/i_created_a_fundamental_quantitative_valuation/)\n\n* Part 4 - [A fundamental quantitative valuation of FUN (Funfair)](http://np.reddit.com/r/CryptoCurrency/comments/7qc336/i_created_a_valuation_model_for_fun_funfair/)\n\nToday I will attempt to value Ethereum, one of the core holdings of most portfolios and the #2 largest cryptocurrency on the market.\n\n**If you already know about Ethereum, you can skip to Section B for the valuation model**, however first a brief overview of the fundamentals:\n\n---------------------------------------------------------------------------------------------------\n#Section A: A fundamental analysis of ETH\n\n\n**Tech/Asset overview**\n\nEthereum is a decentralized \"smart contract\" platform, and is said to be the first [Turing Complete](https://en.wikipedia.org/wiki/Turing_completeness) blockchain. In addition to executing payment-style transactions like Bitcoin, arbitrary code (programs) can be run through the Ethereum Virtual Machine (EVM). Every node in the Ethereum network executes operations within the EVM to ensure redundantly correct execution and relies on consensus to agree on the answer.\n\nEthereum runs of a token called Ether (ETH). The protocol uses a pricing mechanism called Gas, and this gas limit is paid in Ether. This gas limit is the amount of compute power you're asking the network to run in order to execute your smart contract or transaction. The Ethereum protocol actually defines an amount of gas required to process every single instruction available within Solidity, Ethereum's programming language. \n\n\n\n**Target Market Analysis: What is the transactional problem or inefficiency it attempts to solve?**\n\nEthereum's ability to run decentralized smart contracts opens the possibility for decentralized applications/organizations. What Ethereum proposes in effect is a global computer that could not only handle store of value transactions but also eventually emulate many of the functions of companies like Uber, Airbnb, Dropbox, Amazon, and Kickstarter, but without the inefficient bureaucracies and the other intermediaries who take a slice of the pie.\n\nCurrently Ethereum's platform underlies much of the new ICOs being created. In the future its expected that dApps would run on the blockchain and allow companies to offload much of their processing needs onto the blockchain. In essence its almost like running your organization on a cloud, except its one that its trustless and secured b the blockchain structure.\n\n\n**What is the Development Team like?**\n\nThere are currently 35 developers participating in the open source development process, however the direction is controlled by the Ethereum Foundation:\n\nhttp://www.ethereum.org/foundation\n\nEthereum's founder Vitalik Buterin is probably as close as we'll ever get to having a figurehead for the cryptocurrency movement, and his opinion on what's going on in the space is closely followed. He attended the University of Waterloo but dropped out in 2014, when he received the Thiel Fellowship in the amount of $100,000, and went to work on Ethereum full-time.\n\n\n**What current product/partnership exists?**\n\nEthereum-based customized software and networks, independent from the public Ethereum chain, are being tested by enterprise software companies. Interested parties include:\n\n* Microsoft\n* IBM\n* JPMorgan Chase\n* Deloitte\n* Innovate UK (cross-border payments prototype)\n\nCurrently Barclays, UBS, Credit Suisse are experimenting with Ethereum blockchain to automate markets in Financial Instruments Directive (MiFID) II requirements.\n\nIn March 2017, various blockchain start-ups, research groups, and Fortune 500 companies announced the creation of the Enterprise Ethereum Alliance (EEA) with 30 founding members. By May, the nonprofit organization had 116 enterprise members—including CME Group, Toyota Research Institute, Samsung SDS, Microsoft, Intel, J.P. Morgan, Cooley LLP, Merck KGaA, DTCC, Deloitte, Accenture, Banco Santander, BNY Mellon, ING, and National Bank of Canada.\n\nYou can see more at:\n\nhttp://entethalliance.org/members/\n\n**What is the roadmap going forward?**\n\nThe Ethereum framework is continually evolving, with a major Constantinople software update expected this year to revolve around moving from POW to Proof of Stake, with the [Casper POS protocol](http://blog.ethereum.org/2015/08/01/introducing-casper-friendly-ghost). In Casper style proof of stake, anyone can participate in block production by posting a bond. After posting a bond you have an opportunity to bet on which block will be included next to the main chain. The incentives are such that you make money by betting with the eventual consensus and lose money by betting against the consensus. Any crypto-graphically provable misbehavior results in the forfeit of the bond.\n\n**What are the weaknesses/problems related with this cryptocurrency?**\n\n* Ethereum isn't as developer friendly as some of its competitors in many ways. For example NEO has a compiler that supports multiple mainstream programming languages, while Ethereum has for a long time relied on Solidity. Good news is that there are projects in the works to bring full support for more common languages like Java and C++\n\n* Ethereum has a larger \"attack surface\" in that it allows executable code on a distributed system. What do we do when some criminal person (or group of people) exploits a bug in the smart contract?\n\n* Difficult long-term scaling considerations. While cryptokitties brought the Ethereum network to its knees because of the 25 tps limit, the POS migration will hopefully allow an exponential increase in throughput.\n\n\n---------------------------------------------------------------------------------------------------\n"
    }, {
        "score": 7,
        "matches": ["ethereum"],
        "content": "Thank you very much for your efforts!! I suggest you post on r/ethtrader too. Some  points:\n\n1) vitalik suggests 1%-3% staking ROI on [unchained podcast](http://unchainedpodcast.co/vitalik-buterin-creator-of-ethereum-on-the-big-guy-vs-the-little-guy)\n\n2) Eth will be also used as governance currency across different shards that will further decrease velocity (holding incentive)\n\n3)fee abstraction might decrease the demand for eth as gas currency in the future (unconfirmed)"
    }, {
        "score": 3,
        "matches": ["request"],
        "content": "Hilarious timing, my dude.  I had just gone through and bookmarked your REQ and VEN models this morning.  Keep up the great work!"
    }, {
        "score": 3,
        "matches": ["ethereum"],
        "content": "Thank you for providing this. Well done. I think velocity will likely increase in the future as we reach scalability, though this may be partially offset by hodling with proof of stake. I think overall though, as fees drop and transferring eth becomes frictionless, velocity will probably be higher than your current assumption."
    }, {
        "score": 4,
        "matches": ["ethereum"],
        "content": "Thanks for posting this and all the work you have put into your write-up!\n\nWhile I agree with the structure, I think that your model is way to pessimistic, though. \nTwo things beyond staking should be deducted from the float:\n\n1) ETH as store of value\n\nThere are lots of individual hodlers and - possibly - future ETFs. In my own calculations I expect this to be 80% or more of Q. \nParts of it may go to staking but certainly not everything.  \n\n2) ETH bound in medium to long term contracts\n\nThe quantity of this is hard to assess and depends on future use cases. \nIf, however, Ethereum will play a major role in the coming M2M economy, the wallets of all these machines alone will bind considerable amounts of ETHs. Other use cases such as e.g. atomic swaps with other blockchains, credits, escrows etc. will also increase the scarcity of floating ETHs. \n\nAll in all, I would expect no more than 10% of Q (probably even less) being available for circulation. \n\nThis would bring the current value to roughly 5x your estimation, i.e. $9,000.\n\n "
    }, {
        "score": 2,
        "matches": ["stellar"],
        "content": "Can you please do one for Stellar (XLM)?"
    }, {
        "score": 2,
        "matches": ["monero", "komodo"],
        "content": "Yes, I enjoy /u/arsonbunny posts as both education and informative. Some of the best out there and as such I wish he had his own subreddit as it's near on impossible to subscribe via to just one person on reddit! :) \n\nLooking forward to his take on the privacy coins! Monero, Zcash and Komodo - Monero seems to be king but Komodo has an ecossytem.... hmm."
    }, {
        "score": 2,
        "matches": ["ethereum"],
        "content": "You’re one of my favorite posters, thanks for taking the time to do this. I can see how valuing eth would be difficult - the TAM could easily be expanded to include other applications like games, prediction markets, and many other types of services that aren’t currently rendered by internet companies. Readers should note that these are indeed conservative predictions and ultimately ether could also shift to being perceived as a store of value when PoS lands, adding another component to its value besides utility and speculative value.\n\n"
    }]
}, {
    "title": "NEO feels a LOT like ETH circa May 2017",
    "score": 194,
    "comments": [{
        "score": 79,
        "matches": ["ethereum"],
        "content": "The automod of this sub is just a trash generating spammer.  Half of the posts end up full of garbage from it. \n\nEdit, sorry to hijack your post OP. It was just the fourth  one in a row where a long winded, and completely unnecessary explanation of ETH was left by the automod. Of course now I look like the douche because the automod post is gone. "
    }, {
        "score": 17,
        "matches": ["neo"],
        "content": "I fucking hope so. hodlin bags of dat neo"
    }, {
        "score": 20,
        "matches": ["neo"],
        "content": "“B...but, it’s centralized!”\n\nYou guys are going to witness something incredible as smart money gobbles Neo up, they don’t care if it’s centralized or not."
    }, {
        "score": 69,
        "matches": ["vechain"],
        "content": "Wait a sec, this isn't a Vechain post....how did this get to the front page?"
    }, {
        "score": 24,
        "matches": ["neo", "tenx"],
        "content": "I absolutelly agree with you. A lot of people are attacking NEO, but no other alts, when NEO really has a mature model. Think about it, pay and spend eth? just buy gas! or instead, buy NEO, which produce gas, and use it. Just this mode of use the platform is much profitable than ETH, and in my opinion, will make NEO to be one of the lasting ones in this alt war. "
    }, {
        "score": 11,
        "matches": ["ethereum", "neo"],
        "content": "NEO already had an ETH like price explosion. ANS was fucking cheap."
    }, {
        "score": 2,
        "matches": ["neo"],
        "content": "Noob question, do you generate NEO-GAS if you have it sitting in an exchange? I tried to transfer it to a wallet today and learned that you can only send integers (0,85 NEO atm lol)"
    }, {
        "score": 2,
        "matches": ["neo", "binance"],
        "content": "Does NEO also generate GAS when it’s on binance f.e ?"
    }]
}, {
    "title": "Bitcoin accounts for 0.19% of the world's total energy consumption",
    "score": 208,
    "comments": [{
        "score": 2,
        "matches": ["power"],
        "content": "Alright, there is a lot of emotional reactions here. Let's put in some basic and lazy maths.\n\nSo according to https://blockchain.info/charts/hashrate the current network hashrate is just under 20,000,000 TH/s, which equated to about 1,5 million s9 antminers https://antminersshop.com/index.php?route=product which are fairly efficient hardware. We can assume that the average efficiency is worse than this, but this is just for arguments sake.\n\nNow if we assumed the efficiency of the s9 that would give us a power use of about 1,96GW/s, this gives us a yearly power use of  17TWh, or not even 40% of what the article claims. \n\nNow these are really conservative assumptions based on quick and lazy Google searches, anyone with actual hardware experience who can comment?\n\nEdit, autocorrect nonsense"
    }]
}, {
    "title": "South Korean Bill Requires Public Officials to Declare Crypto Investment",
    "score": 318,
    "comments": []
}, {
    "title": "$10 trillion market cap for crypto: RBC Capital",
    "score": 466,
    "comments": []
}, {
    "title": "It's illegal to block South Korean exchanges!!!",
    "score": 549,
    "comments": [{
        "score": 39,
        "matches": ["icon"],
        "content": "Icon to the moon!\n\nNeo!\n\nVen!\n"
    }]
}, {
    "title": "NVIDIA Tells Retailers To Sell To Gamers, Not Cryptominers As GPU Shortage Causes Extreme Price Gouging",
    "score": 232,
    "comments": [{
        "score": 11,
        "matches": ["tenx", "request"],
        "content": ">Ultimately, NVIDIA can request whatever it wants, but it's up to etailers and brick and mortar retailers to actually enforce those suggestions.\n\nWhat a load of horseshit.  If ANYONE has any pull in the market it's nvidia and AMD.  If they wanted to do something about it they could 100% do something about it.  And I'll tell you right now that once mining becomes obsolete, whenever that may be, the PC enthusiast market will remember which company helped the gamers.  Huge PR possibilities right now that could potentially reverberate for years.  \n\nIf one of those companies figures out how to get cards to gamers, it'll pay off in the long run imo.  "
    }]
}, {
    "title": "Russian Ministry of Finance to Legalize Cryptocurrency",
    "score": 58,
    "comments": []
}, {
    "title": "Payfair (PFR) Just released their promotional video which includes an explanation of their vision!",
    "score": 90,
    "comments": [{
        "score": 2,
        "matches": ["binance"],
        "content": "so... my guess binance is paid in pfr for listing. "
    }]
}, {
    "title": "Doug Polk. The voice we need.",
    "score": 396,
    "comments": []
}, {
    "title": "The whales are only going to grow more violent this year, so if you can't stomach the waves... ya best get out the boat!",
    "score": 764,
    "comments": [{
        "score": 6,
        "matches": ["ethereum"],
        "content": "Here's the safest way to invest in crypto: Have a fiat position to take advantages of dips, Have a bitcoin position because it's the coin that controls the market with trading pairs (along with ethereum), and choose the coins you love. so 15% BTC, 15% Ethereum, 15% Fiat, Rest is altcoins (the riskier but more profitable investments). \n\nRemember the pattern bitcoin goes up and down (considerably) altcoins go down, Bitcoin moves slowly or stays the same altcoins go up. \n\nIf your not going to trade at all then divide that fiat among BTC and ethereum and go outside and come back in a year or two to find if your investments have tripled."
    }, {
        "score": 3,
        "matches": ["ark"],
        "content": "holders of these hyped up vapourware coins that have current ludicrous caps are gonna be the worst hit. Go for coins that have serious tech where your investment is safe for long term. eg: ARK :)"
    }, {
        "score": 2,
        "matches": ["ethereum"],
        "content": "Bruv, I have day traded up to 2 ETH during the last 72hrs."
    }]
}]