[{"title": "Daily General Discussion - February 12, 2018", "score": 110, "comments": [{"score": 27, "matches": ["ethereum", "neo"], "content": "For those of you who invested early last year or before that, how much are you up now off your initial investment? How much was your ATH up?\n\nDo you veterans think we have a year left of gains anything near last year?\n\nIt blows my mind that ETH was at $11 this time last year and NEO at $7."}, {"score": 11, "matches": ["neo"], "content": "Ahh I need more NEO I need more TRAC I need more VENopolus. This bargain time is killing me. "}, {"score": 8, "matches": ["ethereum"], "content": "I've only got a small portfolio of like, $550 distributed across BTC, ETH and XRP. New to this crypto currency thing. I plan on holding for the long haul. Looking to dump some more $$ every month into it as I further conduct research and become a little more comfortable with it all. I don't think I'd risk dumping a shit ton of capital in the hopes of striking it rich, but my goal is to hopefully make a surprisingly decent chunk of money years down the road. \n\nTons of great info being posted and I'm reading it all daily. Waiting on my physical wallet to arrive before I dump any more cash.\n\nAnyone else sort of following suit?  "}, {"score": 8, "matches": ["neo"], "content": "To what extent is NEO decentralized?"}, {"score": 8, "matches": ["walton"], "content": "Since WTC has pretty low circulating supply, does that mean WTCs price can go up pretty quickly to the 100sish?"}, {"score": 7, "matches": ["ethereum"], "content": "why is Ethereum classic gaining so much compared to ETH?"}, {"score": 7, "matches": ["enigma"], "content": "Why the ENG pump?"}, {"score": 12, "matches": ["binance"], "content": "Soo binance listing NEP-5 tokens soon? Looking good for NEO..."}, {"score": 6, "matches": ["walton"], "content": "Anyone else have a similar portfolio? XRB, ETH, USDT, NEO, and a smidge of WTC"}, {"score": 6, "matches": ["omisego"], "content": "Holy sweet baby jesus, does it really cost 0.69000000 fee to Withdraw OMG from Binance? "}, {"score": 12, "matches": ["neo"], "content": "Why didn't I buy NEO at 66.\n\nWHY.\n\n"}, {"score": 11, "matches": ["request"], "content": "It's good to see REQ starting to recover a bit after the heavy hit it has taken. It was pumped way too hard when it hit it's ATH and it was certainly overpriced. \n\nWhen they released one of their biweekly updates about outsourcing work and basically just confirming that the project has a long way to go (which anyone that looked into the project properly would know), people started dumping it and some even started to spread FUD about it.\n\nIt's a great concept and I'm super bullish on the project, but it shouldn't really be a top 50 coin at least until mainnet comes out. Heres for a big 2018 though!"}, {"score": 5, "matches": ["ethereum", "neo"], "content": "Im wondering whether I should invest in NANO instead of ETH or NEO (not debating the possibility of a split here). NANO is about 1/3 of its ATH, while ETH and NEO are ~60%(?). So expecting all three of them should at least reach their ATH this year, Id somehow expect NANO to rise more. Where do you think NANO will end up and the end of the year and why? Whats the purpose & value of the coin that justifies its EOY position?"}, {"score": 4, "matches": ["ethereum"], "content": "If I'm trying to play the long game here, is there any drawback to just parking my FIAT 50/50 in BTC and ETH? I do have some XRB sitting in a wallet but as a relative newbie the alt-coin world is pretty overwhelming. Don't mind if I miss out on a 24-hour 1000% rise as long as BTC and ETH are mainstays long-term."}, {"score": 5, "matches": ["ripple"], "content": "Hi guys! I have a couple thousand invested in XRP and I’m considering getting some XLM. Would it be worthwhile to convert half of my XRP holdings into XLM( don’t have additional fiat at this time) Thanks!"}, {"score": 4, "matches": ["icon"], "content": "ICX or EOS ?"}, {"score": 5, "matches": ["enigma"], "content": "should I sell RLC, TNT, AND VIB and get ENG ?? What do you all think ?"}, {"score": 5, "matches": ["ethereum"], "content": "Ethereum finally broke away from 0.1 BTC value ratio? "}, {"score": 5, "matches": ["tenx"], "content": "I'm a dummy:\n\nA question about Nano (Xrb). If it's primarily supposed to be a currency, why would someone choose them over Visa? When I pay with a card it usually takes a second or two, I've used Xrb and it still takes about 10-20 seconds. Why would anyone choose a slower alternative to what is already established? Is it that it's feeless? "}, {"score": 5, "matches": ["stellar"], "content": "Is anybody else not puzzled by XLM at .38 cents right now? Seems like a steal at that price."}, {"score": 3, "matches": ["stellar"], "content": "Did I make a mistake by investing heavily into xlm (35% of portfolio) "}, {"score": 10, "matches": ["icon"], "content": "ICX moving up nicely right now. :D"}, {"score": 5, "matches": ["enigma"], "content": "Hey guys so I want to create a portfolio that covers different categories. Currently I hold:\n\nSupply chain/platform: V3CH41IN  (80%)\n\nPrivacy: ENG (10%)\n\nBlockchain 3.0: NAS (10%)\n\nAre there any other categories that will be big in the future? Is it even necessary to categorize? Some other categories I was thinking IoT (Tangle) (IOTA/PRL), currency (suggestions), and maybe some niche pick like a gaming coin (WAX). I'm open to anything else :)"}, {"score": 5, "matches": ["walton"], "content": "why can't wtc just rise above $30 again :/"}, {"score": 7, "matches": ["ripple", "neo"], "content": "Why does Ripple get a disproportionate amount of hatred, when it's no more centralised than coins like NEO or Stellar?"}, {"score": 6, "matches": ["tenx"], "content": "I just realized that Nano is indeed a much better name than RaiBlocks.\n\nI started to look at altcoins in December and didn't pay much attention to XRB despite the shilling. I thought it was a sketchy named coin RailBlocks which I thought was exaggerated to be fast (as a train). Had it been named Nano back then, I as a very new investor who was a total noob, wouldn't have been made weary by the name, and I would have bought much earlier. \n\nI still did buy RaiBlocks before December ended but it's so significant that a more \"proper\" name would have made me, a new investor, much more likely to buy.  "}, {"score": 2, "matches": ["ethereum", "neo"], "content": "If I convert would it be cheaper to convert my ETH to NEO, then move it off of Binance? If so, where can I turn NEO into fiat currencies? I really don't have a lot, and so the 0.001 fee would really hurt me."}, {"score": 2, "matches": ["binance"], "content": "I'm not sure if I read a while ago that Binance will lower their withdrawal fees.  Is it a made up memory or is such thing expected in the near future ?"}]}, {"title": "Weekly Skeptics Discussion - February 11, 2018", "score": 107, "comments": [{"score": 30, "matches": ["ripple", "stellar"], "content": "Currently XLM has only 17.4% of its supply released. \n\nhttps://dashboard.stellar.org/\n\n\nAccording to their mandate the 20% of the 95 billion remaining XLM should have been distributed to XRP/BTC holders, which is about 19 billion XLM. \n\nhttps://www.stellar.org/about/mandate/\n\nHowever it only distributed 2 billion and reached 100% finished, leaving a stunning 17 billion unclaimed which according to their terms will go back to the Lumens team and used for the Stellar Build challenge, which received 0.1 billion. Here it he current distribution, which totals 8 billion:\n\n* Direct signup program: 4,811,116,707 XLM (9.6% distributed)\n* Bitcoin/Ripple holders airdrop: 2,037,756,770 XLM (100% distributed) \n* Stellar Build Challenge: 155,686,333 XLM\n* Partnership program: 1,126,666,667 XLM (4.5% distributed)\n\nBasically they're now holding about 17 billion of their own tokens to themselves, which is technically worth $6.6 billion dollars at current $0.39/XLM valuation, along with the remaining which they aim to release.\n\nThis is their policy on unclaimed Bitcoin/XRP tokens:\n\n>Lumens that were not claimed by during the Bitcoin program are currently going to the Stellar Build Challenge and toward the operations of SDF. \n\n\nThey claim they won't sell their coins for 5 years if its the initial grant or stripe loan, but nothing about unclaimed tokens:\n \n>SDF founders and Stripe have voluntarily agreed not to sell any of the lumens initially received (either via employee grants in the case of the founders, or via repayment of the Stripe loan) for at least five years\n\nI really don't see how this dilution isn't going to drive price down, and I really am concerned that not many are asking the question about that massive portion of unclaimed XLM that was reserved for XRP and BTC holders, which are now apparently theirs to do as they see fit.\n\nAll this  means that as the outstanding supply of 82% remaining float is released over time the monetary based would need to increase 5x just to keep the current price steady.\n\nI mean I like the idea of a decentralized Ripple, but that float distribution is deeply concerning. Also the developers claiming $6 billion of their own coin for free raises big questions about dilution.\n\n"}, {"score": 24, "matches": ["binance"], "content": "I have a bad feeling about Binance.\n\n\nRed Flag #1\n\n\nBitGrail had a bug in their exchange code,  and had been double and triple crediting accounts.  Someone discovered and silently exploited it, lots of stuff happened, and 17 million Nano were stolen.\n\n\nRed Flag #2\n\n\nThen binance goes down.  They soon report on the problem;\n\n* hardware failure in a replica server (a copy for speed or redundancy?)\n\n* that replica server fails over to backup hardware\n\n* 27 minutes later that backup hardware fails,  and they \"fail over again....\"\n\n* notice corruption slowly growing, took down their system to fix.\n\nThe first issue I have with that is for a sophisticated highly available data center,  where all of the hardware is generally top of the line, built for long reliable service,  two hardware failures in 27 minutes is kind of rare. Also that third failover,  with no real explanation where in that sequence of events the corruption occurred, is suspect. \n\nIn their statement Binance explains that 'we noticed data corruption, growing slowly'.    In my experience that is not indicative of corruption of data due to hardware failure.  Corrupt data due to a scrambled hard disk will almost always quickly halt a system due to basic error handling in the code.    Slowly growing 'corruption' sounds more like a bug.   \n\n\nRed Flag #3\n\n\nBinance goes down for a 'server upgrade'.  This is the one that got me suspicious. Whenever the Binance people first conceived of their crypto currency exchange,  they had to know it would need to be 24/7.  I can't believe that their intention wasn't that they would build a highly available system, i.e. it would never go down for a server upgrade. Yet now, less than a week after their 'crash',  they go offline for a server upgrade.\n\n\nRed Flag #4\n\n\nToday there are comments in the Binance subreddit about Nano deposits taking forever,  some speculate they are taking special processing due to the BitGrail theft.  Earlier I read a comment in the Daily sticky in u/cryptocurrency that someone found an exploit (didn't say where).  Someone replied \"dude , PM me!\",  kind of sad.  After that comment was another about Binance showing double booking of Nano,  and that Binance and Nano were 'in touch'.   I can no longer find those comments,  I can't even see [Deleted] or [Removed] in the Daily stickies,  I'm kind of concerned about that as well!\n\nSo what the hell is going on?  Is there a problem with Nano?  Is the core protocol broken? Is this double dipping Nano's fault? \n\nI highly doubt it.  I would speculate though that there is something about Nano that's maybe a little different that other cryptos that the exchange devs are not understanding.  Perhaps poor documentation,  poorly understood, something very subtle.   The exploit that was created at BitGrail could also also have existed at Binance,  the 'Crash' followed by hastily announced 'server upgrades' could be a ruse. \n\nTin Foil Hat now off\n\nGood Luck!\n\nedit: removed paragraph per comment reply"}, {"score": 9, "matches": ["ethereum", "neo", "icon"], "content": "I don't think ICX is a good investment.\n\nNEO was good because China would block a lot of Ethereum networking in their country. China needed a backdoor option and that was NEO. \n\nICX is different because Korea doesn't need an alternative to Ethereum. Korea isn't as restrictive as China is. At the end of the day, you want to put your money in an already established player who is looking at things globally than a newer player who is only looking at things regionally. I would feel 1000% times better putting my money in ETH than ICX. "}, {"score": 4, "matches": ["ethereum", "neo", "binance"], "content": "Heard a rumor from a paid crypto group that silicon valley big money is creating their own cryptocurrency.  What threatened me is there will be no icos, coins will go straight from accredited investors to NASDAQ exchange.   No need for icos, and no need for crypto exchanges.   \n\nWhy isn't every project done this way? Why is Neo and ethereum buyable on bittrex or binance but not NASDAQ? "}, {"score": 4, "matches": ["monero"], "content": "I've been in crypto since December, lucky enough to not buy in at an all time high. I have 2 doubts:\n\n1. Why is Monero not at least at number 3 in terms of market cap? With crypto getting more and more attention as days go by, I feel like privacy is going to be everything in the future. Criminals would want to use this, big whales would want to use this, or anyone who wants to bribe someone would want to use this. I'm seeing at least 15k by end of 2020 for the price.\n\n2. Would it be possible for Monero & other privacy coins be banned by a government and be erased from existence in the future if it appears to do more harm than good?\n\nSorry, just a noob's perspective so would be glad to hear your opinions. Thanks!"}]}, {"title": "Can we all come together on this, lets make it known to Binance that we want all their withdrawal fees reduced.", "score": 10656, "comments": [{"score": 1594, "matches": ["binance"], "content": "You'll probably get a lot of people in here telling you that Binance's withdrawal fees are fine, because even the $10 fees only amount to 1% on a $1000 transaction or whatever. They'll tell you that you shouldn't even bother trying to withdraw your sub-$100 holdings because they're not that important. They'll say that if that amount of money is important to you, you shouldn't be in crypto.\n\nThey're wrong.\n\nLow and/or scaling withdrawal fees are very important for crypto adoption. The people who are most easily persuaded to *use* crypto for legal transactions right now are the people whose local currency and banking system aren't reliable, and most of those people are in low-income countries. Countries where $100-200 is a substantial amount of money - a week's income, or even a month's.\n\nIf you're holding a cryptocurrency, it's in your best interest for it to be as accessible as possible to someone in e.g. Venezuela (or to a lower-income American trying to send money to Venezuela.) High fees and transaction minima at any point put your currency at a competitive disadvantage.\n\nAnd that's the point you need to make to Binance as well. It's not about fairness. It's about adoption."}, {"score": 49, "matches": ["binance"], "content": "Also Binance should fix that dust problem..."}, {"score": 130, "matches": ["binance", "tenx"], "content": "It's funny because one of the things people say about crypto is it's supposed to make things cheaper , yet the fees to transfer your money out or gas can add up to .\n\nIf I want to buy my bank account or credit card to buy something there is no fee .. unless you don't pay your card off .\n\nIf I want to withdraw all my money from the bank there is no fee .\n\nAnother thing is there have been multiple hacks of exchanges . I know people say Binance is the best but do you really trust 100% they won't get hacked ever ?\n\nIf there no hacks of there was actual insurance when there is a hack then the fees would seem more justified . The problem is you can't trust the Crypto is safe on the exchanges .\n\n"}, {"score": 112, "matches": ["ethereum", "binance"], "content": "Now **this** is a cause I can get behind **100%**. I have no idea why it should cost me $12-20 to withdraw something to MEW that only actually costs $2 in network fees.\n\nWorst of all, Binance is charging you in the altcoins you're trying to withdraw, rather than charging the ETH or BNB on your account. I *hate* having to buy an extra $20 worth of coins right before withdrawal. Maybe I'm the only OCD one around here who doesn't want withdrawal fees taking me down from a nice round number of coins...but I doubt it."}, {"score": 196, "matches": ["neo"], "content": "Whats worse is you cannot sell or withdraw fractions of coins. So if for example, you bought 5 NEO, you would have 4.99 NEO after their tx fee, and then if you wanted to withdraw that, you would only be able to take 4 NEO and worst yet, you could not sell the .99 NEO cause it is not a whole number. I have a few .9xx holdings on that site that I can do nothing with. Luckily it is only 30 bucks worth or so, but across all users, this adds up immensely. "}, {"score": 12, "matches": ["binance"], "content": "Does holding Binance Coin reduce withdrawel fees as well or just trading fees?"}, {"score": 16, "matches": ["request"], "content": "REQ fee is way too high imo, something should definitely be done... \n"}, {"score": 15, "matches": ["binance"], "content": "Sure. Reduce fees. \n\nBut I want to get rid of dust. That's $$ that I can't even get back.\n\nIf Binance uses those fees to secure and develop the exchange, great. That's VERY important and costs $$.\n\nIf those fees make them a trustworthy exchange, and keep them loyal to their customers, great. We've all seen the BS from scammy exchanges.\n\nThe fees are high, a scaling fee would be more inclusive."}, {"score": 7, "matches": ["binance"], "content": "The main problem is that the current system discourages frequent, small-value transactions (which are exactly the kinds of transactions that the average person would be doing). Unless you leave your assets on the exchange.\n\nI can save you some time here: Binance as a business are doing exactly what they want to be doing. Decentralized exchanges are the long term fix."}, {"score": 5, "matches": ["binance", "tenx"], "content": "I would love if you could pay the withdrawal fees in BNB aswell. "}, {"score": 25, "matches": ["tenx"], "content": "I don’t think the fees should be lowered for all coins but IMO they should have a flat fee in $ or btc + tx fee, updating the fee in each coin every day for example. It wouldn’t be too hard to implement.\nWe wouldn’t really pay less but it would make more sense. More transparency about what they ask as a fee instead of differences favoring x or y coin."}, {"score": 4, "matches": ["cardano"], "content": "I transferred a significant amount of Ada to my wallet for only 1 Ada coin yesterday. What coins specifically have high transfer fees? "}, {"score": 4, "matches": ["binance"], "content": "As long as the alternatives are doing business with shady exchanges like Bitgrail, Binance will have no reason to lower fees. We need multiple, legitimate exchanges competing for business.  Free market"}, {"score": 3, "matches": ["binance"], "content": "Can we come together and do the same thing for dust. I am fine with sweeping it into BNB--and I do not see why Binance would be opposed to this--but having useless dust is so.......well......useless."}, {"score": 3, "matches": ["binance"], "content": "another day another binance withdrawal fee complaint thread. don't we have anything else to talk about? I think at this point binance is aware that people are unhappy with it."}, {"score": 3, "matches": ["binance"], "content": "This is hilarious. Binance is an exchange and they are in the business of making money. You don't like them, go elsewhere. Plenty of exchanges to choose from world wide."}, {"score": 3, "matches": ["binance"], "content": "Stop trading on Binance then. They won't change things until their profits are hit. "}, {"score": 3, "matches": ["binance"], "content": "Stop trading on Binance and fees will go down. The market will sort itself out.\n\nBinance should do a lot of things (or any other for-profit entity on the planet for that matter), but they won't until it hurts their bottom line."}, {"score": 31, "matches": ["binance"], "content": "Personally don't feel that binance fees are unreasonable. Rather them take a little more and use the money to keep it secure. Now HitBtc withdrawals are fucked.. $30 to withdraw my HDG and my HGT is locked in there xDDD"}, {"score": 8, "matches": ["binance"], "content": "I thought Binance had some the lowest fees compared to other exchanges. "}, {"score": 2, "matches": ["ethereum"], "content": "I wish it was dynamic based off the average GAS price on ETH Gas Station. Like during the weekend the average price was only 9 gwei versus 20 during the week. "}, {"score": 2, "matches": ["binance"], "content": "What's the point? Binance and any other centralized exchange do what they want. And we should try to get away from centralization. 2018 will be year of decentralized exchanges, my bet is on OMISEGO. Have patience my fellow crypto friends. Soon will be time when we can determine fees and our financial freedom!!! #OMG #DEX "}, {"score": 3, "matches": ["ethereum"], "content": "Unless it's like bitcoin, or ETH during high upticks, Fees over like 50 cents worth are ridiculous. "}, {"score": 2, "matches": ["binance"], "content": "How to reduce future Binance fees:\n\nStep 1: Withdraw all available funds from Binance to a local wallet/wallets\n\nStep 2: Deposit all funds into another exchange (or however much you want to trade)\n\nStep 3: Congratulations, you are no longer paying high Binance fees"}, {"score": 3, "matches": ["tenx"], "content": "Hey company. As consumers we know you offer the best service, but we don't want to pay that. So please reduce your revenue to make us happy. Thanks!"}]}, {"title": "when you see a friend in public who you talked into buying crypto in January", "score": 1657, "comments": [{"score": 6, "matches": ["ethereum"], "content": "A friend of mine started asking me about my coin choices after I made a decent profit on Litecoin and Ethereum.\n\nHe decided to sink £4k into Ethereum just before it crashed. Last time I brought it up his investment was worth about half what he put in.\n\nI've stopped bringing it up for a while!"}, {"score": 3, "matches": ["achain"], "content": "I follow the same personal rules I've always followed with my stocks and keep the conversation light on details if it comes up. I have no interest in discussing crypto with anyone in real life that isn't already in the know. Either you have the curiosity to explore and educate yourself or you don't, anyone part of the latter is liable to get burned. I'm not interested in establishing any relationships that could be construed to be fiduciary, so I won't act as an outside influence for anyone on financial matters."}]}, {"title": "Alt coins trying to go main stream", "score": 875, "comments": []}, {"title": "Mobius ($Mobi) Is About To Blow Up!!! WTC Partnership + Jed Mccaleb = Success", "score": 222, "comments": [{"score": 10, "matches": ["stellar"], "content": "Wow I did not realize the Stellar Exchange is live, just transfered XLM there and used my wallet address as my account ID it arrived within a 1 minute and I was able to buy some Mobi within minutes... I am quite impressed to say the least with that entire process"}, {"score": 6, "matches": ["walton"], "content": "It is only listed on Stellarterm and stronghold right now, but going live on GoPAX (Korean Exchange) tomorrow. WTC partnership, one of Stellar's first ICOs, and Jed Mccaleb is an advisor for them. Expect this price to shoot up after tomorrows launch on the exchange. Pre sale was $.17 and ICO price was $.26."}, {"score": 2, "matches": ["walton"], "content": "I own WTC, but not and Mobi and dont' have any Fiat for Mobi but I wish the best for Mobi as a hardcore WTC supporter"}]}, {"title": "IBM to bring Stellar to central banks!", "score": 647, "comments": [{"score": 46, "matches": ["stellar"], "content": "Nothing in that report says anything about using Stellar specifically. It just talks about them exploring the tech..."}, {"score": 157, "matches": ["ripple"], "content": "as a holder of both, i find it hilarious how this sub is celebrating this news/the rumor thats been floated for a while but shits on XRP all the time for working with banks"}, {"score": 29, "matches": ["stellar"], "content": "I have been calling bulls on XLM for a long time."}, {"score": 13, "matches": ["stellar"], "content": "This is amazing news for Stellar. Can you imagine all central banks running on the Hyperledger Fabric & Stellar blockchains?"}, {"score": 14, "matches": ["ripple", "stellar"], "content": "Stellar isn’t even a non-profit. They missed the final deadline to become a 501(c) by 21 months.\n\n>”the IRS allows an organization 27 months from the date of incorporation to file its tax exemption application and have the exemption, once granted, be effective retroactively to the date of incorporation.\" \n\nA user on XRPChat mailed the IRS and asked them for Stellar’s non-profit status and IRS confirmed on 12/04/2017 they are not a non-profit. Below is a timeline of events:\n\nStellar incorporated in Delaware - 3/31/2014  (0 months)\nMemorandum from law firm - 3/6/2015  (11+ months)\nIRS filing deadline - 6/30/2016  (27 months)\nUser’s letter from the IRS - 12/29/2017  (44+ months; 17+ months past deadline)\n\nSomeone named Arthur Britto is currently suing Stellar for falsely claiming to be a non-profit and taking donations as well. If you don’t like the source of the link below you can find the original documents. \n\nhttps://www.xrpchat.com/topic/17500-a-stellar-story/\n\nThe likely reason Stellar never filed the paperwork was because Jed and  company make profit when the token rises in value. They’ve continued to take donations even without proper 501(c) paperwork and also continue to use the label of charitable foundation to skirt regulation through loopholes.\n\nCall it FUD all you like, it’s true. And Stellar even acknowledged that it was normal for organizations to take the 27 months to file the paperwork and that as soon as they do they’ll post on their website. 21 months later no proof of paperwork from IRS and no proof on the website. \n\nPlease read all the documents on that link and let me know what you think. I personally don’t like Jed but if Stellar was approved as non-profit (in turn having to abide by non-profit IRS rules) I would actually invest. \n\nEdit: Some background of history between Stellar’s Jed and Ripple (Brad).\nhttp://observer.com/2015/02/the-race-to-replace-bitcoin/"}, {"score": 10, "matches": ["stellar"], "content": "this paper is about Blockchain itself not XLM but it would be definitely a good solution"}, {"score": 10, "matches": ["ripple"], "content": "Xrp All ready got the banks"}, {"score": 18, "matches": ["ripple", "stellar"], "content": "Whoever likes Stellar and hates Ripple is either uninformed or a hypocrite.\n\nEdit: i really like both by the way, i just dont understand how someone can shill stellar and say ripple is shit"}, {"score": 4, "matches": ["ripple", "stellar"], "content": "Everyone making the comparison between the amount of XRP held and the amount of XLM held by the creators needs to actually take a look at how they will be distributed.\n\n\nNot sure where ANYBODY sees that XLM is keeping a majority of the tokens for themselves, With a little bit of research, anybody can note that they are only keeping 5% for themselves.\n\n\n\n5% to Stellar.org\n\n\n50% to individuals who want lumens\n\n\n25% for nonprofits to reach underserved populations\n\n\n20% to bitcoin holders\n\n\n\nIn addition, these lumens will be distributed over a lengthy period of time, so you will never really a see an influential affect on price, rather they will be eased in. They're not going to just dump a bunch of lumens into the market and suppress the price. This distribution is aimed at increasing adoption.\n\n\n\nOn the note of Non-Profits - Of course the individual can profit, do you expect the individual to work for free? The individuals still deserve to be compensated for the work, however the entity themselves won't be profiting. Again, big difference."}, {"score": 2, "matches": ["ripple", "stellar"], "content": "Ripple while continue to dominant. XLM is behind"}]}, {"title": "You should know what is happening at HitBTC", "score": 629, "comments": [{"score": 280, "matches": ["nxt"], "content": "Thank you for bringing this to the attention of /r/CryptoCurrency.  I had about 200k USD value stored on there in mid December, when I logged in and they changed my 2FA and locked me out.  Unfortunately due to some life events, my most recent screenshot was from 2 weeks prior, even though I don't think having a more current one would have helped them in unlocking me.\n\nLong story short - I shat myself.\n\nThen, I got on reddit - went bonkers on /r/hitbtc (should be renamed /r/shitbtc), commented on EVERY single tweet they did announcing some new shit ICO, and rampaged across their facebook.  This of course, after getting their automated support emails, and creating another account to rampage their support forum.\n\nThat resulted in nothing.  No response as I watched the NXT airdrop crush the price of NXT, bitcoin 1/2 in price, and BCH get destroyed.\n\nThe only thing that worked is emailing this group of people: \n\npr@hitbtc.com <pr@hitbtc.com>,\nlegal@hitbtc.com <legal@hitbtc.com>,\nrelations@hitbtc.com <relations@hitbtc.com>,\n“davemerril@hitbtc.com” <davemerril@hitbtc.com>,\nvictoria@hitbtc.com <victoria@hitbtc.com>,\ncompliance@hitbtc.com <compliance@hitbtc.com>\n\nI think my email was literally: \"If you have an ounce of dignity, then please unlock my account.\"\n\nNever got an email back from support saying they were going to unlock my account, it just got unlocked after emailing that distro 2x.\n\nSo.. from me to you, f*ck you /u/hitbtc -- one last time."}, {"score": 6, "matches": ["ethereum"], "content": "Just want to say I did the exact same thing you did. Sent ETH from a contract (Bitstamp, which is what I'm assuming you also did).\n\n\nAfter about 3 weeks, 30 emails sent from me, several PM's on reddit, making a thread on their support board + subreddit as well as messaging them on facebook, I finally got the funds refunded.\n\n\n\nToo bad by the time I got the refunded the ETH, HitBTC had disabled ETH withdrawals. I found a workaround for it though; quickly sold it for LTC, transferred it to Bitstamp then quickly sold it again for ETH again.\n\n\nNever using that piece of shit exchange again."}, {"score": 6, "matches": ["binance"], "content": "I'm so sick of all this shit. It seems you can't go a few steps without almost stepping in a scam.\n\nIf the cost of decentralization or at least semi-decentralization is noone has your back when someone tricks you then i'm not sure the idea. What solution is there that can finally stop all this mess once and for all? Why are thiefs STILL getting away with this crap over and over. I'm starting to think besides HODLING, scamming is the true way to go.\n\nIf Binance and/or Coinbase gets hacked then you'd be a fool not to leave crypto at that point"}, {"score": 2, "matches": ["binance", "tenx"], "content": "Trash exchange, slow, bad UI/UX, would rather pay fees on binance or huobi than use this one. "}]}, {"title": "Black Block Research issues a BUY rating for NANO after in-depth analysis", "score": 274, "comments": []}, {"title": "John McCafee twitter hacked", "score": 504, "comments": []}, {"title": "Update: All Icon (ICX) subreddits have now merged to one official community and is now closer than ever with the Icon team", "score": 241, "comments": [{"score": 7, "matches": ["neo", "icon"], "content": "Neo domination:  ✔️\nIcon domination: In progress\n\n"}, {"score": 2, "matches": ["icon"], "content": "Icon or Ark?"}]}, {"title": "Trevon James posts a super butt-hurt message to everyone on Steemit, because the whales on Steemit are preventing him from spreading his scammy cancerous garbage, and have stripped him of all his earnings... karma's a bitch!", "score": 572, "comments": [{"score": 87, "matches": ["power"], "content": "For those unable to see the post :\n\nI’m done posting on steemit. May even power it all down. Faceless losers like @berniesanders flag all my posts with an army of downvoters behind him. No wonder his rep is -18. Funny how people who never show their face on the internet have the most balls. You guys will be the death of this blockchain. Going around policing the place like Mr. Layhey on Trailor Park Boys and then saying it’s for “preserving the reward pool” for the minnows. Just be real and say you have something personal against me. Don’t say it’s cause I’m a scammer that promoted Bitconnect. Say it’s because I have too much Steem Power and I just popped back up out of no where. None of the people who invested in bitconnect are mad at me or blame me. The only people that are mad are people like you who had nothing to do with it and think you know what my true motives are or were. The only people calling me names are the people who just found out who I was. So have fun playing mall cop Mr Layhey. I’m done. On second thought, I won’t power down. I’ll buy more Steem Power to piss you off and curate content I actually like and earn Steem that way. The way Steem was supposed to be used. Unlike you who spends his life watching for people he doesn’t like just so he can flag them. Hopefully you get a life soon and become a more positive driven force. Peace."}, {"score": 2, "matches": ["tenx"], "content": "Why doesn't he just get lost? Take his profit, pay some fines, maybe do a little time but just get lost... nobody cares."}]}, {"title": "“With Ark’s SmartBridge Technology every coin becomes even more powerful, every app produced on any blockchain has the potential to reach a greater audience and even bitcoin can gain the functionality of every altcoin through a simple blockchain token called ARK.”", "score": 125, "comments": [{"score": 21, "matches": ["ark"], "content": "Good to hear that ark is finally getting some attention where it counts. Now with the new core V2 almost here, im really really exited about the things to come!"}]}, {"title": "THEKEY (TKY) Pilot in Jiaxing for Identification Verification", "score": 523, "comments": [{"score": 9, "matches": ["binance"], "content": "I am big into TKY. Get some now. Still near ICO price and on Kucoin. Binance soon (I think)..."}]}, {"title": "Waltonchain Partners With Loci, a US-Based Company Which Created the InnVenn Platform for IP Research and Discovery", "score": 328, "comments": [{"score": 45, "matches": ["walton"], "content": "Walton coming to the U.S.!"}, {"score": 25, "matches": ["walton"], "content": "In my view, when the dust settles, Walton will be one of the coins that makes it big. "}, {"score": 19, "matches": ["walton"], "content": "My goodness, non-stop great news from the Walton camp, definitely seeing this one through to its conclusion."}, {"score": 3, "matches": ["walton"], "content": "WTC is going to the top, no doubt in my mind. They are one of the few projects that gets me pumped about what blockchain can offer the world. "}]}, {"title": "Bitcoin Closes in on $9,000 as Regulatory Fears Peter Out", "score": 374, "comments": []}, {"title": "Stuck in hodler lane", "score": 122, "comments": []}, {"title": "BOOM: PayBear - a cryptocurrency payment gateway w/ 7 supported currencies and 1-click ecommerce integrations.", "score": 106, "comments": []}, {"title": "OmiseGo (OMG) to become a global leader in blockchain technology", "score": 195, "comments": [{"score": 54, "matches": ["omisego"], "content": "Jeez I hate seeing OMG on the crypto front page. I'm quietly trying load up while the price is stagnant"}, {"score": 25, "matches": ["omisego"], "content": "Thanks for sharing the post. OMG Team will deliver a huge win to entire crypto community. "}, {"score": 8, "matches": ["omisego"], "content": "How will omisego solve the scaling issues? If everyone pays with it at McDonalds the fees will be too high i think. Or am I wrong?"}, {"score": 6, "matches": ["omisego"], "content": "Need more OMG"}, {"score": 2, "matches": ["omisego"], "content": "I’m super long OMG but your headline is extremely misleading and overwhelmingly subjective. Nothing in this article supports what you have suggested"}]}, {"title": "This sums up the day", "score": 223, "comments": []}, {"title": "ICON [ICX]: Co-development of world’s first FIDO (Fast IDentity Online) system using blockchain technology", "score": 640, "comments": [{"score": 14, "matches": ["icon"], "content": "I'm so glad my portfolio is 75% icon :')"}, {"score": 6, "matches": ["icon"], "content": "Good news everyone, ICON price will crash temporarily. I f...ing don't understand this market at all. "}, {"score": 2, "matches": ["icon"], "content": "what is best icon wallet? "}, {"score": 2, "matches": ["ethereum"], "content": "Bought at around $4 today, kinda annoyed, as I was waiting for funds to get through to coinbase (to avoid their crazy high debit card charges & higher ETH rates) - on the weekend, it hit around $3.60 at the same time as ETH was starting to recover from a slight dip under $800.\nIf I'd got my timing right, I'd have 20% more. \n"}, {"score": 2, "matches": ["icon"], "content": "Oddly, I haven't seen or read any negative articles on ICX and price action reflects the complete opposite. Strange."}, {"score": 17, "matches": ["icon"], "content": "ICX is one of those coins people will be reading about in early 2019 and curse themselves for not buying at least 1K worth.  \n\nSafe bet is $100 USD by EOY.\n\nHardcore bet is $250 - $400 range.\n\nNot-out-of-reach is $500+"}]}, {"title": "Ripple lands largest Middle East client in UAE Exchange", "score": 495, "comments": [{"score": 22, "matches": ["ripple", "stellar"], "content": "I know this is gonna be downvoted but there are so many hypocrites in this sub and the crypto world in general. They criticize Ripple for working with banks but when the rumor about Stellar potentially being tested by banks people go crazy and celebrate it. I’m not hating on Stellar it’s just a fact that so many people contradict themselves here."}, {"score": 137, "matches": ["ripple"], "content": "Most partnerships with other coins have nothing to do with the actual coin/token. \n\nHow is it bad that the company that's own XRP lands a billion dollar costumer? People can't see longterm. If you can't appreciate a business deal this big you don't understand how things work in the world. "}, {"score": 46, "matches": ["ripple"], "content": "This is fantastic news! For those pointing out that they are not yet utilizing the XRP token, here's the CEO of Ripple, Brad Garlinghouse, addressing that point: https://youtu.be/kyWZzgZN3wo?t=5m36s    \n\nIn it he explains that banks aren't sure yet of xRapid (XRP) and that's fine, xCurrent (faster international payments with less friction) is how they engage customers. He closes it with \"The xRapid product gives you a faster product at a lower price. Do we really not think people are going to say 'Huh, that's kind of interesting'?\"    \n\nThis is how it all starts, folks!"}, {"score": 23, "matches": ["ripple"], "content": "Criticism is good. People should be critical about choosing their digital assets. You should do proper research and based on that decide whether you buy a coin like XRP. If your critisism is built on facts and research you can make the community, and in the end coins as a whole, better.\n\nHowever, in the cryptosphere is a lot of ignorance towards ripple and XRP. Arguments about \"banks and FI's not using the token, thus making it worthless\" are just not true. Just dig in Ripple a little and you might be surprised!\n\n\n\n\n"}, {"score": 10, "matches": ["ripple"], "content": "I like to come into xrp threads to read the people arguing lol. Both sides of these arguments are hilarious. \n\nAm I a bad person for this?\n\nOn a more serious note I believe this is good for both ripple and xrp. I know people think news like this should not have effect of xrp prices but honestly everything is so uncertain in crypto world, how do we know if Banks and fi won't adopt it? What does it hurt to put a couple dollars in, in the event they do? I think more businesses and Banks will jump in board and eventually use xrp in the future. (That's just my thought on it though, it makes sense to me for them to  adopt xrp) I'm not a banker though so I don't know."}, {"score": 11, "matches": ["ripple"], "content": "Is xrp token goin to be used or is it just the ripple technology "}, {"score": 4, "matches": ["ripple"], "content": "Meanwhile XRP still won't go up because of this "}, {"score": 2, "matches": ["ripple"], "content": "I wonder if Ripple's institutional adoption will mean that XRP prices will never really shoot to the moon. Anyone else?"}, {"score": 4, "matches": ["ripple"], "content": "If only ripple technology going to be used and xrp token having no use ,How does any partnership give xrp value.Not trying to offend anyone ,genuinely would like someone with better knowledge to give me the reason"}]}, {"title": "Yes or No?", "score": 49, "comments": []}, {"title": "Top trading view contributor just turned bullish", "score": 51, "comments": []}, {"title": "Xtrabytes completes its third testnet!", "score": 147, "comments": []}]