[{"title": "Daily General Discussion - January 12, 2018", "score": 127, "comments": [{"score": 65, "matches": ["metal"], "content": "\"When people realize that BitCoin are worthless, they'll be sold as scrap metal and the BitCoin price = the price of the metal they're made from.\"\n\n- Legit a colleague of mine"}, {"score": 33, "matches": ["stellar"], "content": "My favorite game is apparently stuffing my bags full of XLM and XRB each time they dip and watching them never get close to their former ATH. "}, {"score": 20, "matches": ["request"], "content": "[Request Network (REQ) is a project backed by Y-Combinator that bills itself as \"the future of commerce.\" How does the Request Network team plan to make that future a reality?](https://www.youtube.com/watch?v=yy-zm_k5Ses)"}, {"score": 70, "matches": ["stellar"], "content": "Stellar is stellar"}, {"score": 16, "matches": ["icon"], "content": "VEN and ICX are moving and so is the seam of my pants!"}, {"score": 16, "matches": ["request"], "content": "What do you guys think of a 15% portfolio investment into REQ right now at $.79?\n\nedit: I did it :)"}, {"score": 12, "matches": ["icon"], "content": "ICX is starting to make moves."}, {"score": 13, "matches": ["stellar"], "content": "Bought 400 xlm while I was drunk on New Years for $0.30, best drunk decision of 2018. "}, {"score": 12, "matches": ["stellar"], "content": "Bought SNOV at $.23 a day or two before the market corrected. Sold mid-correction at $.30 to buy XLM at $.45. The timing couldn’t have been more perfect and I got extremely lucky, but now it’s time for the long hodl "}, {"score": 12, "matches": ["request"], "content": "The fuck is going on with REQ"}, {"score": 11, "matches": ["walton"], "content": "That moment when you check your 100% WTC portfolio after being offline for a day and you suddenly need clean underwear.."}, {"score": 13, "matches": ["icon"], "content": "Cmon ICX you beautiful bastard. "}, {"score": 12, "matches": ["stellar"], "content": "Stellar is rising back up, great sign for the near future!"}, {"score": 18, "matches": ["ethereum", "neo"], "content": "*Coin Analysis*: Nuls (Ticker: NULS)\n\n*Current Market Cap*: $165 million\n\n*Competitors*: QTUM ($3.7 billion mkt cap), NEO ($7.8 billion mkt cap), ETH (a lot)\n\n*Current Coin Supply*: 24 million\n\n*Exchanges*: Binance, Kucoin, EtherDelta, Bit-Z, OKEx, Coinbene\n\nWebsite: https://nuls.io\n\nWhitepaper: https://nuls.io/pdf/NulsWhitepaper1.1.pdf\n\n*Origin*: Based in Singapore (Team is Chinese)\n\n*Team Size*: 16, with 5 core development team (https://i.redd.it/4cc5j2fbrh101.jpg)\n\n\nGoal: \n\n* Creation and use of a modular blockchain for commercial use. Customizable, universally public blockchain infrastructure to aid in enterprise level deployment of applications. Open-source. Proof-of-credit and smart contracts.\n\nCompetitive advantage: \n\n* Creation of a modular blockchain that allows ease of development in the enterprise setting, creating value for industries and companies. \n\nDevelopment/founder/company vesting: \n\n* Only 1% of the tokens are unlocked per month for the next 20 months. They are committed to building a product and staked their coins on it.\n\nCommunity development: \n\n* 1% of coins each month are distributed to the community to support building of an ecosystem on the Nuls blockchain.\n\nPrevious work in Crypto & Blockchain:\n\n* “Inchain” – a previous project built by the same core development team that won the award for Most Innovative and Creative Project at China’s Blockchain Technological Innovation Contest (source: http://blog.inchain.org/archives/293). Inchain also did not fund their ICO and returned all investor dollars back to their Chinese investors. \n\n* This team is legit, they’ve been around the block, and they are going to build the next layer for enterprise blockchains in a way no one has done before (modular, proof of credit, AND smart contracts). Inchain product will be apart of Nuls blockchain.\n\nPartnerships: \n\n* Elephant Alliance (a huge Chinese conglomerate of businesses); Beijing Science and Technology Co., Ltd; and more than a dozen others in strategic partnership\n\nFinal Analysis:\n\n* Hugely skilled team, no USA marketing presence, flying under the radar with huge upside (sub $200M coin), a lot of trading volume, and partnerships in place with huge Chinese orgs. This is a company that will be valued as high as their current competitors (7x – 15x) fairly soon I believe. Longer term will be dependent on the final product brought to market and full adoption.\n"}, {"score": 12, "matches": ["cardano", "stellar", "request"], "content": "Just bought some FUN, XLM, REQ\n\nTo the moon or I'll gladly hold those bags for you.\n\nCurrent to the moon wallet by % holdings\n\n* XLM 18%\n* REQ 18%\n* FUN  17%\n* IOTA 15%\n* ADA 14%\n* UBQ 18%"}, {"score": 9, "matches": ["request"], "content": "I wonder when REQ will wake up"}, {"score": 42, "matches": ["request"], "content": "Big day for Req today. "}, {"score": 19, "matches": ["icon"], "content": "The fact you can get ICX and FUN at a discount right now with ICX launching on Korean exchanges on the 24th and FUN starting their casino soon is baffling. Fill your bags at these prices, folks. If you don't, somebody else will. "}, {"score": 16, "matches": ["icon"], "content": "ICX breaking out"}, {"score": 29, "matches": ["stellar"], "content": "XLM at a new 24h high 🚀🚀"}, {"score": 7, "matches": ["request"], "content": "Add VEN to the portfolio or double down on REQ or ICX??? 🤔🤔"}, {"score": 8, "matches": ["ethereum"], "content": "A whale on KuCoin is murdering XRB with his 50 eth walls"}, {"score": 24, "matches": ["stellar"], "content": "Here's hoping I can put more money in an exchange before XLM blasts off. I only have 25XLM now but im hoping to get another $50 worth"}, {"score": 23, "matches": ["binance"], "content": "When binance adds XRB will it be at midnight with no warning?"}, {"score": 21, "matches": ["stellar"], "content": "XLM is hungry for walls today"}, {"score": 7, "matches": ["vertcoin", "request"], "content": "Buy in from most to less:\n\n* Enjin (Existing userbase, product, new Wallet, interesting Roadmap)\n* Bounty0x (Lowest Cap - biggest potential to grow?)\n* Vertcoin \n* Request\n\nhttps://digitalcoinprice.com/compare/enjin-coin-vs-request-network-vs-bounty0x-vs-vertcoin\n\nWhat would you suggest?"}, {"score": 7, "matches": ["icon"], "content": "What happens to your ICX if you leave them in your ledger after the mainnet launches on the 24th?"}, {"score": 7, "matches": ["icon"], "content": "I wish icx could break through this 9.30-9.50 wall."}, {"score": 7, "matches": ["walton"], "content": "WTC with those sweet SWEET gainszzszsz"}, {"score": 6, "matches": ["omisego", "binance"], "content": "Cobinhood announced a bunch of coins today including OMG and other big market cap coins.  \nThe exchange's coin COB still trading very low, but judging at where binance cash (BNB) has gone as they have added lots of new coins, we could see lots of cash heading over to Cobinhood to trade which is naturally going to drive up COB.  Their registration process also very easy and quick.  If anyone's looking for a good short to mid term coin.  I would say COB."}, {"score": 6, "matches": ["walton"], "content": "WTC taking off. "}, {"score": 7, "matches": ["request"], "content": "smart move to trade REQ for VEN right now?"}, {"score": 25, "matches": ["stellar"], "content": "XLM! So I was in this thread yesterday posting some TA (and shilling sure) and pretty pleased to have made some tasty predictions, apart from us breaking down past the resistance we broke from the ATH to then find support at the resistance of the previous downwards channel. Huh. Crypto things. Yesterday: https://www.reddit.com/r/CryptoCurrency/comments/7pm5f6/daily_general_discussion_january_11_2018/dsiy0qy/\n\nThe prediction yesterday:\n\nhttps://i.imgur.com/EhTmkna.png\n\nNow looks like:\n\nhttps://imgur.com/FnSZ3s7\n\nNice nice. And our log chart after the bounce I described is now looking like this:\n\nhttps://imgur.com/Tg2KzSy\n\n3 out of the last 4 bounces off the bottom channel have us reaching the middle of the channel which puts us at $0.92. If we bounce to the top like last time, we're looking at $1.25 by the 15th. I'm hopeful but not delusional. I still think that XLM is a solid rocket in the next couple of days, just that I believe we're looking at a 50% growth, not 100%.\n\n(Trade at your own discretion not on my advice, do your own research and I could be wrong as fuckkkkk)"}, {"score": 18, "matches": ["stellar"], "content": "Just here to pat the backs of new xlm holders"}, {"score": 19, "matches": ["stellar"], "content": "XLM and MOD! 👍🚀"}, {"score": 26, "matches": ["stellar"], "content": "Alright going all in on XLM broke every single rule in my rule-book however I'm not regretting it lmao."}, {"score": 12, "matches": ["stellar"], "content": "Is keeping coins in an exchange basically the same as keeping it in a web wallet? I don't trust windows enough to keep a hardware wallet on my computer, and I've been thinking about moving my XLM into a web wallet instead of a binance, but I don't see the benefit."}, {"score": 13, "matches": ["stellar"], "content": "xlm to the z8_GND-5296 its the farthest discovered planet we know"}, {"score": 13, "matches": ["stellar"], "content": "Hm, seems like XLM still has some life. Bought back in."}, {"score": 6, "matches": ["stellar"], "content": "Big shout out to the panic xlm seller at 0,43$ 2 days ago. since I had still some dead cash on kraken i spent 2000$ to buy xlm (not knowing anything about this crypto, just knowing it'll go back up anyway). Already made 30-40% on this small investment."}, {"score": 7, "matches": ["ethereum"], "content": "Shilling ETHLend\n\nEthLend's basis to to be able to lend ethereum in a decentralized market where the people are the ones setting the rate, not the banks. People loaning eth are paid back with interest. Low market cap with big potential imo.\n\nIf you are planning on HODLing Ether you might as well lend it and gain some more.\n\nUntapped market so far, only thing similar to it is SALT which isn't for peer to peer loans.\n\nAlso just partnered with ENG.\n\nThe roadmap is really well thought out and they have delivered on time so far. [Check it out here](https://ethlend.io/en/roadmap/)"}, {"score": 4, "matches": ["ethereum"], "content": "Would using XRB instead or ETH as the base pair be a good idea once they fix their wallet and exchanges start pairing it more?"}, {"score": 6, "matches": ["walton"], "content": "Any thoughts on SNOV? Decent niche project, newer ICO pretty low market volume, on Kucoin. \n\nWTC finally getting some more recognition, enormous company in China.\n\nXRB just killing my portfolio but I plan on holding XRB until the end of the year."}, {"score": 25, "matches": ["stellar"], "content": "Stellar is back baby!!!!!!! I’m so ready to see that little rocket ship SOAR to new heights. Buckle up guys, it’s gonna be a stellar ride."}, {"score": 11, "matches": ["stellar"], "content": "With all the hype surrounding xlm, can someone explain something to me. Right now there are 18 billion xlm in circulation. However under their mandate, the team states they eventually want to release all 95 billion tokens. Wouldn't this devalue all previous existing coins? "}, {"score": 10, "matches": ["stellar"], "content": "Alright fellas i'm going to hit the sack let me wake up to a nice XLM gain and i'll be feeling nice "}, {"score": 10, "matches": ["stellar"], "content": "50% XLM,  30% XLM, 20% XLM\n\nNeed more XML? Thoughts?"}, {"score": 9, "matches": ["walton"], "content": "WTC breaking out here. $30 on this breakout?"}, {"score": 5, "matches": ["neo"], "content": "NEO will be hitting new ATH's next week. "}, {"score": 5, "matches": ["request"], "content": "Is there any news incomming for REQ in the sort-mid term or ?"}, {"score": 5, "matches": ["cardano", "stellar"], "content": "Aaaaaand xlm and ada are taking off."}, {"score": 5, "matches": ["tenx"], "content": "Is all the holding going to pay off for ENJ today? Pls 🙏"}, {"score": 6, "matches": ["icon"], "content": "ICX cleared for takeoff. "}, {"score": 5, "matches": ["ethereum", "stellar", "icon", "request"], "content": "Hey guys, I finally was able to invest my money today. This is how I have my portfolio set. I'm so sorry to ask this, but please roast this if it looks like shit. \n\n25% ETH\n\n17% REQ\n\n15% XRB\n\n13% ICX\n\n\n\n10% VEN\n\n7% XLM\n\n6% BAT\n\n~6-8% ETH reserved for swing trading shit coins shilled on reddit\n\n"}, {"score": 5, "matches": ["request"], "content": "I have REQ but I am hoping it doesn't go up yet.  I am waiting for a day or two more before going mostly all in on it.  "}, {"score": 13, "matches": ["stellar", "binance"], "content": "Hi There,\n\nI tend to agree that stellar is the next gen technology that is actually capable of beeing used as a day to day payment system. There is also sufficient academic ressources behind it.\n\nIf you are more interessted in how stellar works then the first read should be:\n\nhttps://www.stellar.org/blog/stellar-consensus-protocol-proof-code/\n\nThere you can also find the whitepaper about the stellar consensus algortihm which is imho. really well designed.\n\nCurrently the Stellar Platform is also beeing used for a new payment system in africa to connect many people that do not have access to regular bank accounts to a stable and reliable payment system.\n\nhttps://www.stellar.org/blog/financial-inclusion-africa-cellulant/\n\nRegarding IBMs recent commitment, they are more interessted in devising business solutions using the stellar blockchain, not so much the payment system but of course also this will help the stellar network and the currency lumen to gain traction.\n\nOverall i would agree that stellar is currently completely underrated, there is also quite some psychological barrier at 1 USD under that most people will consider the currency as \"cheap\" and a good investment opportunity.\n\nLastly stellar includes a \"distributed exchange\" that means that you dont need 3rd partys to exchange between different assets on the stellar network. That should make trading a whole lot more fair and unbiased from the specific trading and exchange platforms eg. GDAX, Binance etc.\n\nRegards,\n\nBass"}, {"score": 9, "matches": ["icon"], "content": "ICX and VEN sell walls..... BRUHHHH"}, {"score": 12, "matches": ["icon"], "content": "Wow! I get to buy more VEN and ICX and XRB on this extended sale. "}, {"score": 4, "matches": ["achain"], "content": "Any thoughts on the AChain fork that is suppose to happen today? Saw a couple things on 4chan and a few reddit threads but not much talk about it."}, {"score": 4, "matches": ["stellar"], "content": "Jealous of anyone who got in on XLM this past dip to the .40’s"}, {"score": 3, "matches": ["ark"], "content": "Anyone else feel like ARK sitting under $9 right now is a peachy buy? Haven't seen a soul bring this up yet."}, {"score": 5, "matches": ["stellar", "request"], "content": "65% REQ\n\n35% XLM\n\n\n\nShould I adjust?"}, {"score": 5, "matches": ["ethereum"], "content": "Who else thinks ETH will surpass BTC's Marketcap this year?"}, {"score": 4, "matches": ["walton"], "content": "Should have bought wtc during the dip gat damn"}, {"score": 3, "matches": ["ethereum"], "content": "To any coders out there; I'm someone with no knowledge of programming languages that's interested in learning. Researching blockchain technology has really got me curious about digging deeper into the mechanics of it. One day I might even be able to actually make something using this cool new concept, even if it's just a personal project.\n\nI wanted to know what kind of language I should start with, being a total beginner. So far I know that Bitcoin uses C++, which is I believe based on C, but I don't know if I need to learn C first. I also know Ethereum uses GoLang, which I've read is super easy to learn compared to C++ or other languages. Any thoughts?"}, {"score": 4, "matches": ["icon"], "content": "ICX currently fighting through sell walls to highs for the day!"}, {"score": 4, "matches": ["walton"], "content": "Why is Walton going absolutely mad? In a positive way."}, {"score": 5, "matches": ["stellar"], "content": "safest way to store XLM long term?? "}, {"score": 5, "matches": ["stellar"], "content": "xlm was primed all last night and has held steady all day. Uptrend is happening but can we finally take off?"}, {"score": 4, "matches": ["icon"], "content": "I'm hoping for Icx to get to 30$ a pop and VEN at 20$? Is that even possible? "}, {"score": 4, "matches": ["walton", "request"], "content": "which one would you choose right now ? \n\n\nWTC - REQ - ENJ "}, {"score": 4, "matches": ["request"], "content": "Damn didn't realise REQ was ranked #76. It's so highly mentioned on reddit. This is a good thing, right? In terms of potential growth?"}, {"score": 4, "matches": ["request"], "content": "Could someone explain how REQ is any different than something like Venmo, besides being decentralized?"}, {"score": 14, "matches": ["stellar"], "content": "XLM tickling my taint this morning. feelsgoodman"}, {"score": 11, "matches": ["stellar"], "content": "Right now, XLM is that girl who you just brought back to your house after taking her on a nice long date. You've just started hooking up and moved into your bedroom and things are heating up. But you're prettttty sure that she's the type of girl who's gonna stop you once you're both all the way naked and say \"I can't have sex with you yet\""}, {"score": 10, "matches": ["ethereum", "neo"], "content": "*Coin Analysis*: Nuls (Ticker: NULS)\n\n*Current Market Cap*: $165 million\n\n*Competitors*: QTUM ($3.7 billion mkt cap), NEO ($7.8 billion mkt cap), ETH (a lot)\n\n*Current Coin Supply*: 24 million\n\n*Exchanges*: Binance, Kucoin, EtherDelta, Bit-Z, OKEx, Coinbene\n\nWebsite: https://nuls.io\n\nWhitepaper: https://nuls.io/pdf/NulsWhitepaper1.1.pdf\n\n*Origin*: Based in Singapore (Team is Chinese)\n\n*Team Size*: 16, with 5 core development team (https://i.redd.it/4cc5j2fbrh101.jpg)\n\n\nGoal: \n\n* Creation and use of a modular blockchain for commercial use. Customizable, universally public blockchain infrastructure to aid in enterprise level deployment of applications. Open-source. Proof-of-credit and smart contracts.\n\nCompetitive advantage: \n\n* Creation of a modular blockchain that allows ease of development in the enterprise setting, creating value for industries and companies. \n\nDevelopment/founder/company vesting: \n\n* Only 1% of the tokens are unlocked per month for the next 20 months. They are committed to building a product and staked their coins on it.\n\nCommunity development: \n\n* 1% of coins each month are distributed to the community to support building of an ecosystem on the Nuls blockchain.\n\nPrevious work in Crypto & Blockchain:\n\n* “Inchain” – a previous project built by the same core development team that won the award for Most Innovative and Creative Project at China’s Blockchain Technological Innovation Contest (source: http://blog.inchain.org/archives/293). Inchain also did not fund their ICO and returned all investor dollars back to their Chinese investors. \n\nThis team is legit, they’ve been around the block, and they are going to build the next layer for enterprise blockchains in a way no one has done before (modular, proof of credit, AND smart contracts). Inchain product will be apart of Nuls blockchain.\n\nPartnerships: \n\n* Elephant Alliance (a huge Chinese conglomerate of businesses); Beijing Science and Technology Co., Ltd; and more than a dozen others in strategic partnership\n\nFinal Analysis:\n\n* Hugely skilled team, no USA marketing presence, flying under the radar with huge upside (sub $200M coin), a lot of trading volume, and partnerships in place with huge Chinese orgs. This is a company that will be valued as high as their current competitors (7x – 15x) fairly soon I believe. Longer term will be dependent on the final product brought to market and full adoption.\n"}, {"score": 8, "matches": ["walton"], "content": "WTC going to explode. Rumours from slack saying it's a huge announcement upcoming."}, {"score": 7, "matches": ["stellar"], "content": "GO STELLAR GO."}, {"score": 12, "matches": ["request"], "content": "Req under a dollar wow look it has so much potential room for growth. "}, {"score": 11, "matches": ["stellar"], "content": "XLM is awake holy"}, {"score": 10, "matches": ["stellar"], "content": "XLM looks like to fly again right now!"}, {"score": 5, "matches": ["stellar"], "content": "Lads, will the high market cap of Stellar make it difficult for it to ever hit $10 a coin?"}, {"score": 4, "matches": ["request"], "content": "People who talk about holding a coin until it at least gets back to where you bought it have the wrong strategy. My friend bought BTC at $17000 3 weeks ago and wanted to get altcoins but waited a whole 3 weeks for BTC to jump back to 17k then finally traded. If he had just invested in alts (he bought REQ and VEN) he would have more than doubled his money"}, {"score": 4, "matches": ["icon"], "content": "ICX ready to launch!"}, {"score": 6, "matches": ["stellar"], "content": "cant stay long, but hope everyone's having a stellar day"}, {"score": 7, "matches": ["request"], "content": "Any thoughts on ENJ today? I’ve bought in at ATH and has done nothing but go down while hodling...thinking about trading for something else. I currently have XLM, ENG, ICX, VEN, REQ and ENJ. "}, {"score": 8, "matches": ["stellar"], "content": "Welp XLM broke $0.65 guess it's back, been a big gainer the past 24"}, {"score": 8, "matches": ["stellar"], "content": "XLM at its 24 hour high, we still buying right now?"}, {"score": 8, "matches": ["request"], "content": "any reason REQ isnt trading above a dollar? so undervalued!!"}, {"score": 14, "matches": ["stellar"], "content": "For every person who posts “What should i buy today?!? help!!” \n\nXLM\n\nxLM\n\nXlm\n\nXlM\n\nXLM is a great buy and hodl. I will be purchasing with no regret and consider it a no brainer until it hits $1.00. Then ill wait for the panic sells and buy more until it hits $2.00. and repeat until it earns top 5 on Coinmarketcap. XLM is a sexy little lady who will make all of us early birds very happy"}, {"score": 3, "matches": ["ethereum"], "content": "Noob here. Been following the market for a few months, and while I don't have any money to invest at the moment, I'm still trying to learn as much as possible.\n\nI keep seeing post about trading pairs and I just can't, for the life of me, understand why investors would put themselves through that kind of stress.  Wouldn't it be smarter to keep your reserves in Fiat until you decide to pull the trigger on a coin?\n\nLet's say you want to buy 100$ of SUB.  You simply buy 100$ of ETH and immediately spend that 100$ of ETH on 100$ of SUB.  (Not taking trading fees into account of course) \n\nThe next day ETH could fall by 50%, and as long as SUB stays the same it doesn't matter one bit.  Even if you wanted to cash out you simply sell 100$ of SUB for 100$ of ETH and sell that for 100$ fiat.\n\nAm I missing something? Until the market stabilizes I don't understand why you'd keep your purchasing-reserves in anything but fiat. Maybe I'm more long term focused, because if I'm buying a coin it's going into a cold wallet immediately (where it would sit for years.)\n\nIs crypto-pairs just something short-term traders focus on?"}, {"score": 3, "matches": ["binance"], "content": "What is up with all these exchange coins? Binance KuCoin COSS are all racing ahead."}, {"score": 3, "matches": ["request"], "content": "got my last budgeted 200$ REQ or XRP, or shud i split it between the two"}, {"score": 3, "matches": ["power"], "content": "So, looking at the performance of Power Ledger and the opportunity to invest in WePower. I think that ICO could moon. What do you think?"}, {"score": 3, "matches": ["ethereum"], "content": "When do you guys typically sell back some of an alt you bought in on? I know everyone just preaches hodl here but I would have done very well for myself to sell some of my DBC, BNTY, and PRL back for ETH when they were at or near their peak. \n\nObviously that's hindsight bias and you never truly know when a coin's run is going to end, but are there certain sell-points or signs you guys look for to sell back into your main holding?"}, {"score": 3, "matches": ["binance"], "content": "Wish my bank transfer would hurry the F up so I can buy this discounted XRB. Binance listing within a week and total \"Nano\" rebrand, 23$ if a fucking steal. "}, {"score": 3, "matches": ["ethereum", "binance"], "content": "Issue with Ledger Nano S\n\nI attempted to send .5 ethereum last night to a binance wallet. Etherscan displays \"Sorry, we are unable to locate this Transaction Hash\"  when I click on the transaction on the ethereum ledger app. Tried to send again since the my wallet still displayed the original amount on the ethereum wallet app and reading about gas thinking I might not have put enough. Same thing happened to the next transaction. \n\nThe amount varies when I hit refresh on the wallet. It will either be 1.5 or 2.5 as well as displaying the transactions, sometimes listed doubled on the wallet home screen. Both transactions have not shown up on etherscan when I click on the wallets operations, nor in the binance wallet it was sent to. When I place the wallet ID in etherscan it shows the original amount of 2.5 in it.\n\nAm I screwed out of the 1 ethereum, or did the transaction never go through and It's just a ledger software issue?"}]}, {"title": "/r/CryptoCurrency is a Place for Quality Discussion", "score": 268, "comments": []}, {"title": "Twitch, an Amazon company, now takes btc and coinbase payments.", "score": 3217, "comments": [{"score": 80, "matches": ["tenx"], "content": "ah yes just let me sub for 5$ and pay for 5$ fees"}, {"score": 9, "matches": ["binance"], "content": "Smart move.\n\nBinance CEO was saying males 25-35 are the big users of their site, i'm willing to bet thats a good chunk of the demographic of twitch too."}, {"score": 3, "matches": ["tenx"], "content": "Idk why you would pay for anything in btc anymore"}, {"score": 2, "matches": ["tenx"], "content": "Everyone and their mum were saying BAT was the new hot shit to pay with at Twitch. What happened !?"}]}, {"title": "Enjoy life... while you can!", "score": 620, "comments": [{"score": 3, "matches": ["tenx"], "content": "I'm hospitalized too for a car incident, [photo](http://www.lucaturi.it/articoli/foto/incidente%20stradale04.jpg), I don't even know how the fuck I'm alive, nor how I can still walk (my back was pretty fucked up when I came here) but my crypto gains allowed me to pay for the hospital and get well soon, love you all\n\nHope you are luckier than me"}]}, {"title": "The ID verification office at the exchanges", "score": 909, "comments": [{"score": 3, "matches": ["binance"], "content": "I'm been waiting since December 22 on gemini. Binance approved in less than 24 hours. I don't get it gemini."}]}, {"title": "(Oyster) Pearl completes re-brand & new website + hires new engineers + testnet confirmed for end of the month!", "score": 693, "comments": [{"score": 10, "matches": ["power", "achain"], "content": "This tech has some nice edge to it that's quite exciting. Here's a couple of things I'm curious about...\n\n1. If node is to act as a new form of cloud storage, would that not involve requiring 100s of 1,000s of TB's of storage available, and that's just running at a fraction of say something like Dropbox? Definitely not the kind of node someone would have set up in their living room.\n\n2. The ad replacement is really smart, but we've already seen a huge backlash recently when a site was caught secretly using the CPU power of site visitors for mining without consent. How would the general public take to this idea I wonder...?"}, {"score": 11, "matches": ["enigma"], "content": "PRL is definitely undervalued at the moment. \n\nI made my predictions on ENG when it was 0.80c and XRB when it was $1-$2. Calling it and saying PRL will be in the top 100 soon, just not sure where in the top 100 though. It is ultimately a niche coin but a good one."}]}, {"title": "The most optimal strategy", "score": 377, "comments": []}, {"title": "BrainBlocks - PayPal Checkout lead engineer begins work on Raiblocks (XRB) checkout app", "score": 3317, "comments": [{"score": 46, "matches": ["tenx"], "content": "Everyone talks about using crypto for actual payments... the problem is that at least in the USA the tax implications of this are too cumbersome. It's like trying to pay for things with stocks..we need better policy before this stuff can be successful. "}, {"score": 33, "matches": ["neo"], "content": "XRB community is very optimist of Raiblocks because of no fees, but there are other coins with no fees, like NEO right? Is there really a difference?"}]}, {"title": "Rocky Balboa's motivational cryptocurrency speech", "score": 1291, "comments": []}, {"title": "Buying alt coins", "score": 764, "comments": []}, {"title": "Great News from South Korea!", "score": 772, "comments": [{"score": 218, "matches": ["icon"], "content": "How convenient. Just around the time ICX mainnet goes live."}, {"score": 19, "matches": ["icon"], "content": "holy shit time to buy ICX"}, {"score": 8, "matches": ["icon", "binance"], "content": "Would I need to move my icx from binance once Mainer launches or can I keep them there ?"}]}, {"title": "Why 2018 is Ethereum´s year. It will be the unchallenged number 1 by year´s end.", "score": 137, "comments": [{"score": 24, "matches": ["ethereum"], "content": "I think it's the year of platforms. And Eth is the number one platform.  If BTC doesn't fix themselves before real mass adoption starts they might be done."}, {"score": 5, "matches": ["ethereum"], "content": "Yea Idgaf about BTC and hold none of it while using ETH for what BTC is usually used for instead."}, {"score": 13, "matches": ["stellar"], "content": "IMO 2018 will be a year of usable cryptos. Ethereum, NEO, XRB, XLM and VeChain.\n\nI do think IOTAs time will come in 2-3 years though"}, {"score": 2, "matches": ["ethereum"], "content": "You didnt mention other ETH projects with disruption potential.\n\nFUN launches February 6th with a targeted release between March and June. They will have completed their entire roadmap since ICO at that point and then ALL that's left is marketing using their war chest of 85,000 ETH.\n\nThey raised $25M during their ICO and currently still have $115-$120M unspent. It will be exciting to see how many millions they spend on advertising a finished and working product.\n\nMuch unlike the hype projects that advertised their white paper and dreams.\n\nShowcase.funfair.io"}]}, {"title": "ICON (ICX) - Expanding and Growing the Community", "score": 682, "comments": []}, {"title": "The remains of the latest 'cheap coins' hype, reminder to not just mindlessly invest in pump & dumps (unless you really want to take the risk)", "score": 164, "comments": [{"score": 73, "matches": ["tron"], "content": "tron you fucker"}, {"score": 21, "matches": ["tron"], "content": "I do my best to segregate my emotions from this business, but it gives me genuine joy to see TRX down there.  I got in early, recognized it for what it was, and got out, only to take a ton of abuse from HODLers for having a dissenting opinion.  Fuck them and anyone who looks like them. "}, {"score": 5, "matches": ["tron"], "content": "Seeing TRON on there gives me a warm feeling "}]}, {"title": "Tweet Binance’s CEO, @cz_binance. Let him know Binance’s dynamic withdrawal fees are still absurd and need to be lowered.", "score": 93, "comments": [{"score": 6, "matches": ["tenx"], "content": "As long as people pay it they will keep charging . Supply and demand "}]}, {"title": "COSS exchange COMPLETE RE-VAMP ON SUNDAY. Basically a rebranding. Price is climbing", "score": 99, "comments": [{"score": 6, "matches": ["request"], "content": "The founder is a cool chap. Lots of FUD gets thrown on him because his previous project was not a success, but he is always available to discuss things about Coss\n\nIf the UI is great, volume should really go up quickly. COSS already has many coins trading there including Ark, Walton, Omg, Icon, Vechain, Poet, qtum, req , enjin etc"}, {"score": 3, "matches": ["binance"], "content": "the Fiat gateway will blow the doors off current volume. Think BNB + Coinbase baby."}]}, {"title": "Bounty0x Bit-z Exchange Listing Bounty - 4 BNTY Reward", "score": 227, "comments": [{"score": 3, "matches": ["vertcoin"], "content": "Remember: you need to enable 2fa to get free vtc"}]}, {"title": "VeChain: Coca Cola Kid's last two messages: what they mean (my interpretation - long post).", "score": 82, "comments": []}, {"title": "XRP/Moneygram news made it to wall street papers this morning!", "score": 239, "comments": [{"score": 15, "matches": ["ripple"], "content": "To those who hate: banks and traditional institutions are not going to vanish. They will remain whether crypto takes over or not. \nTo me: I am an investor. I want to make money. I do care about decentralization, but crypto is not a religion. XRP has good potential and I was in when it was .28usd. "}]}, {"title": "Reminder: Make sure to backup your Google Authenticator keys", "score": 617, "comments": [{"score": 16, "matches": ["binance"], "content": "If you didn't backup those codes the first time (raises hand) you have to go through and deactivate 2FA,and reactivate it..this time save the codes. If you use Google authenticator, you will have to delete the old scans AFTER YOU HAVE DEACTIVATED 2FA THE FIRST TIME. \nAlso if you deactivate 2fa on binance you can't withdrawal funds for 24 hrs"}]}, {"title": "Goodbye, Coinbase. Hello APPC: An alternative method to purchase cryptocurrency directly from the Android \"Aptoide\" app store. 200 million Android users will be holding cryptocurrency by the end of this year.", "score": 753, "comments": [{"score": 12, "matches": ["tenx"], "content": "Why are you assuming that app users will control their private keys and be able to transfer APPC to exchanges? Unless I'm missing something, that won't be feasible. It would break the virtuous circle that makes APPC valuable in the first place.\n\nIf users can earn APPC by trying apps and then trade that same APPC on external crypto exchanges, nobody will use it for in-app purchases--especially if the market value of the coin is constantly rising. That would also bring loads of people into the system who have no interest in actually trying apps, and just want to \"mine\" APPC by handing over their two minutes of attention to anyone who will pay for it. The ad campaigns will be grossly dysfunctional, and developers won't be willing to pay for them.\n\nAPPC can be a tool for disintermediating the app economy, or it can be the cheap and convenient entree to crypto trading that you've described here. I don't think it can be both, and I feel pretty confident that the dev team favors the former. \n\nAnybody can build an app that makes it cheap and easy to buy crypto. Coinbase has in fact already done that, and competitors will follow with better prices. Virtually any coin would be suitable for that use case. It doesn't make any sense for the APPC team to compromise the features of APPC that actually distinguish it and make it useful in order to compete in a space where they have no advantage."}, {"score": 7, "matches": ["binance"], "content": "This coin actually has a team that’s already been running which is rare in crypto lele. Low market cap and coins in circulation which shows Good potential and I’m surprised it’s only on binance atm, will be good once it gets foot into other markets then we can gauge how far she’ll go."}, {"score": 9, "matches": ["tron"], "content": "I really don’t understand why people are saying this is a paid shilled post? This is actually from a random user. Look at aptoide twitter reddit and even the CEOs twitter. All are ghost towns and there’s been no shilling whatsoever. Do some research and you can see that they haven’t even started marketing yet... calm down people. This isn’t tron lol"}, {"score": 7, "matches": ["binance"], "content": "I bought this a few days ago, done nothing but tank in value much to my surprise. No idea why this isn't getting more cover, the team is solid AF too, they also got right on Binance which means they have some capital."}, {"score": 2, "matches": ["binance"], "content": "It's a little different, but why not Binance's BNB?\n\nBinance is already here and have 5 million users all of them want to trade / buy crypto. arguably, probably the best exchange, BNB itself can be use for trading and if you don't want to use it as base, using it will make trading in Binance cheaper.\n\nEven better, although its price is fluctuated, but so far the trend is ALWAYS going up and at the current situation the only reason it can go down is a total crypto collapse."}, {"score": 2, "matches": ["nav"], "content": "Nav does this. "}, {"score": 2, "matches": ["ethereum"], "content": "People wanna know why i still hold this even though it's bleeding like crazy? Check the sellwalls. You think VEN had sellwalls? From 0.00295 to 0.0045 there are 4700 eth worth of walls. That is almost 6 million usd, somethings up so im just holding it, not a huge amount by any means but fuck it."}]}, {"title": "Sleeping Giant: Tencent backed OST", "score": 130, "comments": [{"score": 32, "matches": ["binance"], "content": "Here is a copypasta shill for OST:  \n\n[Simple Token OST](https://simpletoken.org/product) is a platform for phone apps to split out their own token without needing to do an ico, or much additional programming.  Just watch [this demo](https://www.youtube.com/watch?v=-SxJ8c1Xh_A), and here is a [great review of the ico](https://www.youtube.com/watch?v=YUY0D6mtbAQ&t=3s) from a few months ago.  It has only been on Binance since December 19th, right before the correction decimated most alts for a week or so, the time is ripe for entry.  [Their white paper is pretty damn impressive as well](https://drive.google.com/file/d/0Bwgf8QuAEOb7Z2xIeUlLd21DSjQ/view), and most of the [legwork for their product/project has already been done as you can see in the roadmap](https://d36lai1ppm9dxu.cloudfront.net/assets/docs/simple-token-infographic.pdf).  Market cap is only $180Mil, Token is $1.00 right now with an ath of $1.41 on Huobi spike two days ago.  [Their Team is stacked with tons of experience as well](https://simpletoken.org/team)"}, {"score": 2, "matches": ["ethereum"], "content": "Can anyone explain why it's worth it to invest in this ethereum token instead of investing in Ethereum directly? Still fairly new to this, and this token looks very interesting but since it's built on top of Ethereum, guessing it would be safer to go with Ethereum?\n\nIn other words, if OST is a success, then Ethereum wins.\nIf OST is not a success, then Ethereum can still thrive since there's hundreds of other tokens built on it.\n"}]}, {"title": "KFC Upping Their Shitposting Game Lately", "score": 57, "comments": []}, {"title": "How FunFair could become huge, bringing positive attention to cryptocurrency as a whole.", "score": 57, "comments": []}, {"title": "[PSA] Call your cell phone provider and add \"Port Validation\" to your phone line to protect yourself from people trying to steal your crypto.", "score": 92, "comments": []}]