[{
    "title": "Daily General Discussion - January 12, 2018",
    "score": 102,
    "comments": [{
        "score": 22,
        "matches": ["stellar"],
        "content": "My favorite game is apparently stuffing my bags full of XLM and XRB each time they dip and watching them never get close to their former ATH. "
    }, {
        "score": 21,
        "matches": ["stellar"],
        "content": "Why are Raiblocks and XLM threads filtered by \"controversial\" but PRL threads filtered by \"Best\"? If the mods are picking sides based on what coins they hold that's utter fucking bullshit."
    }, {
        "score": 11,
        "matches": ["request"],
        "content": "The fuck is going on with REQ"
    }, {
        "score": 12,
        "matches": ["icon"],
        "content": "ICX is starting to make moves."
    }, {
        "score": 19,
        "matches": ["ethereum", "neo"],
        "content": "*Coin Analysis*: Nuls (Ticker: NULS)\n\n*Current Market Cap*: $165 million\n\n*Competitors*: QTUM ($3.7 billion mkt cap), NEO ($7.8 billion mkt cap), ETH (a lot)\n\n*Current Coin Supply*: 24 million\n\n*Exchanges*: Binance, Kucoin, EtherDelta, Bit-Z, OKEx, Coinbene\n\nWebsite: https://nuls.io\n\nWhitepaper: https://nuls.io/pdf/NulsWhitepaper1.1.pdf\n\n*Origin*: Based in Singapore (Team is Chinese)\n\n*Team Size*: 16, with 5 core development team (https://i.redd.it/4cc5j2fbrh101.jpg)\n\n\nGoal: \n\n* Creation and use of a modular blockchain for commercial use. Customizable, universally public blockchain infrastructure to aid in enterprise level deployment of applications. Open-source. Proof-of-credit and smart contracts.\n\nCompetitive advantage: \n\n* Creation of a modular blockchain that allows ease of development in the enterprise setting, creating value for industries and companies. \n\nDevelopment/founder/company vesting: \n\n* Only 1% of the tokens are unlocked per month for the next 20 months. They are committed to building a product and staked their coins on it.\n\nCommunity development: \n\n* 1% of coins each month are distributed to the community to support building of an ecosystem on the Nuls blockchain.\n\nPrevious work in Crypto & Blockchain:\n\n* “Inchain” – a previous project built by the same core development team that won the award for Most Innovative and Creative Project at China’s Blockchain Technological Innovation Contest (source: http://blog.inchain.org/archives/293). Inchain also did not fund their ICO and returned all investor dollars back to their Chinese investors. \n\n* This team is legit, they’ve been around the block, and they are going to build the next layer for enterprise blockchains in a way no one has done before (modular, proof of credit, AND smart contracts). Inchain product will be apart of Nuls blockchain.\n\nPartnerships: \n\n* Elephant Alliance (a huge Chinese conglomerate of businesses); Beijing Science and Technology Co., Ltd; and more than a dozen others in strategic partnership\n\nFinal Analysis:\n\n* Hugely skilled team, no USA marketing presence, flying under the radar with huge upside (sub $200M coin), a lot of trading volume, and partnerships in place with huge Chinese orgs. This is a company that will be valued as high as their current competitors (7x – 15x) fairly soon I believe. Longer term will be dependent on the final product brought to market and full adoption.\n"
    }, {
        "score": 8,
        "matches": ["cardano", "stellar", "request"],
        "content": "Just bought some FUN, XLM, REQ\n\nTo the moon or I'll gladly hold those bags for you.\n\nCurrent to the moon wallet by % holdings\n\n* XLM 18%\n* REQ 18%\n* FUN  17%\n* IOTA 15%\n* ADA 14%\n* UBQ 18%"
    }, {
        "score": 30,
        "matches": ["stellar"],
        "content": "XLM at a new 24h high 🚀🚀"
    }, {
        "score": 16,
        "matches": ["icon"],
        "content": "The fact you can get ICX and FUN at a discount right now with ICX launching on Korean exchanges on the 24th and FUN starting their casino soon is baffling. Fill your bags at these prices, folks. If you don't, somebody else will. "
    }, {
        "score": 8,
        "matches": ["request"],
        "content": "Add VEN to the portfolio or double down on REQ or ICX??? 🤔🤔"
    }, {
        "score": 15,
        "matches": ["icon"],
        "content": "ICX breaking out"
    }, {
        "score": 6,
        "matches": ["icon"],
        "content": "What happens to your ICX if you leave them in your ledger after the mainnet launches on the 24th?"
    }, {
        "score": 8,
        "matches": ["icon"],
        "content": "I wish icx could break through this 9.30-9.50 wall."
    }, {
        "score": 8,
        "matches": ["request"],
        "content": "I wonder when REQ will wake up"
    }, {
        "score": 23,
        "matches": ["stellar"],
        "content": "XLM! So I was in this thread yesterday posting some TA (and shilling sure) and pretty pleased to have made some tasty predictions, apart from us breaking down past the resistance we broke from the ATH to then find support at the resistance of the previous downwards channel. Huh. Crypto things. Yesterday: https://www.reddit.com/r/CryptoCurrency/comments/7pm5f6/daily_general_discussion_january_11_2018/dsiy0qy/\n\nThe prediction yesterday:\n\nhttps://i.imgur.com/EhTmkna.png\n\nNow looks like:\n\nhttps://imgur.com/FnSZ3s7\n\nNice nice. And our log chart after the bounce I described is now looking like this:\n\nhttps://imgur.com/Tg2KzSy\n\n3 out of the last 4 bounces off the bottom channel have us reaching the middle of the channel which puts us at $0.92. If we bounce to the top like last time, we're looking at $1.25 by the 15th. I'm hopeful but not delusional. I still think that XLM is a solid rocket in the next couple of days, just that I believe we're looking at a 50% growth, not 100%.\n\n(Trade at your own discretion not on my advice, do your own research and I could be wrong as fuckkkkk)"
    }, {
        "score": 19,
        "matches": ["stellar"],
        "content": "XLM is hungry for walls today"
    }, {
        "score": 6,
        "matches": ["walton"],
        "content": "WTC with those sweet SWEET gainszzszsz"
    }, {
        "score": 6,
        "matches": ["walton"],
        "content": "Any thoughts on SNOV? Decent niche project, newer ICO pretty low market volume, on Kucoin. \n\nWTC finally getting some more recognition, enormous company in China.\n\nXRB just killing my portfolio but I plan on holding XRB until the end of the year."
    }, {
        "score": 11,
        "matches": ["stellar"],
        "content": "xlm to the z8_GND-5296 its the farthest discovered planet we know"
    }, {
        "score": 10,
        "matches": ["stellar"],
        "content": "Hm, seems like XLM still has some life. Bought back in."
    }, {
        "score": 5,
        "matches": ["request"],
        "content": "Is there any news incomming for REQ in the sort-mid term or ?"
    }, {
        "score": 5,
        "matches": ["tenx"],
        "content": "Is all the holding going to pay off for ENJ today? Pls 🙏"
    }, {
        "score": 4,
        "matches": ["ethereum"],
        "content": "Shilling ETHLend\n\nEthLend's basis to to be able to lend ethereum in a decentralized market where the people are the ones setting the rate, not the banks. People loaning eth are paid back with interest. Low market cap with big potential imo.\n\nIf you are planning on HODLing Ether you might as well lend it and gain some more.\n\nUntapped market so far, only thing similar to it is SALT which isn't for peer to peer loans.\n\nAlso just partnered with ENG.\n\nThe roadmap is really well thought out and they have delivered on time so far. [Check it out here](https://ethlend.io/en/roadmap/)"
    }, {
        "score": 6,
        "matches": ["ethereum"],
        "content": "Would using XRB instead or ETH as the base pair be a good idea once they fix their wallet and exchanges start pairing it more?"
    }, {
        "score": 5,
        "matches": ["omisego", "binance"],
        "content": "Cobinhood announced a bunch of coins today including OMG and other big market cap coins.  \nThe exchange's coin COB still trading very low, but judging at where binance cash (BNB) has gone as they have added lots of new coins, we could see lots of cash heading over to Cobinhood to trade which is naturally going to drive up COB.  Their registration process also very easy and quick.  If anyone's looking for a good short to mid term coin.  I would say COB."
    }, {
        "score": 9,
        "matches": ["walton"],
        "content": "WTC breaking out here. $30 on this breakout?"
    }, {
        "score": 12,
        "matches": ["icon"],
        "content": "Wow! I get to buy more VEN and ICX and XRB on this extended sale. "
    }, {
        "score": 8,
        "matches": ["stellar"],
        "content": "50% XLM,  30% XLM, 20% XLM\n\nNeed more XML? Thoughts?"
    }, {
        "score": 3,
        "matches": ["cardano", "stellar"],
        "content": "Aaaaaand xlm and ada are taking off."
    }, {
        "score": 5,
        "matches": ["achain"],
        "content": "Any thoughts on the AChain fork that is suppose to happen today? Saw a couple things on 4chan and a few reddit threads but not much talk about it."
    }, {
        "score": 4,
        "matches": ["ark"],
        "content": "Anyone else feel like ARK sitting under $9 right now is a peachy buy? Haven't seen a soul bring this up yet."
    }, {
        "score": 5,
        "matches": ["ethereum"],
        "content": "Who else thinks ETH will surpass BTC's Marketcap this year?"
    }, {
        "score": 5,
        "matches": ["walton"],
        "content": "Should have bought wtc during the dip gat damn"
    }, {
        "score": 12,
        "matches": ["stellar"],
        "content": "XLM tickling my taint this morning. feelsgoodman"
    }, {
        "score": 11,
        "matches": ["stellar"],
        "content": "Right now, XLM is that girl who you just brought back to your house after taking her on a nice long date. You've just started hooking up and moved into your bedroom and things are heating up. But you're prettttty sure that she's the type of girl who's gonna stop you once you're both all the way naked and say \"I can't have sex with you yet\""
    }, {
        "score": 7,
        "matches": ["walton"],
        "content": "WTC going to explode. Rumours from slack saying it's a huge announcement upcoming."
    }, {
        "score": 11,
        "matches": ["request"],
        "content": "Req under a dollar wow look it has so much potential room for growth. "
    }, {
        "score": 10,
        "matches": ["stellar"],
        "content": "XLM looks like to fly again right now!"
    }, {
        "score": 6,
        "matches": ["stellar"],
        "content": "Lads, will the high market cap of Stellar make it difficult for it to ever hit $10 a coin?"
    }, {
        "score": 7,
        "matches": ["request"],
        "content": "any reason REQ isnt trading above a dollar? so undervalued!!"
    }, {
        "score": 3,
        "matches": ["request"],
        "content": "got my last budgeted 200$ REQ or XRP, or shud i split it between the two"
    }, {
        "score": 3,
        "matches": ["stellar"],
        "content": "I'm thinking of taking profit from XLM and riding VEN back up, thoughts?"
    }, {
        "score": 3,
        "matches": ["stellar"],
        "content": "Jealous of anyone who got in on XLM this past dip to the .40’s"
    }, {
        "score": 3,
        "matches": ["power"],
        "content": "So, looking at the performance of Power Ledger and the opportunity to invest in WePower. I think that ICO could moon. What do you think?"
    }, {
        "score": 3,
        "matches": ["stellar", "request"],
        "content": "65% REQ\n\n35% XLM\n\n\n\nShould I adjust?"
    }, {
        "score": 3,
        "matches": ["ethereum"],
        "content": "When do you guys typically sell back some of an alt you bought in on? I know everyone just preaches hodl here but I would have done very well for myself to sell some of my DBC, BNTY, and PRL back for ETH when they were at or near their peak. \n\nObviously that's hindsight bias and you never truly know when a coin's run is going to end, but are there certain sell-points or signs you guys look for to sell back into your main holding?"
    }, {
        "score": 3,
        "matches": ["binance"],
        "content": "Wish my bank transfer would hurry the F up so I can buy this discounted XRB. Binance listing within a week and total \"Nano\" rebrand, 23$ if a fucking steal. "
    }, {
        "score": 3,
        "matches": ["ethereum", "binance"],
        "content": "Issue with Ledger Nano S\n\nI attempted to send .5 ethereum last night to a binance wallet. Etherscan displays \"Sorry, we are unable to locate this Transaction Hash\"  when I click on the transaction on the ethereum ledger app. Tried to send again since the my wallet still displayed the original amount on the ethereum wallet app and reading about gas thinking I might not have put enough. Same thing happened to the next transaction. \n\nThe amount varies when I hit refresh on the wallet. It will either be 1.5 or 2.5 as well as displaying the transactions, sometimes listed doubled on the wallet home screen. Both transactions have not shown up on etherscan when I click on the wallets operations, nor in the binance wallet it was sent to. When I place the wallet ID in etherscan it shows the original amount of 2.5 in it.\n\nAm I screwed out of the 1 ethereum, or did the transaction never go through and It's just a ledger software issue?"
    }, {
        "score": 3,
        "matches": ["achain"],
        "content": "last call for ACT before the fork. should be happening in around 15 minutes.\n\nEdit: https://browser.achain.com/#/ The fork is supposed to happen at block 1498888."
    }, {
        "score": 3,
        "matches": ["achain"],
        "content": "Achain about to fork, get some while you can!"
    }, {
        "score": 3,
        "matches": ["stellar"],
        "content": "Lots of comments on XLM which is doing real good today (I thankfully am a holder). \n\nBut what about Augurs recent performance? It has been really great in this bearish market"
    }, {
        "score": 3,
        "matches": ["achain"],
        "content": "Anyone else out there holding sizeable stacks of ACT and PRL? I was wondering if we could start a support group after what has been going on today."
    }, {
        "score": 3,
        "matches": ["binance"],
        "content": "How does Binance decide which coins to list? Do they just list once it hits a certain market cap or volume on other exchanges?"
    }, {
        "score": 3,
        "matches": ["ripple", "cardano"],
        "content": "My biggest position as of last night:\n\n* Lumens\n\n* Deep Brain Chain\n\n* Ether\n\n* Bitcoin\n\nTimed selling my Ripple  and Cardano right at the top, now if DBC and Lumens can gain traction it’ll be solid."
    }, {
        "score": 12,
        "matches": ["stellar"],
        "content": "For every person who posts “What should i buy today?!? help!!” \n\nXLM\n\nxLM\n\nXlm\n\nXlM\n\nXLM is a great buy and hodl. I will be purchasing with no regret and consider it a no brainer until it hits $1.00. Then ill wait for the panic sells and buy more until it hits $2.00. and repeat until it earns top 5 on Coinmarketcap. XLM is a sexy little lady who will make all of us early birds very happy"
    }, {
        "score": 5,
        "matches": ["ripple"],
        "content": "Just got rid of the ripple I was stuck with to but more Ven at this dip!!! Hoping to register good gains with the announcements coming in this month #VenToTheMoon"
    }, {
        "score": 6,
        "matches": ["request"],
        "content": "People who talk about holding a coin until it at least gets back to where you bought it have the wrong strategy. My friend bought BTC at $17000 3 weeks ago and wanted to get altcoins but waited a whole 3 weeks for BTC to jump back to 17k then finally traded. If he had just invested in alts (he bought REQ and VEN) he would have more than doubled his money"
    }, {
        "score": 6,
        "matches": ["tron"],
        "content": "That \"dip\" was so wonderful to shake the weak hands. I hope nobody hurt themselves or committed suicide from taking out loans to buy meme coins like Tron though"
    }, {
        "score": 6,
        "matches": ["ethereum"],
        "content": "fucking alts suck ass, never should have traded my eth away."
    }]
}, {
    "title": "/r/CryptoCurrency is a Place for Quality Discussion",
    "score": 144,
    "comments": []
}, {
    "title": "BrainBlocks - PayPal Checkout lead engineer begins work on Raiblocks (XRB) checkout app",
    "score": 2986,
    "comments": [{
        "score": 38,
        "matches": ["tenx"],
        "content": "Everyone talks about using crypto for actual payments... the problem is that at least in the USA the tax implications of this are too cumbersome. It's like trying to pay for things with stocks..we need better policy before this stuff can be successful. "
    }]
}, {
    "title": "Twitch, an Amazon company, now takes btc and coinbase payments.",
    "score": 660,
    "comments": [{
        "score": 22,
        "matches": ["tenx"],
        "content": "ah yes just let me sub for 5$ and pay for 5$ fees"
    }, {
        "score": 6,
        "matches": ["binance"],
        "content": "Smart move.\n\nBinance CEO was saying males 25-35 are the big users of their site, i'm willing to bet thats a good chunk of the demographic of twitch too."
    }]
}, {
    "title": "Rocky Balboa's motivational cryptocurrency speech",
    "score": 903,
    "comments": []
}, {
    "title": "(Oyster) Pearl completes re-brand & new website + hires new engineers + testnet confirmed for end of the month!",
    "score": 336,
    "comments": [{
        "score": 6,
        "matches": ["power", "achain"],
        "content": "This tech has some nice edge to it that's quite exciting. Here's a couple of things I'm curious about...\n\n1. If node is to act as a new form of cloud storage, would that not involve requiring 100s of 1,000s of TB's of storage available, and that's just running at a fraction of say something like Dropbox? Definitely not the kind of node someone would have set up in their living room.\n\n2. The ad replacement is really smart, but we've already seen a huge backlash recently when a site was caught secretly using the CPU power of site visitors for mining without consent. How would the general public take to this idea I wonder...?"
    }]
}, {
    "title": "Great News from South Korea!",
    "score": 509,
    "comments": [{
        "score": 138,
        "matches": ["icon"],
        "content": "How convenient. Just around the time ICX mainnet goes live."
    }, {
        "score": 6,
        "matches": ["icon"],
        "content": "holy shit time to buy ICX"
    }, {
        "score": 6,
        "matches": ["icon", "binance"],
        "content": "Would I need to move my icx from binance once Mainer launches or can I keep them there ?"
    }]
}, {
    "title": "The current state of the crypto market",
    "score": 8075,
    "comments": []
}, {
    "title": "Buying alt coins",
    "score": 331,
    "comments": []
}, {
    "title": "ICON (ICX) - Expanding and Growing the Community",
    "score": 523,
    "comments": []
}, {
    "title": "Bad luck IOTA 😂",
    "score": 835,
    "comments": [{
        "score": 11,
        "matches": ["ethereum"],
        "content": "Bought IOTA at 50c, \nWell it's still a x6  in the same time ETH made  x3 and BTC made x2. I wouldn't call that bad luck \n"
    }, {
        "score": 7,
        "matches": ["ripple"],
        "content": "This is going to be the next Ripple and than everyone will think WTF why did I pass on this."
    }, {
        "score": 2,
        "matches": ["achain"],
        "content": "[...] Me, Dominik, CFB (and most other core IOTA Foundation people) live, breathe and sleep IOTA. It's our life, hence its success. This means that yes, we absolutely take the liberty to act like humans. I will not assume some artificial persona 24/7 to satisfy people I have never even asked to buy IOTA. IOTA is an open source non-profit Foundation where the founders and core devs are candid and interacts with the community, sometimes, when quoted out of context, it may seem like we are acting 'unprofessional', but that's not the truth. If I tell a troll or scammer to 'fuck off', there is nothing unprofessional about that. I feel like there's this meme going on where people have bought into and put on rose-tinted glasses and believe that 'professionalism' means that you are fake to everyone with a Colgate smile 24/7. That's not how the real world works. In the real world, people are experienced and mature enough to realize that success brings with it a fuckton of stress and nonsense that you have to deal with, therefore acting like a human is not frowned upon. It's a good thing, it breeds trust.\n\nAnd for fuck sake, why are people worried about curse words? We live in 2018! Curse words are correlated with honesty.\n\nElon Musk curses, call people idiot on twitter and calls out journalists on a not infrequent basis, hell, he even personally canceled a car purchase from a blogger that was critical of him. I don't see it hurting Tesla, SpaceX or any other affiliations he has. Why? Because people in business don't make decisions based on tweets.\n\nSo while I appreciate that you took the time to voice your concern, I maintain that there is nothing wrong with our communication style or our professionalism. [...]\n\nhttps://www.reddit.com/r/Iota/comments/7obyyx/serious_talk_about_pr_system_iota_and_david/"
    }, {
        "score": 2,
        "matches": ["ripple"],
        "content": "IOTA can move to be honest, unlike XRP it doesn't have that much of a supply."
    }]
}, {
    "title": "Goodbye, Coinbase. Hello APPC: An alternative method to purchase cryptocurrency directly from the Android \"Aptoide\" app store. 200 million Android users will be holding cryptocurrency by the end of this year.",
    "score": 631,
    "comments": [{
        "score": 9,
        "matches": ["tenx"],
        "content": "Why are you assuming that app users will control their private keys and be able to transfer APPC to exchanges? Unless I'm missing something, that won't be feasible. It would break the virtuous circle that makes APPC valuable in the first place.\n\nIf users can earn APPC by trying apps and then trade that same APPC on external crypto exchanges, nobody will use it for in-app purchases--especially if the market value of the coin is constantly rising. That would also bring loads of people into the system who have no interest in actually trying apps, and just want to \"mine\" APPC by handing over their two minutes of attention to anyone who will pay for it. The ad campaigns will be grossly dysfunctional, and developers won't be willing to pay for them.\n\nAPPC can be a tool for disintermediating the app economy, or it can be the cheap and convenient entree to crypto trading that you've described here. I don't think it can be both, and I feel pretty confident that the dev team favors the former. \n\nAnybody can build an app that makes it cheap and easy to buy crypto. Coinbase has in fact already done that, and competitors will follow with better prices. Virtually any coin would be suitable for that use case. It doesn't make any sense for the APPC team to compromise the features of APPC that actually distinguish it and make it useful in order to compete in a space where they have no advantage."
    }, {
        "score": 5,
        "matches": ["binance"],
        "content": "This coin actually has a team that’s already been running which is rare in crypto lele. Low market cap and coins in circulation which shows Good potential and I’m surprised it’s only on binance atm, will be good once it gets foot into other markets then we can gauge how far she’ll go."
    }, {
        "score": 7,
        "matches": ["tron"],
        "content": "I really don’t understand why people are saying this is a paid shilled post? This is actually from a random user. Look at aptoide twitter reddit and even the CEOs twitter. All are ghost towns and there’s been no shilling whatsoever. Do some research and you can see that they haven’t even started marketing yet... calm down people. This isn’t tron lol"
    }, {
        "score": 2,
        "matches": ["binance"],
        "content": "It's a little different, but why not Binance's BNB?\n\nBinance is already here and have 5 million users all of them want to trade / buy crypto. arguably, probably the best exchange, BNB itself can be use for trading and if you don't want to use it as base, using it will make trading in Binance cheaper.\n\nEven better, although its price is fluctuated, but so far the trend is ALWAYS going up and at the current situation the only reason it can go down is a total crypto collapse."
    }]
}, {
    "title": "Reminder: Make sure to backup your Google Authenticator keys",
    "score": 433,
    "comments": [{
        "score": 9,
        "matches": ["binance"],
        "content": "If you didn't backup those codes the first time (raises hand) you have to go through and deactivate 2FA,and reactivate it..this time save the codes. If you use Google authenticator, you will have to delete the old scans AFTER YOU HAVE DEACTIVATED 2FA THE FIRST TIME. \nAlso if you deactivate 2fa on binance you can't withdrawal funds for 24 hrs"
    }]
}, {
    "title": "XLM Hodlers Right Now",
    "score": 1119,
    "comments": [{
        "score": 3,
        "matches": ["ripple"],
        "content": "REQ, XLM, XRB, XRP (hm) and a couple of risky ERC20s/ICOs are my bread and butter\nFingers crossed for a steady rise"
    }, {
        "score": 4,
        "matches": ["stellar"],
        "content": "I fucking hate how the news fuds the market, then shills xlm and the new investors see that, and the coin actually pumps. "
    }, {
        "score": 2,
        "matches": ["stellar"],
        "content": "I got like 150 XLM well see what happens.  My toes are wet.  "
    }]
}, {
    "title": "Oyster Pearl (PRL) market cap doubles overnight on CoinMarketCap after they correct the circulating supply",
    "score": 395,
    "comments": [{
        "score": 6,
        "matches": ["icon"],
        "content": "after they.... FINALLY..... updated the circulating supply.\n\nIt's only been wrong since December 22nd...\n\nEdit: The total supply for ICX is still wrong of course."
    }]
}, {
    "title": "Bounty0x Bit-z Exchange Listing Bounty - 4 BNTY Reward",
    "score": 96,
    "comments": [{
        "score": 2,
        "matches": ["vertcoin"],
        "content": "Remember: you need to enable 2fa to get free vtc"
    }]
}, {
    "title": "Network Effects - The Inevitability of Waltonchain Adoption",
    "score": 335,
    "comments": [{
        "score": 24,
        "matches": ["walton"],
        "content": "WTC will one day shoot past it's sat ATH, it's just a matter of time.  "
    }, {
        "score": 22,
        "matches": ["walton"],
        "content": "I've just moved my whole portfolio to Walton Chain, which goes against everything I have learnt. \n\nI just know that Walton Chain is the next big thing. "
    }, {
        "score": 15,
        "matches": ["vechain", "walton"],
        "content": "could someone tell me why walton is better than vechain? I hold a decent amount of Vechain and I am considering investing  some of it into walton..."
    }, {
        "score": 7,
        "matches": ["vechain"],
        "content": " I'm going to echo some sentiments here- To play devil's advocate, what advantages does Vechain have over Walton?"
    }, {
        "score": 3,
        "matches": ["walton"],
        "content": "Can WTC and VEN coexist? Is there enough space for both?"
    }, {
        "score": 2,
        "matches": ["vechain"],
        "content": "What about vechain though. Are they in the same business? If so, they are a formidable competitor."
    }]
}, {
    "title": "XRP/Moneygram news made it to wall street papers this morning!",
    "score": 109,
    "comments": []
}, {
    "title": "FYI to every newbie in crypto ever, you never make it in time.",
    "score": 57,
    "comments": []
}, {
    "title": "Over 118,000 Koreans Have Signed a Petition to Reject the #Cryptocurrency Trading Ban Proposal",
    "score": 321,
    "comments": []
}, {
    "title": "The ID verification office at the exchanges",
    "score": 49,
    "comments": []
}, {
    "title": "Enjin listed on Kucoin today & one more exchange upcoming!!",
    "score": 212,
    "comments": [{
        "score": 16,
        "matches": ["binance"],
        "content": "40% on Binance today ^^"
    }]
}, {
    "title": "Read the Whitepaper they said.",
    "score": 263,
    "comments": []
}, {
    "title": "PayPal Checkout Engineer Creates Raiblocks Checkout App",
    "score": 49,
    "comments": []
}, {
    "title": "Why Stellar is the \"Triple Threat\" and should be taken more seriously..",
    "score": 781,
    "comments": [{
        "score": 3,
        "matches": ["ethereum"],
        "content": "I agree and hold a lot of XLM, but you should know that its smart contracts ability is significantly less powerful than Ethereum (by design).  So simple tokens are possible, but not crazy complex ones."
    }, {
        "score": 2,
        "matches": ["stellar"],
        "content": "The thing is those bullet points are just about all met with other coins. Like I'm heavily invested in VEN and can say the same thing just about and then some that XLM doesn't have. Plus VEN is much cheaper.\n\nThankfully I have enough money I can be heavily invested in more than one coin. So I can make money with both coins going up."
    }, {
        "score": 2,
        "matches": ["ethereum", "neo"],
        "content": "Like All the other platforms with No developers and same concepts as ethereum sorry i dont see adoption without developers, All these platform coins does very little to accomodate developers where ether and to an extend neo had the upper hans currently i think you are underestimating the importance of developer care to speed adoption.."
    }, {
        "score": 2,
        "matches": ["stellar"],
        "content": "When you say \"Support from IBM\" and these other companies.. you mean Stellar paid them and contracted them to write code for them?  That is not \"Support\" or any kind of \"Partnership\".. that is contract to write code."
    }]
}]