[{
  "title": "Daily General Discussion - January 8, 2018",
  "score": 295,
  "comments": [{
    "score": 142,
    "matches": ["ethereum"],
    "content": "Eth looking strong. "
  }, {
    "score": 51,
    "matches": ["ethereum"],
    "content": "Alright, sale is over boys, see you in a week or so, with another sale, don't forget to keep some ETH on the side for future sales.\n\nGL all :)"
  }, {
    "score": 169,
    "matches": ["stellar", "tenx"],
    "content": "I just want to say. I withdrew just enough funds to pay off all my credit cards today.. I took a bit of a gamble and put 2k into crypto on my credit cards and made 3x. So withdrew and kept 25% of all coins on exchanges . So excited, now will put a monthly limit into it from my bank account and keep enjoying the crypto gains. \n\nThe knowledge from this board is extremely helpful. I got into REQ, VEN, ICX, and XLM all at very low entry points. \n\nIt goes against the HODL but you gotta know when to pull out lol"
  }, {
    "score": 274,
    "matches": ["request"],
    "content": "Buy REQ please, I'm about to fall asleep and I want to wake up a millionaire. Thanks."
  }, {
    "score": 25,
    "matches": ["icon"],
    "content": "I love you ICX"
  }, {
    "score": 29,
    "matches": ["tenx"],
    "content": "Fuck it, cashed out. I reached my target goal of being able to pay off my car. I want to establish stability now while I can. Now I'll have more monthly income to invest in crypto 😋 "
  }, {
    "score": 24,
    "matches": ["stellar"],
    "content": "Hopely xlm will moon soon"
  }, {
    "score": 65,
    "matches": ["request"],
    "content": "Yesterday I bought more Req & Ven at All Time High,  Just encase you lot were wondering why they are dipping so much..."
  }, {
    "score": 22,
    "matches": ["icon"],
    "content": "ICX is blessing my otherwise red portfolio"
  }, {
    "score": 42,
    "matches": ["stellar"],
    "content": "I'm really hoping XLM is as good its portrayed to be. Just bought $500 more of it. Its definitely my largest holding.\n\nAnyone else got quite a big chunk in it? "
  }, {
    "score": 21,
    "matches": ["neo"],
    "content": "NEO is awakening."
  }, {
    "score": 42,
    "matches": ["stellar"],
    "content": "Waiting for the XLM moon, HODLERS with me plz"
  }, {
    "score": 17,
    "matches": ["ethereum"],
    "content": "Just got my ETH wallet synched and am sending a tiny transaction to it. \n\nIt's from Coinbase, though, so it's taking its time. \n\nBut the feeling of impending freedom from having my bestest investment moving from sitting on an exchange like a n00b to actually owning my own crypto for me and mine alone is so awesome. \n\n**AWESOME!**"
  }, {
    "score": 16,
    "matches": ["neo"],
    "content": "NEO showing who's boss here. I see you."
  }, {
    "score": 17,
    "matches": ["tenx"],
    "content": "I pay attention to my crypto more than my girlfriend, she only loves it because with my profits I’m buying her fake tits. Crypto = Key to Love "
  }, {
    "score": 14,
    "matches": ["neo"],
    "content": "NEO higher than TRON. Finally some justice in the Cryptoland."
  }, {
    "score": 13,
    "matches": ["request"],
    "content": "It's crazy to me that REQ feels like it has boomed a ton, yet it's still not even top 50 in market cap "
  }, {
    "score": 14,
    "matches": ["ethereum"],
    "content": "Eth saving everyone's portfolio rn lol"
  }, {
    "score": 28,
    "matches": ["binance"],
    "content": "Spent an hour staring at Binance chart....decided not to buy. Gonna sleep and hope to wake up and find patience pays off zzz"
  }, {
    "score": 14,
    "matches": ["ripple"],
    "content": "Thinking of selling all my XRP for XLM. Any reasons I shouldn't do this?"
  }, {
    "score": 13,
    "matches": ["binance"],
    "content": "when's the Binance Dust sweeper coming?"
  }, {
    "score": 14,
    "matches": ["tron", "binance"],
    "content": "Watch TRX crash live on binance"
  }, {
    "score": 13,
    "matches": ["stellar"],
    "content": "Tough week for xlm holders.  "
  }, {
    "score": 11,
    "matches": ["tron"],
    "content": "Welp, I bit a small loss on TRX and decided to move my coins into REQ.\n\nI'm sure you guys will agree with the move."
  }, {
    "score": 12,
    "matches": ["tron"],
    "content": "Jesus TRX is a bloodbath, I almost feel bad for the delusional fanboys who think this is a \"dip\" and they should \"hodl\".  Those principles do not apply to every project, lol."
  }, {
    "score": 11,
    "matches": ["request"],
    "content": "Good time to buy in for the REQ dip?"
  }, {
    "score": 12,
    "matches": ["ethereum"],
    "content": "So I take my kids upstairs for a bath, put them to bed, come downstairs, and ETH has grown by $100 USD and my alts drop 10%?\n\nSeems about right"
  }, {
    "score": 28,
    "matches": ["icon"],
    "content": "fuc only bought 20 icx well fuc i guess ill only b a little bit more wealthy "
  }, {
    "score": 23,
    "matches": ["vechain"],
    "content": "Crypto is funny. I've only been investing since November but after the December correction I feel like a grizzled vet watching all these newbs panic. Don't worry guys, your first \"crash\" is like popping your cherry. "
  }, {
    "score": 12,
    "matches": ["power", "request"],
    "content": "Dentacoin - $2 Billion valuation?\n\nThe blockchain solution for the global dental industry? \n\nDentacoin has higher valuation than Ark, Request Network, Substratum, Power Ledger, Chainlink and Walton! I find this ridiculous"
  }, {
    "score": 9,
    "matches": ["ethereum"],
    "content": "Using a combination of hermetic astrology and an RNG running off London traffic noise I've decided to go 90% ETH 10% ZRX. The former to feel happy and the latter so that I am fabulously wealthy in 2019 and can afford a proper crystal ball. "
  }, {
    "score": 12,
    "matches": ["ripple"],
    "content": "XRP... \n\nX is the 24th letter of alphabet 2+4=6 \n\nR is 18th letter of alphabet 24-18 = 6 \n\nP is 16th letter of alphabet 1x6 (or one 6) = 6\n\nXrp = 666\n\nRead ur bibles folks"
  }, {
    "score": 11,
    "matches": ["ethereum"],
    "content": "With ETH performing so well finding it hard to justify moving it to something else at the moment! Not worth the risk!"
  }, {
    "score": 12,
    "matches": ["request"],
    "content": "REQ"
  }, {
    "score": 10,
    "matches": ["ethereum"],
    "content": "ETH is a force. Hasn't looked back since breaking the $900 mark"
  }, {
    "score": 11,
    "matches": ["binance"],
    "content": "i think everyone needs to get there XRB now before it hits binance and explodes"
  }, {
    "score": 39,
    "matches": ["ethereum", "icon"],
    "content": "All I know is ETH is poppin, ICX is poppin and ICX is literally my dream coin. So happy I found it. "
  }, {
    "score": 20,
    "matches": ["stellar"],
    "content": "A little bit drunk here mates so lets hope I wake up tomorrow with some XLM gains. Cheers"
  }, {
    "score": 10,
    "matches": ["vechain"],
    "content": "The great wall of Vechain is back up and bigger than ever. Whoever's behind this is absolutely relentless. "
  }, {
    "score": 11,
    "matches": ["request"],
    "content": "REQ still worth getting on?"
  }, {
    "score": 10,
    "matches": ["stellar"],
    "content": "Is XLM still a good long term hold?"
  }, {
    "score": 11,
    "matches": ["stellar"],
    "content": "Why is XLM taking such a beating .."
  }, {
    "score": 19,
    "matches": ["ethereum"],
    "content": "Step 1: Learn about crypto trading after Christmas\n\nStep 2: Buy a shit ton of ETH at $700 a couple days later\n\nStep 3: Well, that was easy."
  }, {
    "score": 19,
    "matches": ["stellar", "icon"],
    "content": "XLM should rotate its icon "
  }, {
    "score": 9,
    "matches": ["ethereum"],
    "content": "Fuck! I really need to star keeping some eth on the exchange to be ready for these dips !"
  }, {
    "score": 9,
    "matches": ["binance"],
    "content": "Binance is crashing again. "
  }, {
    "score": 9,
    "matches": ["quantstamp"],
    "content": "Nobody mentioning QSP here, somebody hodling?"
  }, {
    "score": 8,
    "matches": ["icon"],
    "content": "huge buy orders for ICX breaking down all sell walls.  We are blasting off tonight boys"
  }, {
    "score": 9,
    "matches": ["icon"],
    "content": "icon is eating up walls"
  }, {
    "score": 8,
    "matches": ["ethereum"],
    "content": "Serious question.  I see a lot of people here saying \"rate my portfolio\" and a shocking number of you don't hold any ETH.\n\nWhy is that?  I do a lot of research before buying anything and there is simply nothing even close to ETH in terms of adoption, developers, etc. I mean all the top shilled projects here are built on ETH.  And I'm really not trying to shill ETH here.  I'm just curious as to why you don't have it in your portfolio."
  }, {
    "score": 11,
    "matches": ["ethereum"],
    "content": "ETH is the most underrated coin on the market. Its never shilled. No one ever yells MOON even though it hits a new ATH every couple days.  Tons of coins are built off of ehtereum. Almost everyone buys it to purchase alts. Probably the most common coin in everyone's portfolio. It pumps. It rarely dumps.  It just keeps kicking ass. It's the only coin right now with a realistic chance to beat bitcoin. No one talks about it. "
  }, {
    "score": 10,
    "matches": ["tron"],
    "content": "So what drops faster, Tron or a brick?"
  }, {
    "score": 9,
    "matches": ["ethereum"],
    "content": "bow down to your eth master"
  }, {
    "score": 10,
    "matches": ["stellar"],
    "content": "Seems like a really good time to buy into XLM "
  }, {
    "score": 10,
    "matches": ["tron"],
    "content": "Someone just put TRON out of its misery already. "
  }, {
    "score": 9,
    "matches": ["stellar"],
    "content": "So what is your XLM prediction a week from now?\n\nI think we will see $0.9 a week from here."
  }, {
    "score": 17,
    "matches": ["icon"],
    "content": "icx walls are crumbling "
  }, {
    "score": 8,
    "matches": ["binance"],
    "content": "Anyone having issues with Binance at the moment?"
  }, {
    "score": 7,
    "matches": ["icon"],
    "content": "ICX rising nicely today and it looks like things are about to get FUN ;-)"
  }, {
    "score": 7,
    "matches": ["icon"],
    "content": "I swear my index fund style is working but shit ICX making me want to do stupid shit."
  }, {
    "score": 8,
    "matches": ["stellar"],
    "content": "A lot of XLM activity all the sudden..."
  }, {
    "score": 8,
    "matches": ["enigma"],
    "content": "Where will you be when ENG moons?"
  }, {
    "score": 8,
    "matches": ["tenx"],
    "content": "I feel so dumb, I accidentally bought ICO instead of ICX, lmao. Always pay attention to the acronyms!!!"
  }, {
    "score": 7,
    "matches": ["ethereum"],
    "content": "##༼ つ ◕_◕ ༽つ ETH TAKE MY ENERGY ༼ つ ◕_◕ ༽つ"
  }, {
    "score": 7,
    "matches": ["stellar"],
    "content": "first time in a while i've seen XLM buy walls with much stronger support than sell walls "
  }, {
    "score": 8,
    "matches": ["stellar"],
    "content": "Don't miss the Stellar sale. Snapped some up at $.59 :)"
  }, {
    "score": 8,
    "matches": ["wabi"],
    "content": "Well tomorrow morning I get to go put the first payment down on a new car, it's no lambo but it's a family friendly QASHQAI it was my objective for this year and 10 days in its been achieved thanks to TRX, VEN, WABI and XRPs lovely run previously,  cash out, reinvest, don't get greedy, don't panic and most importantly do research always, dedicate plenty of hours per coin you look at. I hit 11 ten-baggers last year all thanks to research. Happy hodling peeps may the crypto-gods be with you"
  }, {
    "score": 8,
    "matches": ["stellar"],
    "content": "I'm guessing most people in here who bought XLM didn't realize that it's a long term hold.."
  }, {
    "score": 8,
    "matches": ["ripple"],
    "content": "Ripple back at 1.xx territory"
  }, {
    "score": 9,
    "matches": ["tron"],
    "content": "TRON LOOOOL!!!"
  }, {
    "score": 9,
    "matches": ["request"],
    "content": "Y u do dis req"
  }, {
    "score": 9,
    "matches": ["ethereum"],
    "content": "Eth you beautiful, bastard. My green in a sea of red. "
  }, {
    "score": 14,
    "matches": ["ethereum"],
    "content": "Never seen eth drain the market like this before. Usually it's Bitcoin that slays altcoins.\n\nIs this a milestone?"
  }, {
    "score": 14,
    "matches": ["neo"],
    "content": "NEO on the precipice of parabolic growth"
  }, {
    "score": 6,
    "matches": ["request"],
    "content": "Which has more potential, PRL or DBC? Gotta let go of one to pick up both REQ and VEN."
  }, {
    "score": 6,
    "matches": ["icon"],
    "content": "My portfolio is back where it was before the dip and I was able to add to my ICX position. #feelsgood\n\nIf you sold low, take it as a lesson and try not to feel bad :)"
  }, {
    "score": 8,
    "matches": ["omisego"],
    "content": "Why does no one seem to hold OMG when they talk about their portfolios?\n"
  }, {
    "score": 7,
    "matches": ["stellar"],
    "content": "Can someone give me an idea of what XLM and VEN could possibly reach? Trying to understand market caps and all that before I start throwing money in alts and these are two I’m looking at. "
  }, {
    "score": 6,
    "matches": ["icon"],
    "content": "ICX tho"
  }, {
    "score": 6,
    "matches": ["stellar", "icon"],
    "content": "dropped xlm for icx to go for a ride. wish me luck"
  }, {
    "score": 8,
    "matches": ["icon"],
    "content": "ICX cruising through those blocks. "
  }, {
    "score": 6,
    "matches": ["ethereum"],
    "content": "New to trading but can I just clear something up...\n\nI see all the time people posting about ATH and everything based on the monetary value (FIAT),  and how they bought in at a coin at $4 then sold at $4.40 for a profit (example), as a newbie that seems great, but in reality that could easily be an actual loss? if their basing their pricing off the product/eth charts then in reality based off the movement off ETH, their coin could of actually gone down in price. and soley the price of ETH has risen. So people are trading eth for coins, and it says their funds are increasing, but they trade back to eth for a lower amount of physical eth but a higher USD, and think they are making money, when in reality they could of just left it in eth and be more infront.\n\nIm tired so not sure if that made sense at all, and not entirely sure if what im saying is actually correct, it just seems like the way people are talking about prices on here a lot of the time its based on eth going up and not their alt coin. or something something Dogecoin shill something"
  }, {
    "score": 8,
    "matches": ["ethereum", "binance"],
    "content": "Just a general (probably noob) question, since BTC has fallen last couple days and ETH has been on a crazy bull run, is it better to trade alts for BTC in this case rather than ETH?\n\nExample is VEN/BTC on Binance is essentially at an ATH right now while VEN/ETH has fallen a decent amount in the last few days.\n\nI normally trade with ETH, but not sure what is a better strategy in this case or if it doesn't actually make a difference.\n\n"
  }, {
    "score": 6,
    "matches": ["ethereum", "neo", "power"],
    "content": "I am noticing that the solid alt coins with good hodlers are hodling up well and telling bitcoin sellers to fuk ov with no real movement or quick recoveries.  I am seeing that ETH resistance is getting stronger after each bitcoin dip.   Traders are now prefering ETH  which lead to more hodlers of ETH and hence increase in price.   I think ETH trading pairs volume will keep increasing.  BTC still has the power but not as much as time goes on.\n\nI was looking at the dev docs in NEO and i am just floored at how good it is.  I have high hopes for NEO."
  }, {
    "score": 7,
    "matches": ["enigma"],
    "content": "eng about to moon big partnership announcement"
  }, {
    "score": 9,
    "matches": ["tron"],
    "content": "Lol Tron is bleeding out"
  }, {
    "score": 6,
    "matches": ["stellar"],
    "content": "Hey when all of us XLM holders wake up one day to see it on planet Mars can we have a mini fu*cking reddit party where we all virtually hug each other? Oh ya VEN too. And REQ. And my entire portfolio...aright I need to check out for a few day"
  }, {
    "score": 7,
    "matches": ["stellar"],
    "content": "Was reading on onchainfx that XLM has only issued 12 % of their supply.  Was contemplating investing but what does mean for future prices? "
  }, {
    "score": 7,
    "matches": ["stellar"],
    "content": "XLM just dropped below 60 cents on Binance. This could get ugly for a minute. Or a good thing if you want to buy more :)"
  }, {
    "score": 8,
    "matches": ["stellar", "tenx"],
    "content": "This XLM chart is nuts, it goes down a cent, and then a giant pay wall launches right where it just was. Been doing this for about 30 minutes. "
  }, {
    "score": 8,
    "matches": ["ethereum"],
    "content": "Thank god for ETH"
  }, {
    "score": 7,
    "matches": ["request"],
    "content": "REQ just keeps falling. I want to re-enter but damn."
  }, {
    "score": 7,
    "matches": ["request"],
    "content": "Req gettin rekt "
  }, {
    "score": 7,
    "matches": ["stellar"],
    "content": "XLM still going down :( \n\nGonna take a break for a few days, this week has been brutal. "
  }, {
    "score": 14,
    "matches": ["request"],
    "content": "REQ"
  }, {
    "score": 16,
    "matches": ["ethereum"],
    "content": "Eth back at #2 on CMC"
  }, {
    "score": 11,
    "matches": ["request"],
    "content": "req is about to explode. get in now"
  }, {
    "score": 12,
    "matches": ["icon"],
    "content": "Go ICX 💪💪"
  }, {
    "score": 13,
    "matches": ["tron"],
    "content": "Have a feeling Tron will crash today and never recover again"
  }, {
    "score": 6,
    "matches": ["vechain"],
    "content": "Vechain dipping as soon as i buy some. Fml"
  }, {
    "score": 6,
    "matches": ["ripple"],
    "content": "Just downloaded enjin wallet for Android works flawlessly. Heads-up doesn't support xlm, xrp"
  }, {
    "score": 6,
    "matches": ["stellar"],
    "content": "Dip day is fun day, increased positions in xlm and xrb on the cheap, now it’s just a matter of ignoring the numbers on delta for a few hours."
  }, {
    "score": 6,
    "matches": ["binance"],
    "content": "Yikes, just woke up and took a peek at my account. Looks like I'll be deleting my Binance app for the day."
  }, {
    "score": 6,
    "matches": ["neo"],
    "content": "So many coins seem interesting. Trying to redefine my portfolio to ensure I've invested in different types of coins. Long term I'm confident in REQ, XML, NEO and ENJ. BNTY seems like it could take off and need to find a privacy coin. DNT has some potential.\n\nIt's tough to avoid becoming an index fund by investing small amounts in many promising coins. I'd much rather HODL 4-5 coins I'm confident in plus hold a bit in BTC or ETH. Just difficult to narrow it down when it feels like I'm excluding so many promising projects lol"
  }, {
    "score": 6,
    "matches": ["stellar", "request"],
    "content": "Its so weird saying coins not move at all. XLM and REQ have basically been the same for days now "
  }, {
    "score": 6,
    "matches": ["stellar"],
    "content": "Thoughts on XLM short term?"
  }, {
    "score": 6,
    "matches": ["icon"],
    "content": "ICX sell wall coming down, about to really start moving."
  }, {
    "score": 6,
    "matches": ["stellar"],
    "content": "Pumping ~~ICX~~ XLM again, crossing my fingers this hits $2"
  }, {
    "score": 6,
    "matches": ["icon"],
    "content": "ICX isn't on any Korean exchanges is it? and if not, when?"
  }, {
    "score": 7,
    "matches": ["stellar"],
    "content": "It may not be 50k usd but I lost my .85 LTC pulling it off coinexchange.io last night. It doesn't give me a real tx number, just the number 2 but it says it's complete. I made a ticket for support but do you guys think I'll see my .85 LTC again? Have a good night and go XLM to the moon."
  }, {
    "score": 6,
    "matches": ["stellar"],
    "content": "Gamble on APPC or get some more XLM for cheap? "
  }, {
    "score": 6,
    "matches": ["neo", "stellar"],
    "content": "Just sold 50% of my NEO holdings at a significant profit to scoop up some of those undervalued XLM you’ve all been getting rid of. Call me stupid but I guess time will tell ;)"
  }, {
    "score": 5,
    "matches": ["neo"],
    "content": "I was looking at ICX, ARK, and NEO today but decided to hold off thinking they may pull back a bit. That was a mistake, lol."
  }, {
    "score": 6,
    "matches": ["stellar"],
    "content": "Blockfolio had a glitch just now and said that XLM was up at $0.93. Alas, it wasn't true"
  }, {
    "score": 7,
    "matches": ["ethereum"],
    "content": "Thoughts on investing into ETH now? Good long term gains?"
  }, {
    "score": 6,
    "matches": ["enigma"],
    "content": "ENG and LEND news: Enigma and Ethlend Partner to bring Secret Contracts to Decentralized Lending\n\nhttps://blog.enigma.co/enigma-and-ethlend-partner-to-bring-secret-contracts-to-decentralized-lending-5d983dc6dc0d"
  }, {
    "score": 7,
    "matches": ["neo"],
    "content": "Im getting in more on this NEO wagon. This thing is just steady."
  }, {
    "score": 6,
    "matches": ["icon"],
    "content": "Which one of VEN and ICX would you buy right now? I would think VEN was the obvious choice given the big name partnerships, government support and  low market cap but I'm seeing ICX being suggested a lot. "
  }, {
    "score": 6,
    "matches": ["request"],
    "content": "Thinking of dedicating my entire portfolio to XRB VEN REQ ICX. I feel this would be the best long term portfolio for massive returns. Thoughts?"
  }, {
    "score": 6,
    "matches": ["enigma"],
    "content": "ENG going offffffffffffff"
  }, {
    "score": 6,
    "matches": ["ethereum"],
    "content": "This is why ETH is 40% of my portfolio.."
  }]
}, {
  "title": "Critical Electrum vulnerability - Update your software",
  "score": 461,
  "comments": [{
    "score": 25,
    "matches": ["vertcoin"],
    "content": "VTC devs have fixed Electrum-VTC here:\n\nhttps://github.com/vertcoin/electrum-vtc/releases/tag/2.9.3.5"
  }, {
    "score": 7,
    "matches": ["ethereum"],
    "content": "Mis-read as Ethereum and had a mini panic attack."
  }]
}, {
  "title": "Cryptocurrency market in a nutshell these days.",
  "score": 6163,
  "comments": [{
    "score": 238,
    "matches": ["tron"],
    "content": "Tron is the man walking on fire "
  }]
}, {
  "title": "How I feel diversifying my altcoin portfolio.",
  "score": 1511,
  "comments": []
}, {
  "title": "When my parents look at my blockfolio and ask where my profits have gone",
  "score": 3191,
  "comments": []
}, {
  "title": "From one Tron investor to another:",
  "score": 332,
  "comments": [{
    "score": 36,
    "matches": ["tron"],
    "content": "Glad i’m watching tron prices just because i got 500 trx free lol"
  }, {
    "score": 26,
    "matches": ["vechain"],
    "content": "put it into Vechain yo! "
  }, {
    "score": 7,
    "matches": ["tron"],
    "content": "it was down to 0.09 but now its back to 0.13 quickly.  i bought at 3.5 cents.  also the price of bitcoin dropping doesn't help. put bitcoin back around 16.5k and tron would be about 0.16 right now"
  }]
}, {
  "title": "VeChain partnership with DNV GL: 80,000+ customers",
  "score": 167,
  "comments": [{
    "score": 16,
    "matches": ["vechain"],
    "content": "“Another concept is that, in a traditional world, economic development is dependent on the supply of currency. The economy can only develop further by increasing the supply of currency, and that is the reason why a slow inflation process occurs. However, in the world of blockchain, we use another method to support the development of economy. Through the high efficiency of smart contract execution, digital currencies can circulate much faster than traditional currencies. If you have 1 dollar, and you let it circulate for 100 times a day, you actually spend 1 dollar like 100 dollars. That’s why blockchain technology is called the technology of transfer and it provides great support for the economy. The use of blockchain technology can boost economic development and ease inflation at the same time.”\n\n\nThe fact that this is under $5 is absurd. \n\n\nEdit -\n\nDon’t forget about this article \n\nhttps://www.coindesk.com/china-blockchain-maybe-2018/\n\n“I personally believe in 2018 China will be the first major country to launch a central bank digital currency (CBDC), and that we will also see a large-scale blockchain implementation in the retail and logistic industry with a blockchain solution developed by Chinese companies.”\n\nWritten by a Vechain committee member.\n\nI don’t want to read too much into it, but...\n"
  }, {
    "score": 2,
    "matches": ["vechain"],
    "content": "This is crazy.  I feel like a lot of people in crypto haven't traded on the stock market or worked in a business environment before, other wise VeChain would be easily $10B by now.  This is such huge news, to get this size of a deal at only $1B marketcap.  The application of VeChain to ISO certification is so beneficial, that this deal alone makes VeChain worth multiple billions of dollars, let alone all the partnerships combined.  Blockchain is like ISO's dream"
  }]
}, {
  "title": "Tron’s Whitepaper is Copied, Plagiarized – Cryptocoins – Medium",
  "score": 1611,
  "comments": [{
    "score": 15,
    "matches": ["achain"],
    "content": "Can we stop posting random Medium articles and act like they're sourced news articles? The guy who posted this only has 70 followers and created his account a few days ago. "
  }, {
    "score": 422,
    "matches": ["tron"],
    "content": "https://i.imgur.com/xXbcnDO.png\n\nTRON is one of the clearest examples of why so many people think we're in a delusion FOMO-driven bubble.\n\n They'll do a burn soon and Justin will probably go into promotion overdrive to stop the bleeding before he finishes cashing out enough of his stake before the whole house of cards collapses. Its amusing watching him reduce his stake it on the blockchain explorer and most TRX holders having no clue what is happening, or what this even means. That \"private investor\" allocation to himself which is now down to 7.7% is still worth over a billion dollars.\n\nWhat's amazing is he managed to convince so many people that there is some sort of partnership with Alibaba and that Alibaba will use their coin....because he paid money to go to Jack Ma's Hupan University, and took a picture with Jack Ma at an completely unrelated speaking event that Ma gave. I mean you can even see the mic on his shirt for god's sake and people still bought it. This guy is going to become ridiculously wealthy off scamming naive millennials. And he's going to get away with it, instead of being arrested and prosecuted like in a regulated securities market. Which means this will only encourage more and more scam coins. \n\n[/biz/ is already laughing at the normies](https://i.imgur.com/EvvND7n.jpg)"
  }, {
    "score": 51,
    "matches": ["tron"],
    "content": "I'm TRON holder since the ICO. While I love the insane gains, I'm a bit bummed about the whitepaper. However, I knew the whitepaper was b.s when I invested into the ico. Alas, this is a illogical, hype fueled market, and I'm going to ride these gains for as long as I can :). "
  }, {
    "score": 54,
    "matches": ["tron"],
    "content": "You people have tunnel vision. You take one circumstance and base all logic on that, apart from all other evidence. I hope you are never called to be on a jury.\n\nSun has dropped a lot of names and companies on this so called \"scam\". I highly doubt Jack Ma is going to let his name get dragged through the mud considering who he is and what he stands for. Use some real common sense here. Nobody is going to have the balls to drop a big scam at the expense of the reputable. It just doesn't happen. That is why you would be smarter to see that the good far outweighs the bad in this TRON project.\n\nFurthermore. The idea of a decentralized blockchain economy is a young one full of uncertainty. It is not clearly define. The roads are just now being paved. Projects brought forth will be full of questionable stuff. Changes will be made as we go. An evolution. This is not a straight forward reality.\n\nClearly Justin Sun is dreaming here. Just look at the damn evidence that completely contradicts the OP of this thread. Yes. The price has gone down on TRX. But it has on the whole market. Which leads me to not question TRON. But to question who or what is heavily manipulating the market right now. And we need to do something about it."
  }, {
    "score": 20,
    "matches": ["tron"],
    "content": "Man... I'm so torn. I sold all my Verge (that was making me huge gains BTW) because of all the shit flying around here about it. It *seemed* quite obvious to me that Verge was a shit coin but I didn't have a lot invested and it was on a roll so I held. I ended up getting out with a nice profit.\n\nNow, we have Tron facing similar accusations of being a scam. I've doubled my money in Tron so I'm cool getting out now and just taking a win. But... if it's like Verge, it looked for a while like it was just going to bottom out and now Verge is back up to nearly the all time high. So, do we wait Tron out and see if we can make a little more? Or just get out?\n\nFuck"
  }, {
    "score": 16,
    "matches": ["tron"],
    "content": " Yeah, I decided to take a small L on this one. Bye TRX"
  }, {
    "score": 20,
    "matches": ["tron"],
    "content": "I'm up %10000 gonna ride this out. Also you know a successful business requires great marketing not just a white paper. Also most posting this likely haven't even read it or missed the initial investment.  Like most new projects it's WIP. New exchanges and partnerships, new hires, and new offices. Looks like TRX is planning on sticking around to me."
  }, {
    "score": 26,
    "matches": ["tron"],
    "content": "Please upvote this so people stop saying I'm spreading FUD when I say TRON is a scam-"
  }, {
    "score": 9,
    "matches": ["tron"],
    "content": "Anyone not holding any coin throughout 2018 is stupid. Tron is going up from here! sell or buy, who cares... bts leaves bittrix and \"goes to 0\" and now has reached new ath. thinking a coin is just gonna go away in a month is nonsense. The key is accumulate and hold this whole year... worry about your stupid \"this coin is a scam\" and \"it's not even decentralized\" crap later. ITS A BUBBLE! Make your money, put it in ethereum/bitcoin and chill! "
  }, {
    "score": 6,
    "matches": ["tron"],
    "content": "Tron is a scam"
  }, {
    "score": 4,
    "matches": ["tron"],
    "content": "Tron was the quickest in and out I have ever done with any crypto or stock. I stayed in for about 12 hours and then noped the fuck out. No losses outside of trading fees. I admit I got caught up in the hype. Mistake learned. "
  }, {
    "score": 3,
    "matches": ["tron"],
    "content": "TRX always seemed fishy to me, glad I didn't hop on that coinwagon."
  }]
}, {
  "title": "VeChain - Fortune 500 focused version of Ethereum, not just a supply chain solution",
  "score": 267,
  "comments": [{
    "score": 11,
    "matches": ["vechain"],
    "content": "Posted this in another thread, but this might be even bigger..\n\n“Another concept is that, in a traditional world, economic development is dependent on the supply of currency. The economy can only develop further by increasing the supply of currency, and that is the reason why a slow inflation process occurs. However, in the world of blockchain, we use another method to support the development of economy. Through the high efficiency of smart contract execution, digital currencies can circulate much faster than traditional currencies. If you have 1 dollar, and you let it circulate for 100 times a day, you actually spend 1 dollar like 100 dollars. That’s why blockchain technology is called the technology of transfer and it provides great support for the economy. The use of blockchain technology can boost economic development and ease inflation at the same time.”\n\n\nThe fact that this is under $5 is absurd. \n\n\nDon’t forget about this article \n\nhttps://www.coindesk.com/china-blockchain-maybe-2018/\n\n“I personally believe in 2018 China will be the first major country to launch a central bank digital currency (CBDC), and that we will also see a large-scale blockchain implementation in the retail and logistic industry with a blockchain solution developed by Chinese companies.”\n\nWritten by a Vechain committee member.\n\nI don’t want to read too much into it, but...\n"
  }, {
    "score": 44,
    "matches": ["vechain"],
    "content": "VeChain has got to be one of the most (if not the most) ambitious cryptos around. 2018 will be a huge year for them."
  }]
}, {
  "title": "Binance confirms XRB as Community Coin of the Month!",
  "score": 2749,
  "comments": [{
    "score": 75,
    "matches": ["binance"],
    "content": "Does the community get to also vote on one shitcoin to remove from the exchange per month 😬? Let's make this shit like Survivor, and cast the shittiest of shitcoins off the Binance island!"
  }, {
    "score": 178,
    "matches": ["binance"],
    "content": "Disclaimer: I already have my stack of XRB.\n\nFor people who are looking for a entrypoint/dip to buy into XRB, now is the time. You won't see this range of 25-30 USD anymore, as soon as RaiExchange, Binance listing and the rebranding happen. And let's be honest.. Seeing what lingers around in the top 10/20, XRB would be a decent fit with a worthy tech behind it."
  }, {
    "score": 158,
    "matches": ["binance", "tenx"],
    "content": "great stuff!  on a different note, can we weed out bitcoin maximalist trolls like whalepanda who were spreading fud before and during the vote? \n\n[this is what he said:](https://twitter.com/whalepanda/status/947453805553160192?lang=en)  \n\n> People ask me about Binance, I don't trade there. The community voting is rigged. If a coin wins they still have to pay a huge amount to get listed. around $1 million. They're also asking for insider trading info “Tell us something about project the public doesn’t know about yet”\n\n\nnow binance have themselves confirmed that :\n\n\"As promised, XRB will be awarded with a free listing placement on Binance.\"  \n\nwinners do not need to pay 1m or provide insider info contrary to what this clown claims.  \n\nwhich proves this moronic douchebag is just a liar with fake sources and trying to play binance as a shady organisation, yet does not provide any proof for his lofty accusations. this is clear defamation and shows how petty and miserable bitcoin maximalists have become in this industry, they will use their twitter followers echo chamber to dump lies on them to damage another organisation's reputation   \n\nshame on the troll whale panda who is outed as a disgusting liar  \n\nbinance is still the best exchange out there, by far!!  "
  }, {
    "score": 25,
    "matches": ["ethereum", "binance"],
    "content": "Where Can i buy xrb with btc or eth instantly ? Before it goes on binance"
  }, {
    "score": 19,
    "matches": ["binance"],
    "content": "i always wanted to get into XRB but couldnt coz i dont have accounts anywhere else than bianace and most big XRB exchange closed doors for newcomers so good its coming to binance but as much as i like XRB i might have to skip coz i was going to buyin at 7-9$ now its like 25-28$ so yeah\n\nstill bullish on the coin so might invest later if it crashes a bit coz its been a crazy run for XRB in the past 8-10 days."
  }, {
    "score": 3,
    "matches": ["binance"],
    "content": "Why on earth would Binance do this when they don't even offer it?\n\nedit: I didn't realize this was the result of their vote/survey. \n\nGet your Raiblocks now. Odds are they're going to surge in price once Binance starts to offer them."
  }, {
    "score": 2,
    "matches": ["binance"],
    "content": "Is it worth waiting for it to be listed on Binance to buy in? The other exchanges seem shady or like a hassle. Am I wrong?"
  }, {
    "score": 2,
    "matches": ["binance"],
    "content": "If Binance is naming it the COTM, why don't they offer it on their exchange?"
  }, {
    "score": 2,
    "matches": ["binance"],
    "content": "I said earlier I was worried the price would drop on xrb when it was added to bigger exchanges, and I got downvoted HARD. \n\nEveryone thought it would be $100 and rocket cuz it was going on more exchanges. \n\nI sure hope binance can refuel the rockets on xrb"
  }, {
    "score": 2,
    "matches": ["binance"],
    "content": "Bitgrail for 4 days wouldnt work and i watched it go from 8-12.  Then at 15 binance still was broke, its CSS wouldn't loadm. 4 days in a row i tried then figured.. hell i missed it.  Then it goes to 30.  I dont know how anyone was able to purchase on that piece of crap exchange."
  }]
}, {
  "title": "Oyster Pearl rebranding, new website and testnet coming this week.",
  "score": 772,
  "comments": [{
    "score": 7,
    "matches": ["lisk"],
    "content": "I get where you’re coming from. What I’m saying is that an idea and service are fairly far along in the works right now and that this puts PRL in a category above most of the coins with a higher MC than it currently has. Every crypto investment is a bit of a risk, but I see far less risk in this one than in, say, LISK or TRON. Thanks back :)"
  }]
}, {
  "title": "Ark just added a new feature to its wallet that should be implemented by all cryptocurrencies",
  "score": 567,
  "comments": [{
    "score": 17,
    "matches": ["ark"],
    "content": "I thought it was odd as well that this wasn't common. Happy that Ark takes initiative with the implementation of user friendly ideas."
  }, {
    "score": 8,
    "matches": ["neo"],
    "content": "Neon-Wallet for NEO also warns if the address has never been used before; but I agree, it is certainly a good feature to have!"
  }, {
    "score": 3,
    "matches": ["ark"],
    "content": "Isn't address without transaction how its supposed to be? I'm not familiar with ark but the whole hd wallets thingy"
  }, {
    "score": 4,
    "matches": ["ark"],
    "content": "Exactly what is needed and yet it isn't implemented in other wallets. I love ARK and the professionalism of the team. Makes holding easy during the rough times."
  }, {
    "score": 3,
    "matches": ["ark"],
    "content": "I think Ark got the best wallet in the market right now."
  }, {
    "score": 2,
    "matches": ["ardor", "nxt"],
    "content": "Nxt and Ardor [have](https://i.imgur.com/NQHzapg.png) similar [warnings](https://i.imgur.com/pAzrph7.png) (I think NXT for three years)."
  }, {
    "score": 2,
    "matches": ["ark"],
    "content": "Ark has one of the best wallets out there. Ever try taking a screenshot of the Ark wallet? They put a feature that doesn't let you do this and the screenprint just shows up as blank. Amazing team."
  }]
}, {
  "title": "me trying to pick the best alt-coin",
  "score": 112,
  "comments": [{
    "score": 7,
    "matches": ["omisego"],
    "content": "Omg 😂😂 why was he so freaked out he couldn't even eat it!! Needs to cross post to some doggo subs. "
  }]
}, {
  "title": "40 days since I wired money to coinbase",
  "score": 1114,
  "comments": [{
    "score": 26,
    "matches": ["tenx"],
    "content": "I never connect anything to my bank account, if my bank can't just send a check to them then they're not getting it in cash. Period. I always just pay Coinbase with a credit card and take the hit. It's not a cash advance on my card I use for it and I just pay myself back out of my bank. I always get whatever I bought immediately. Might be something you guys want to look into for the future, seeing a lot of these posts lately...the fee is worth it to not have to deal with the shit you guys are dealing with, in my opinion. Good luck."
  }]
}, {
  "title": "When the numbers turn green again",
  "score": 572,
  "comments": []
}, {
  "title": "[Inforgraphic] The era of NEO is here. Don't miss it!",
  "score": 124,
  "comments": [{
    "score": 6,
    "matches": ["neo"],
    "content": "NEO has big potential. The technology is good and the supply is small compared to so many of the cryptos being pumped. We could see multi hundred dollar NEO in coming months.  "
  }, {
    "score": 7,
    "matches": ["ethereum", "neo"],
    "content": "Neo > Eth "
  }]
}, {
  "title": "Dogecoin founder on Twitter: I think it says a lot about the state of the cryptocurrency space in general that a currency with a dog on it which hasn't released a software update in over two years has $1 billion market",
  "score": 1959,
  "comments": [{
    "score": 41,
    "matches": ["cardano"],
    "content": "> Dogecoin founder on Twitter: I think it says a lot about the state of the cryptocurrency space in general that a currency with a dog on it which hasn't released a software update in over two years has $1 billion market\n\nIt say more when we see cardano at 20B$"
  }, {
    "score": 11,
    "matches": ["ethereum"],
    "content": "The beauty of doge is that it is a great backup currency for transferring money between exchanges when BTC, ETH and even LTC are taking a long time. It's the market moving towards networks that aren't congested. "
  }, {
    "score": 8,
    "matches": ["ethereum"],
    "content": "Just goes to show utility matter more than people realize. \n\nLots of people use Doge because it's the fastest and cheapest to tx. Shibe mascot or not, you can't argue that while waiting hours for BTC confirmations...\n\nJackson makes it sound like if Doge just had a slicker mascot, it would be up there with Ethereum etc... sounds kinda bitter he backed out years ago and missed all these gains ;)\n\nEdit: spelling"
  }, {
    "score": 27,
    "matches": ["tron"],
    "content": "Still better than tron"
  }]
}, {
  "title": "Ripple slips below $2",
  "score": 122,
  "comments": []
}, {
  "title": "XtraBytes (XBY) - Testnet 3 has Officially Begun!",
  "score": 256,
  "comments": []
}, {
  "title": "How many of you have portfolios that are worth more than your bank account?",
  "score": 203,
  "comments": [{
    "score": 7,
    "matches": ["omisego"],
    "content": "My bank account is crypto, and forever will be through OMG"
  }]
}, {
  "title": "Showerthought: Binance should create a lottery with all the Dust of its users. If you want to participate, you will donate your dust and become a ticket holder. At the end of the month, a winner gets the jackpot.",
  "score": 1192,
  "comments": [{
    "score": 503,
    "matches": ["binance", "tenx"],
    "content": "Or just make necessary changes to their platform so we can convert dust to BNB and pay for future exchange fees. As you said, it's a lot of money"
  }, {
    "score": 31,
    "matches": ["binance"],
    "content": "Surely if the dust can be swept into a prize fund it can be swept into your BNB holdings?"
  }, {
    "score": 20,
    "matches": ["ethereum"],
    "content": "Is dust the leftover amounts of altcoins that can't seem to be traded because they don't add up to .002 ETH or whatever arbitrary amount is set? \n\nI have never heard it called dust, but it makes sense. I hate that I have a bunch of \"small assets\" on there that I can't seem to trade."
  }, {
    "score": 12,
    "matches": ["binance"],
    "content": "Has binance said anything about plans to fix the dust issue? Have they even acknowledged it?"
  }, {
    "score": 5,
    "matches": ["tenx"],
    "content": "Why can't we just have the option of paying extra for the fee, instead of deducting from what you're buying?\n\nI'd rather pay 3.003 VEN for the 3 VEN I want instead of having 2.997 afterwards."
  }, {
    "score": 2,
    "matches": ["binance"],
    "content": "Or, you know, tell jackpots to go fuck themselves and let us convert small amounts of currency into BNB which is what should actually happen."
  }]
}, {
  "title": "Petition to Rename GDAX to \"Minor Service Outage\"",
  "score": 64,
  "comments": [{
    "score": 2,
    "matches": ["ark"],
    "content": "[The domain MinorServiceOutage.com is available!](https://www.namecheap.com/domains/registration/results.aspx?domain=minorserviceoutage.com)  \n  \nIf someone fronts me the ARK (or ETH), I'll buy it and set up a redirect to GDAX."
  }]
}, {
  "title": "ARK joins the one billion club!",
  "score": 464,
  "comments": [{
    "score": 36,
    "matches": ["ark"],
    "content": "Its good to see ark finally getting some attention it deserves. "
  }, {
    "score": 12,
    "matches": ["ark"],
    "content": "I'm glad to see things like ARK and ZRX surge"
  }, {
    "score": 20,
    "matches": ["ark"],
    "content": "I am biased, but I think this is well-deserved.  ARK remains one of the best projects in the crypto space."
  }, {
    "score": 5,
    "matches": ["ark"],
    "content": "Congrats Ark well deserved."
  }, {
    "score": 4,
    "matches": ["ark"],
    "content": "BARK FOR ARK"
  }, {
    "score": 20,
    "matches": ["icon", "ark"],
    "content": "Converted some of my ICX to ARK just a few minutes ago. to the moon bois"
  }, {
    "score": 4,
    "matches": ["tron", "ark"],
    "content": "Been with ARK for a while (back in the day when you actually researched a good coin). Glad it's finally moving as people start to wise up on the TRON coin types our there! "
  }, {
    "score": 3,
    "matches": ["ark"],
    "content": "Bought Ark in June, held until 3 days ago -> finally unloaded. You are welcome Ark community"
  }, {
    "score": 8,
    "matches": ["ark"],
    "content": "ARK TO THE MOON 2018!!!!"
  }, {
    "score": 2,
    "matches": ["ark"],
    "content": "ARK is easily one of the best projects in crypto based on tech alone. They are already on level fields with shit hyped crytpos that have much higher market caps.Speed/smart contracts/bridging ARK is doing it all, if I had to pick the next gen massive crusher(BTC,ETH) it is easily ARK."
  }]
}, {
  "title": "Lots of answers you’ve been waiting for were explained by VeChain CEO Sunny Lu's lecture\"Revolution Beyond Technology:The Benchmarking Application of VeChain Technology in Automobile Industry” as a guest lecturer for Silicon Valley Live's Blockchain Series.",
  "score": 1094,
  "comments": [{
    "score": 65,
    "matches": ["vechain"],
    "content": "Vechain has so much potential! Still not too late to invest and get passive income!"
  }, {
    "score": 109,
    "matches": ["vechain"],
    "content": "Vechain is going to be huge"
  }, {
    "score": 24,
    "matches": ["vechain"],
    "content": "VeChain is something i wanted to add to my portfolio it was hovering around the 1 dollar mark but was like yeah will but it on dips  \n\nworst decision in the past few months :("
  }, {
    "score": 2,
    "matches": ["vechain"],
    "content": "This is amazing. I have a much clearer picture now of the potential VeChain has. Combining IoT, Blockchain and AI is genius. I really don't understand the market cap is still so low. I do like the natural growth though. Keep up the good work VeChain!\n\nEDIT: typo"
  }]
}, {
  "title": "MRW I see all the red in my portfolio but I'm still up 85% all-time",
  "score": 275,
  "comments": []
}]