[{
  "title": "Daily General Discussion - January 2, 2018",
  "score": 88,
  "comments": [{
    "score": 34,
    "matches": ["neo"],
    "content": "NEO almost 3 digits, it's been a wild ride."
  }, {
    "score": 29,
    "matches": ["enigma"],
    "content": "Phenomenal growth in ENG in the last 24 hours. From 108th place to 71st on coin market cap."
  }, {
    "score": 22,
    "matches": ["ethereum"],
    "content": "I love ETH"
  }, {
    "score": 17,
    "matches": ["vechain"],
    "content": "VeChain partners with Healtcare Co Ltd:\n\nhttps://medium.com/@vechainofficial/vechain-partners-with-healthcare-co-ltd-84bba69c95fb"
  }, {
    "score": 17,
    "matches": ["binance"],
    "content": "I always beat 99% of users on binance login, what kind of bums are using this website lol"
  }, {
    "score": 16,
    "matches": ["request"],
    "content": "REQ dip, time to buy in"
  }, {
    "score": 16,
    "matches": ["vechain"],
    "content": "Vechain just announced another major partnership with Healtcare Co, a multiple billion dollar company which specialises in the reaserch and development for smart mattresses. Healthcare Co will use Vechains proof of authenticity and supply chain management which will result in 20 million RFID chips for 5 consecutive years. For the math magicians here, thats 100 million!\n\nIf u guys would like to read up on the developments:\nLINK: https://medium.com/@vechainofficial/vechain-partners-with-healthcare-co-ltd-84bba69c95fb"
  }, {
    "score": 32,
    "matches": ["request"],
    "content": "Gonna add a little more REQ to my portfolio before going to sleep. Seems like it’s in a tiny dip now. Here’s to hoping I’ll wake up to a surprise "
  }, {
    "score": 34,
    "matches": ["vechain"],
    "content": "VeChain just announced a new partnership on twitter while their CEO was doing a live AMA, marketing skills!"
  }, {
    "score": 28,
    "matches": ["achain"],
    "content": "1. Get about 5-10 different cryptos that you believe in and evenly distribute cash into all of them. \n\n2. Take a percentage off to actively swing trade with and alternate between daily lows and highs (for example use 25% of your portfolio worth)\n\n3. Directly follow latest information and sentiment and act accordingly. (Follow the reddit page, Twitter, website, sign up for alerts)\n\n4. Take time to learn chart analysis, even if it is just the fundamentals. It will increase your ability to predict the market and hone your decision making.\n\nThis strategy mitigates risk by diversifying and locking in a strong foundation for trusted coins and increasing your holdings by transferring value between them. \n\nDO YOUR RESEARCH. \n\nIf you truly believe in Blockchain then you are in it for the long game. Making $10,000 is cool and paying off your credit cards is great but if you cash out it is really hard to go back into Iota for $50 a pop when you bought it for 42 cents in November 2017.\n\nHappy new year to everyone in the community"
  }, {
    "score": 10,
    "matches": ["request"],
    "content": "Anybody recommends buying REQ right now?"
  }, {
    "score": 10,
    "matches": ["request"],
    "content": "I hope everyone refueled when REQ dipped below .70"
  }, {
    "score": 10,
    "matches": ["vechain"],
    "content": "I'll admit it... the VeChain shills have gotten to me. I hope there is a decent return for me relative to all the hype VEN has received. "
  }, {
    "score": 28,
    "matches": ["request"],
    "content": "I see REQ popping up here a ton lately and from what I've read into they have some high hopes. Can anyone tell me who their competition is in the crypto world? "
  }, {
    "score": 8,
    "matches": ["request"],
    "content": "Seems like a good chance to buy in @ REQ right now guys :)"
  }, {
    "score": 8,
    "matches": ["power"],
    "content": "Just in case, here's a VEN/Thor Power calculator: https://vechaininfo.surge.sh/calc/"
  }, {
    "score": 9,
    "matches": ["request"],
    "content": "Greater long term potential - REQ or VeChain?"
  }, {
    "score": 9,
    "matches": ["binance"],
    "content": "anybody having trouble logging in to binance right now? I keep getting errors."
  }, {
    "score": 17,
    "matches": ["ethereum"],
    "content": "Between ETH and XRB my portfolio briefly surpassed 6 digits yesterday! WOOOOO"
  }, {
    "score": 8,
    "matches": ["request"],
    "content": "So who wants to double down on REQ with me during this big time dip?"
  }, {
    "score": 8,
    "matches": ["request"],
    "content": "REQ having a little correction atm, might not be a bad time to pick up more"
  }, {
    "score": 74,
    "matches": ["ethereum", "neo"],
    "content": "I started dipping my toe into crypto six months ago starting with ETH and NEO but decided 2018 is time to dive in.  I’ve diversified recently with some altcoins and this sub has been so informative.  Can I please have some upvotes so I can post more?  Thanks!"
  }, {
    "score": 15,
    "matches": ["ethereum"],
    "content": "Wow BTC, BCH, and LTC all down 14%+ on the week, meanwhile ETH up 14% on the week. Things are looking solid for ETH"
  }, {
    "score": 15,
    "matches": ["vechain"],
    "content": "Vechain just announded a [new partnership](https://twitter.com/vechainofficial/status/948198134542360576)"
  }, {
    "score": 24,
    "matches": ["request"],
    "content": "Got in LTC at $350, BTC at $19,000, XRB at $38, and REQ at $0.88. Winning. "
  }, {
    "score": 8,
    "matches": ["stellar", "request"],
    "content": "Buys during the dip: \n\nXLM @ 0.48\n\nXRB @ 27.92\n\nREQ @ 0.66\n"
  }, {
    "score": 6,
    "matches": ["aion"],
    "content": "Better buy right now? I have narrowed my choices to:\n\nARK, VET/VEN, POE, ENG, or AION"
  }, {
    "score": 7,
    "matches": ["stellar", "request"],
    "content": "Bit of a noob and a noob question, but is there any advice for spotting a high potential coin 'early'?. I see people talk about getting into REQ and XLM when they were worth 0.003 etc and others about getting into surging coins before it starts to trend and spike. Is this just a numbers game and there's always going to be people who hit it 'lucky'/well researched with a coin or is there more to it? Currently on Binance, but this exchange seems to deal in the bigger coins, is there a good exchange that deals in smaller coins? Any insights would be great. "
  }, {
    "score": 6,
    "matches": ["enigma"],
    "content": "My big gainers for 2018: ARK, VET, ENG and XLM! Thoughts?"
  }, {
    "score": 7,
    "matches": ["omisego", "icon"],
    "content": "ICX and OMG looking real good "
  }, {
    "score": 6,
    "matches": ["tron", "icon"],
    "content": "2 coins that for me have enormous potential are TRX and ICX. The first because of the brains of Justin Sun and the solid rest of the team, combined with the growth potential and interest that nasdaq listed companies have in the application of TRX. ICX has a great team and an idea that could and will be implemented. The roadmap looks solid to me. I have combined these with XLM, SALT and just a little leftover Ripple. Futureproof?"
  }, {
    "score": 6,
    "matches": ["ethereum"],
    "content": "Great time to buy into alts with lower ratios now that ETH and BTC are seeing good gains today"
  }, {
    "score": 12,
    "matches": ["neo", "stellar", "icon", "request"],
    "content": "Tweaked my portfolio a bit today; finally pulled the trigger on XRB.\nWhat do you think?\n\nICX\t19%\n\nREQ\t19%\n\nVEN\t17%\n\nXLM\t16%\n\nXRB\t15%\n\nNEO\t14%\n"
  }, {
    "score": 3,
    "matches": ["stellar", "omisego", "binance", "tenx"],
    "content": "Dear Altcoiners,\nI want to start investing in Altcoins - perhaps you could be so kind and answer a few questions for me.\n\nSo, if I got that right, one way would be to\n* 1. Buy Bitcoin via Coinbase (using a small amount I can happily live without)\n* 2. Transfer Bitcoin to Binance and build a portfolio\n* 3. I want to spread my portfolio evenly with ENG, IOTA, ICX, REQ, OMG and XLM (is that too much? Should I focus on fewer altcoins?)\n\nOkay, now I have a nice portfolio and wait. But what happens then? When the coins go up, do I re-convert that into Bitcoin and re-invest into other coins? But if I get that \n\nright, Bitcoin is like the Altcoin-Baseline? So, if my portfolio rises by 100% but the Bitcoin price rises by 100%, too then I won't have gained anything, right? I still can \n\nonly buy the amount of Bitcoin I started with?! How can I turn my gains into actual profit then? \nOr would it be best to buy and hold them for a year - this way I don't have to pay any taxes (living in Germany).\nThanks for your help!"
  }, {
    "score": 5,
    "matches": ["stellar", "enigma"],
    "content": "Anyone feeling XLM and ENG ? "
  }, {
    "score": 5,
    "matches": ["ethereum"],
    "content": "Finally got me some XRB! Tried to buy it on the dip at $26 but buy the time my ETH transferred it was at $31. I’m alright with that though cause Reddit has me believing that there are still a lot more pumps to come \n\nLooking into **ICX and ENG** as my next investments. What are you guys eyeing for your next investment?"
  }, {
    "score": 6,
    "matches": ["ethereum"],
    "content": "$XLM has been killing it, already double my investment, wishing i had got in more. love seeing ETH doing great today"
  }, {
    "score": 5,
    "matches": ["tron"],
    "content": "trx destorying every sell wall in its sites"
  }, {
    "score": 4,
    "matches": ["tron", "request"],
    "content": "Thinking about selling half my TRX stake to get into REQ while its low?\n"
  }, {
    "score": 4,
    "matches": ["wabi"],
    "content": "which coins are you guys stocking up on\n\nI like WABI and VEN price right now"
  }, {
    "score": 5,
    "matches": ["enigma"],
    "content": "Hodling ENIGMA (ENG) to go over the 5 dollar mark in the next 24. 🔥"
  }, {
    "score": 5,
    "matches": ["stellar"],
    "content": "I bought into req, xlm and Ven. Any other recommendations?"
  }, {
    "score": 5,
    "matches": ["ripple"],
    "content": "Sold all my XRP and put it in REQ... hold me boys"
  }, {
    "score": 5,
    "matches": ["enigma"],
    "content": "ENG is enticing right now. Thinking about jumping aboard! Thoughts ? \n\nNeed Karma:) "
  }, {
    "score": 5,
    "matches": ["enigma"],
    "content": "Enigma (ENG) up to $4.86, gonna hit $5.00 before 5 p.m. 🔥🔥🔥\n\n(pacific time) 😁"
  }, {
    "score": 9,
    "matches": ["vechain"],
    "content": "4 posts about VeChain on the frontpage and the sell walls still wont come down"
  }, {
    "score": 11,
    "matches": ["vechain"],
    "content": "What's everyone's picks for the next coins to jump?  My picks are BNTY, ELIX, PRL, CRED, HST, SALT and I think VET has a ton to grow as well"
  }, {
    "score": 8,
    "matches": ["ripple"],
    "content": "Ripple (XRP) and its Billionaires - Forbes article > https://www.forbes.com/sites/laurashin/2018/01/02/meet-the-crypto-billionaires-getting-rich-from-ripples-xrp/#4727af1f3289"
  }, {
    "score": 8,
    "matches": ["request"],
    "content": "Time to buy more REQ <3 <3"
  }, {
    "score": 4,
    "matches": ["stellar", "enigma"],
    "content": "Long on REQ, XLM & XRP. YOLO on TRX. \n\nWatchlist ADA, ENG"
  }, {
    "score": 4,
    "matches": ["request"],
    "content": "My parents want to invest in crypto, but won't be capable of doing themselves. \n\nI'm happy to do it for them as part of my portfolio but don't want to get into multiple wallets etc., I'd like to keep it as simple as possible. \n\nIs it as simple as keeping track of the percentage of the portfolio invested by each party? i.e they invest 5% of the full amount, so they can request that I sell their 5% at any time? \n\nAnd if I put more fiat into crypto, we just re-adjust the %ages accordingly? \n\nPresumably it wouldn't count towards capital gains tax if it just passes through my bank account? \n\nAnything else I need to look out for? \n\n(they understand the risks and it's money they can lose etc.)"
  }, {
    "score": 5,
    "matches": ["stellar"],
    "content": "What's everyone's opinions on FUN? I think the idea behind Funfair is pretty innovative, but people seem to think the same thing could be done with Stellar Lumens or Ethereum.\n\nCommercial and technical whitepapers here: \nhttps://funfair.io/explore/whitepapers/"
  }, {
    "score": 3,
    "matches": ["stellar", "binance", "enigma", "request"],
    "content": "Would like to contribute as I'm looking to diversify (so a few upvotes would be great). Looking at BNTY, SALT, XLM, LINK, REQ, XRB, IOTA & ENG at present. I don't believe that they 'fight' each other too much, bar perhaps XRB and IOTA unless I've misunderstood XRB. \n\nREQ (20%)\nXRB (20%)\nIOTA (15%) \nXLM (15%)\nLINK (10%)\nENG (10%)\nBNTY (5%) \nSALT (5%)\n\nWould welcome any advice or criticism. \n\nAlso does anyone have Kucoin or Binance invite code? Figure I can help somewhere here by signing up with one."
  }, {
    "score": 4,
    "matches": ["cardano", "stellar"],
    "content": "Am I missing something cardano just have a wallet and is trading at higher market cap compared to more progressed cryptos? Such as NEO, IOTA, Lisk, ARK, XLM and XMR. Whats with the hype?"
  }, {
    "score": 4,
    "matches": ["ethereum"],
    "content": "Shill me on XYB. The love child of Ethereum and Raiblocks?"
  }, {
    "score": 4,
    "matches": ["request"],
    "content": "Looking to invest some money right now, should I go for ICX, REQ or ENG? (Or other suggestions)"
  }, {
    "score": 4,
    "matches": ["ripple", "stellar"],
    "content": "is there a realistic valuation on XLM for the future? can it overtake XRP or would it likely stay in line with it? i know circulating supply is about half of ripple..can XLM reach $2+ in very near future or is that simply unrealistic since ripple itself is at $2 currently"
  }, {
    "score": 5,
    "matches": ["ethereum", "icon", "enigma", "request"],
    "content": "trading ETH for...\n\nENG\nREQ\nICX\n\nwhat do you think?"
  }, {
    "score": 4,
    "matches": ["ethereum"],
    "content": "Volume has picked up $1.5bn for Ethereum in the past 14 hours alone. This could be it gentleman."
  }, {
    "score": 4,
    "matches": ["binance"],
    "content": "@Binance guys:\nsomeone posted this:\n\nAs told by the binance support \"Bear with us for a moment. There are no security issues. Our servers are being upgraded and normal functionality should be restored shortly.\""
  }, {
    "score": 3,
    "matches": ["stellar"],
    "content": "For anyone that hasn't heard by now, FairX (decentralized exchange powered by IBM) will be launching very early Q1 and will be using XLM as it's central currency for pairings. "
  }, {
    "score": 4,
    "matches": ["neo", "vechain", "walton", "request"],
    "content": "Took this dip period as an opportunity to increase my position in REQ and XLM. Holding REQ, XLM, XRB, VET for now. Want to get some NEO and WTC when possible! "
  }, {
    "score": 4,
    "matches": ["icon", "ark", "enigma", "request"],
    "content": "Invested in :\n\nREQ \nICX\nENG\nARK\nMOD\n\nThoughts? Thinking ark is my weakest link though"
  }, {
    "score": 4,
    "matches": ["aion"],
    "content": "Check AION getting big coorporation very soon"
  }, {
    "score": 10,
    "matches": ["request"],
    "content": "I know we are all on the same side ultimately and want crypto to grow. But it kind of delights me that XVG is not recovering. I hope the folks hodling those bags find solace in other coins like Req and ICX."
  }, {
    "score": 9,
    "matches": ["enigma"],
    "content": "Is ENG exploding or is it just an impression? Pretty damn good beginning of year "
  }, {
    "score": 11,
    "matches": ["enigma"],
    "content": "RIP to anybody waiting for the ENG dip\n\nFuck I wanted to buy more!"
  }, {
    "score": 5,
    "matches": ["vechain"],
    "content": "VeChain AMA starting in 30mins!\n\nr/vechain"
  }, {
    "score": 8,
    "matches": ["tron"],
    "content": "Trx to 10 cents today!!!"
  }, {
    "score": 8,
    "matches": ["walton"],
    "content": "Does WTC seem ready to break out? I feel like with all the other alts running up it's definitely undervalued."
  }, {
    "score": 7,
    "matches": ["tron"],
    "content": "I reckon I should just tell everyone what I'm doing so they can do the opposite and get rich. Sold all my TRX for XRB last night."
  }, {
    "score": 6,
    "matches": ["ethereum"],
    "content": "Currently sitting in the sauna waiting for some ETH to go through so I can buy some more VeChain. Definitely recommend doing if you want that extra level of drama. "
  }, {
    "score": 3,
    "matches": ["enigma"],
    "content": "Would you go with SpectreCoin or Enigma at this point (talking short term)? Both are growing fast right now."
  }, {
    "score": 3,
    "matches": ["ethereum"],
    "content": "Finally ethereum and litecoin started going up"
  }, {
    "score": 3,
    "matches": ["ripple"],
    "content": "So I'm thinking of selling off my Ripple when the time is right for XLM. I just kind of have a hunch for it with IBM. Can I get some decent educated advice on why this may or may not be wise?"
  }, {
    "score": 3,
    "matches": ["ethereum"],
    "content": "Would like to get into XRB during this dip. Do I need any verification to buy XRB using ETH on BitGrail? TIA"
  }, {
    "score": 3,
    "matches": ["enigma"],
    "content": "What's reason for the sudden increase in ENG price?"
  }, {
    "score": 3,
    "matches": ["neo", "wabi"],
    "content": "Thinking about pulling out of WaBi for some Neo or perhaps stick it for the long haul and buy TRX. Thoughts?"
  }, {
    "score": 3,
    "matches": ["icon", "enigma", "request"],
    "content": "Portfolio looking like this after the REQ pump: 50% REQ, 40% ICX and 10% LINK, now I want to take some of my REQ profits and put into other coins, thinking about more ICX in anticipation for mainnet launch and some Enigma what do you think? "
  }, {
    "score": 3,
    "matches": ["neo"],
    "content": "Wahey, just realised that you get GAS from NEO on Binance. Free money is free money even if it is small right now."
  }, {
    "score": 3,
    "matches": ["stellar"],
    "content": "So I've been reading about Stellar - apart from the increase in value, why would any crypto enthusiast like it exactly?\n\nThe first thing that comes to mind is [this](https://imgur.com/qzJdqXy), i.e, bank regulated and controlled crypto... Do I like banks now?"
  }, {
    "score": 3,
    "matches": ["icon"],
    "content": "Do you guys think I should wait for ICX dip? Or buy now?"
  }, {
    "score": 3,
    "matches": ["stellar", "omisego", "vechain", "power"],
    "content": "The last couple of days I´m doing a lot of thinking about my Portfolio for 2018. I´m about to put more money in it, which would actually be quite a large sum for me (don´t worry no loans and my life aint over if I should lose it all). Thats what I came up with:\n\nVEN = 33% (Due to the Vechain Thor Power accouncment I want to make it my biggest chunk)\n\nICX, ENG, ETH, REQ, IOTA, XRB, OMG (or XLM) = Sharing equally 50% (I see these as long time HODLS and steady gainer for 2018)\n\nSUB, BNTY, LEND, PRL, HST, DBC = Sharing equally 17% (Hoping for Moonshots due to low market cap and interesting projects)\n\nI´m more than happy for every thought regarding improvment or overall comments and ideas. Furthermore I´m yet undecided if I should include OMG or XLM in the 50% bunch. Or maybe even both?\nThanks to everyone helping out a fellow hodler."
  }, {
    "score": 3,
    "matches": ["stratis"],
    "content": "Recently bought some STRAT and SYS in Bittrex, already ~14 and 9% up. Any thoughts on those two?"
  }, {
    "score": 3,
    "matches": ["binance"],
    "content": "I think an exchange coin could become a top 10 coin in 2018. BnB doing what it did and now KCS. Also reading about a few other competitors. They give huge incentives to not use other exchanges. This will also do a great job of crippling BTC as a hedge and trading pair."
  }, {
    "score": 3,
    "matches": ["neo"],
    "content": "NEO to hit $100 today, as in UK today.\n\n11 hours to get there, let's go!!"
  }, {
    "score": 3,
    "matches": ["ethereum"],
    "content": "Noob question - ETH buying transaction on coinbase has been pending for about 18 hours now. What do I do?"
  }, {
    "score": 3,
    "matches": ["enigma", "request"],
    "content": "Do we think ENG is done for a couple days? Considering transferring these gains into some REQ while it dips."
  }, {
    "score": 3,
    "matches": ["neo"],
    "content": "I'm holding NEO til I die"
  }, {
    "score": 3,
    "matches": ["neo", "icon", "request"],
    "content": "32% REQ\n\n30% VEN\n\n19% ICX\n\n11% NEO\n\n8% FIAT\n\n\nUnsure what to buy for the fiat. Stack up one of the 4 coins above. Or just go for a daily hype to push this 8%. Not going to play safe so it can be any shitcoin. \nAny ideas?\n"
  }, {
    "score": 3,
    "matches": ["tron"],
    "content": "TRX mooning"
  }, {
    "score": 3,
    "matches": ["icon", "vechain", "request"],
    "content": "60% Bread (brd)\n\n16% VeChain (ven)\n\n12% Icon (icx)\n\n12% Request (req)\n\n_____\n\nIm looking into diversifying my portfolio alot more, How diversified is diversified enough?"
  }, {
    "score": 3,
    "matches": ["request"],
    "content": "Is there a wallet that will hold both REQ and XLM?"
  }, {
    "score": 3,
    "matches": ["icon"],
    "content": "ICX just hit $7 Looks like it might be another good day :)"
  }, {
    "score": 3,
    "matches": ["icon", "request"],
    "content": "Wish I carried through with my REQ -> ICX swing earlier today, oh well no sense in selling now, guess I'll just hodl both! "
  }, {
    "score": 3,
    "matches": ["ethereum"],
    "content": "So if I wanna buy Raiblocks, what is the best way to do that? Do I buy ETH or BTC from Coinbase and then just transfer it to BitGrail?"
  }, {
    "score": 3,
    "matches": ["icon", "enigma"],
    "content": "Would you guys suggest buying into ENG or ICX right now?"
  }, {
    "score": 3,
    "matches": ["ripple", "cardano", "stellar", "request"],
    "content": "Hey everyone!\n\nSome of you like to downvote my comments, but those of you that have used similar investment strategies over the last 2 weeks have seen an excellent ROI!\n\nWeek 1 - XRP @ 0.73 and IOTA @ 2.89\n\nWeek 2 - ADA @ 0.42\n\nThis week I am looking into a couple options. XLM if it falls more, haven't decided yet, XRB for sure whenever it dips, would be a good time to get in, and REQ (been high on REQ for a while, just hadn't posted about it, good coin to get on during a dip)"
  }, {
    "score": 3,
    "matches": ["ethereum", "ripple", "cardano", "neo", "enigma", "request"],
    "content": "If anyone is in the discord server they may be aware how bullish I am on ETH and how undervalued I currently think it is. I mostly just swing trade based on 1D EMA crossings and it's done be quite well. Just wanted to share my portfolio as I'm new to altcoins and have really only been in BTC and ETH for the passed few years. \n\n38% ETH (avg price 430$)\n24.5% NEO (avg price 71$)\n7.1% REQ (avg price 15.8$)\n6.5% ENG (avg price 2.99)\n4.8% ADA (abg price .45$)\n2.4% XRP (avg price .25)\n\nRipples my biggest regret. I bought a five figure amount around .25 as a long term holding and decided when it spiked to .75 that it went up too fast and I tried to catch a top. So I'm barely holding any right now. \n\nWhat I'm looking to add to my portfolio in 2018 is FUN (I have an online poker background) XLM, and more XRP at good prices. "
  }, {
    "score": 3,
    "matches": ["binance"],
    "content": "I know this is really dumb to ask, but is there anyway I could transfer BTC to eth? Like on binance if I have like $500 BTC, could I convert that to ETH?"
  }, {
    "score": 3,
    "matches": ["ethereum"],
    "content": "Is Ethereum worth investing? I'm new to cryptocurrency(currently pumping the btc but it is slow) and thinking about the ETH. Are there any smartphone apps for Ethereum?"
  }, {
    "score": 3,
    "matches": ["request"],
    "content": "Birdmanhands.gif \n\nTime to strengthen those positions. I'm getting more req"
  }, {
    "score": 3,
    "matches": ["ethereum"],
    "content": "I have a stupid noob question. So when ETH increases in value, then I should I expect whatever coin is paired with it on an exchange listing to go down in value, right? Like if the pair is XCoin/ETH, and XCoin stays the same value in USD, but ETH goes up in USD, then the price in the XCoin/ETH pair has to go down, correct?"
  }, {
    "score": 3,
    "matches": ["vechain"],
    "content": "Hold Vechain (VEN) or invest in WaBi?"
  }, {
    "score": 3,
    "matches": ["ethereum", "binance", "request"],
    "content": "Bought REQ at .67 with ETH on Binance about 10 min ago and for some reason it's still saying I have the same amount of ETH as before in my portfolio but if i go to trade i have significantly less. Anyone know if its a lag error? never taken more than like 1 minute for me to receive the trade"
  }, {
    "score": 3,
    "matches": ["ripple", "stellar", "tron", "icon", "request"],
    "content": "Should have listened to you guys about Rai.. now I'm sitting here without any. My portfolio is like 41% icx 16% req 13% xlm 13% xrp 9% xby and 3% each of TRX and neo... No money to invest for a few weeks. Would it be smart to dump half my icx for Rai?"
  }, {
    "score": 3,
    "matches": ["stellar"],
    "content": "Should I switch 25% of my XLM for VEN while VEN is still at this point? XLM percentage of folio is about 45%."
  }, {
    "score": 3,
    "matches": ["omisego", "request"],
    "content": "Thoughts on this portfolio? Total value is about 2x what I put in in summer last year so it's already done pretty well. ETH, OMG and REQ are my long term hodls, everything else is mid term, and BNTY is my short/mid long shot.\n\nLooks ok? I'm wondering if there's too much ETH, although it definitely looks the most stable right now\n\nhttps://cointrackr.com/s/dmFfTI3WNGh2d"
  }, {
    "score": 3,
    "matches": ["binance"],
    "content": "Someone please shill me an undiscovered promising coin with a low market cap (only if it’s on binance please). Thanks in advance guys!"
  }, {
    "score": 7,
    "matches": ["request"],
    "content": "Last discounted REQ before take off!\n"
  }, {
    "score": 5,
    "matches": ["ethereum"],
    "content": "How do you decide on which alts to sell off some of their percentage profit so you can invest in other coins? Do you go with the ones that have the highest percentage profit? Do you trade that with ETH to buy more or is their a bette coin, always used ETH to buy them so surely it is the best choice. Help needed "
  }, {
    "score": 5,
    "matches": ["request"],
    "content": "Looks like the REQ dip is over. For anyone wanting to get in, now is the time"
  }, {
    "score": 6,
    "matches": ["request"],
    "content": "Agreed. Req is in a very strategic position for new comers to have their bags full at this very moment. "
  }, {
    "score": 4,
    "matches": ["vechain"],
    "content": "Is the fact that VeChain carries no whitepaper worrisome? I'm cautious to fully back this project, although the Chinese providential contract with city of Gui'an has me convinced this is a [serious project](https://www.reddit.com/r/Vechain/comments/7klb4z/info_on_guian_new_area/). \n\nAlso how are these nodes able to provide residual income? The AMA tomorrow should hopefully answer some of these questions."
  }, {
    "score": 4,
    "matches": ["icon"],
    "content": "ICX or FUN?"
  }, {
    "score": 5,
    "matches": ["tron"],
    "content": "About time TRX had a little push. "
  }, {
    "score": 4,
    "matches": ["ripple"],
    "content": "A question that's troubling me since morning: if ripple says xrp is locked away and won't be released how can one of the founding members own 17% of it (he owns 17B xrp) Here is the link. The ex CEO Chris Larsen's net worth is $37B , due to his ownership in xrp, making him the 14th richest individual. https://www.forbes.com/sites/laurashin/2018/01/02/meet-the-crypto-billionaires-getting-rich-from-ripples-xrp/amp/"
  }]
}, {
  "title": "Announcing the official r/CryptoCurrency Discord Server!",
  "score": 219,
  "comments": []
}, {
  "title": "What I think I look like explaining crypto to my friends",
  "score": 8110,
  "comments": [{
    "score": 12,
    "matches": ["ethereum"],
    "content": "All I care about rn is that Ethereum is poppin rn. "
  }]
}, {
  "title": "Ark coin no longer has transaction fees thanks to the biz_network.",
  "score": 598,
  "comments": [{
    "score": 109,
    "matches": ["power"],
    "content": "That's a pretty incredible example of how delegates can fight their way, democratically, into the top 51.  This is why DPOS is the best system right now.\n\nFor those who didn't read, you're limited to 10 refunds a day - but this is pretty tremendous overall.\n\n8 second transfers - Refunded Transactions - Push Button Blockchain around the corner - Everyone gets staking (think mining) rewards without power usage.\n\nTo say I'm bullish is an understatement.  150 dollars/ARK by Dec 2018.  And that's me aiming low.\n\n>Any transaction you make will be in a biz_network block, and for normal transactions, your fee will be refunded to your pending balance within 24 hours. The only limitation we are imposing is a 10 transaction daily refund limit per account to fight potential spam. New votes for biz_network will also be refunded and do not count towards the 10 transaction limit."
  }, {
    "score": 19,
    "matches": ["ark"],
    "content": "I'm sure other nodes will need to adopt the code to compete with biz_network, else they will lose all their votes. This benefits all ARK holders but does significantly reduce the network incentive as a delegate.\n\nI'm interested in seeing how this plays out."
  }, {
    "score": 15,
    "matches": ["ark"],
    "content": "~~So one of the delegates is paying for their voters' fees limited at 10 free transactions per day?~~\n\nI don't see how this is either sustainable or beneficial to Ark as a whole and I currently hold Ark.\n\n~~Someone else paying your fees != fee-less.~~\n\nEdit: It seems the 10 transaction limit is only for refunds of fees. Once a sufficiently large malicious actor decides to spam this node it will become unusable. Traditional blockchains have transaction fees as a necessity guys."
  }, {
    "score": 6,
    "matches": ["ark"],
    "content": "This is amazing news. Is funny how they're bunch of comments in 4chan claiming to get onboard on Ark before it's too late but Ark has been having a healthy growth and incredible development rate compared to others crypto just the first time I heard about Ark was a few months ago and it was in the range of $1 - $2.4 USD now its worth $7 USD. Its just amazing what can be done when developers are responsible, great PR, and have an amazing community behind supporting it."
  }, {
    "score": 66,
    "matches": ["ark"],
    "content": "Is this real!? So basically that makes ARK on par with xrb both in speed and fees, while offering a ton of more features at the same time... how this coin is not top ten yet is beyond me"
  }, {
    "score": 11,
    "matches": ["ark"],
    "content": "Great news! ARK will do awesome in 2018."
  }, {
    "score": 9,
    "matches": ["ark"],
    "content": "I’ve been hodling some ARK but now I put a bit more in before it goes to the moon. "
  }, {
    "score": 11,
    "matches": ["ark"],
    "content": "This will surely spread to other delegates as well. Fees are a thing of the past on the Ark network!"
  }, {
    "score": 3,
    "matches": ["ark"],
    "content": "Very promising and exciting step for Ark"
  }, {
    "score": 2,
    "matches": ["ark"],
    "content": "How does ARK now compare to XRB?"
  }]
}, {
  "title": "Reddit's altcoin logic summed up perfectly.",
  "score": 717,
  "comments": [{
    "score": 12,
    "matches": ["tenx"],
    "content": "I am McRupis and I enjoy having young Costa Rican girls take dumps on my chest. I am officially making *#Shitcoin* my coin of the day. Well, I will once you pay me 25BTC"
  }]
}, {
  "title": "VeChain Partners With Healthcare Co. Ltd – VeChain Foundation – Medium",
  "score": 710,
  "comments": [{
    "score": 121,
    "matches": ["vechain"],
    "content": "It's funny how this is pretty much expected for Vechain but for basically anyone else, it would be really major news."
  }, {
    "score": 23,
    "matches": ["vechain"],
    "content": "Damn so big..! Vechain is probably my comfiest hold for this year. Unbelievable. "
  }, {
    "score": 15,
    "matches": ["neo"],
    "content": "Holy fucking shit.\n\nSo glad I am in on VeChain.\n\nMaybe it's just my friends, but it seems like westerners might be sleeping on this one big time. I feel like this is be take off similar to how NEO did, especially considering the new 2 coin system."
  }, {
    "score": 9,
    "matches": ["walton"],
    "content": "As someone who is strapped for $$ right now... and a holder of WTC I can't but help be a little jealous. Really like VEN. They are dropping partnerships left and right.. good for you holders. "
  }, {
    "score": 8,
    "matches": ["vechain"],
    "content": "Yup, Vechain is looking like an incredible investment. I wish I could invest to become a strength node."
  }, {
    "score": 6,
    "matches": ["binance"],
    "content": "This Binance competition is actually holding the price down. "
  }, {
    "score": 10,
    "matches": ["vechain"],
    "content": "Gotta love how the price isn't moving an inch. Classic VeChain response lol\n\nJokes aside, great news. I only hodl a relatively small stack, but that alone feels very comfy."
  }, {
    "score": 5,
    "matches": ["vechain"],
    "content": "Vechain is a coin I spotted at $1.20 and is they are going to be one of the top coins in this 2018."
  }, {
    "score": 4,
    "matches": ["vechain"],
    "content": "Is VeChain going to Bittrex is 2 days?"
  }, {
    "score": 4,
    "matches": ["vechain"],
    "content": "Ok I'm sold. But I like counterpoints. What's the bear case for VeChain apart from their ... special design/branding around space & nordic deities ? Are their customers paying already ? "
  }, {
    "score": 2,
    "matches": ["tenx"],
    "content": "Is this the first true deal in blockchain? This isn’t a true partnership as much as it is “let me pay to use your platform”."
  }]
}, {
  "title": "\"Yes, there is a bug in the $XRB node software. No, it is not a serious one. It's a very rare bug that only happens with high transaction volumes and there is a very simple solution.\"",
  "score": 410,
  "comments": []
}, {
  "title": "How the passage of time feels in Crypto:",
  "score": 503,
  "comments": []
}, {
  "title": "ETH has passed $900 and has retaken the #2 market cap spot from XRP",
  "score": 5669,
  "comments": [{
    "score": 528,
    "matches": ["ethereum"],
    "content": "Ethereum has been stable for so long I forgot I even hold it."
  }, {
    "score": 585,
    "matches": ["ethereum"],
    "content": "Revolution day is when Ethereum overtakes Bitcoin for the top spot."
  }, {
    "score": 244,
    "matches": ["ripple"],
    "content": "As someone who owns both ripple and ethereum, I like this battle."
  }, {
    "score": 65,
    "matches": ["ethereum"],
    "content": "As someone who is bullish on ethereum glad to see it blasting off again!! "
  }, {
    "score": 161,
    "matches": ["ethereum"],
    "content": "It’s probably people buying ethereum so they can exchange for all the other alt coins "
  }, {
    "score": 42,
    "matches": ["ripple"],
    "content": "Last week when Ripple became #2: \"Market cap means nothing\" and \"Meh, XRP only took second place for a few minutes\". \n\n\nToday: \"ETH has retaken #2, woohoo!\"\n\nAll I'm seeing is that Ripple is still #2 today."
  }, {
    "score": 128,
    "matches": ["ripple"],
    "content": "Lol annnnnnd it's gone.\nXrp back on top"
  }, {
    "score": 63,
    "matches": ["ripple"],
    "content": "Ripple managed to hold #2 spot for a while without the support of coinbase. What would happen if/when coinbase decides to support xrp?"
  }, {
    "score": 15,
    "matches": ["ethereum", "ripple"],
    "content": "The ETH is third again.\n\n\n\n- Ripple\t€72,680,251,669\n\n- Ethereum\t€70,430,866,655\n\n"
  }, {
    "score": 15,
    "matches": ["ethereum", "ripple"],
    "content": "As someone who invested more money into XRP than ETH, that's great news. Not because I care about rankings, but because it means crypto is recovering. XRP was doing well, it hasn't crashed, so ETH is growing under its own power. Hopefully the market as a whole will be solidly back in the green soon. "
  }, {
    "score": 632,
    "matches": ["ripple"],
    "content": "I'm a simple man.\n\nI see Ripple falling, I upvote."
  }, {
    "score": 46,
    "matches": ["ethereum"],
    "content": "People were just buying ETH to buy more Ripple. "
  }, {
    "score": 58,
    "matches": ["ripple"],
    "content": "I'm not even sure how Ripple became a contender to Ether in terms of market cap.  It is like comparing a single-use flip-phone to a smart phone.  Not even in the same league."
  }, {
    "score": 16,
    "matches": ["ripple"],
    "content": "It's funny how stats like these get old in a matter of hours. XRP is back again at #2. And it's only been 2 hours since your post."
  }, {
    "score": 5,
    "matches": ["ethereum", "ripple"],
    "content": "I knew I should’ve bought Ethereum at $710, I’m loving this fight for market share between Ripple and Ethereum as well."
  }, {
    "score": 4,
    "matches": ["ethereum", "ripple"],
    "content": "xrp - 87\n\neth - 84"
  }, {
    "score": 3,
    "matches": ["ripple"],
    "content": "Best is yet to come for Ripple\nhttp://www.financeminutes.com/ripple-price-forecast-2018-xrpusd-rally/"
  }, {
    "score": 5,
    "matches": ["ethereum"],
    "content": "YES ETH need to take 1 hopefully this year "
  }, {
    "score": 4,
    "matches": ["ripple"],
    "content": " For every two independent validating nodes a Ripple node is removed until they are all gone making XRP more decentralized then Bitcoin by the end of 2018."
  }, {
    "score": 24,
    "matches": ["ethereum"],
    "content": "papa eth telling that centralized POS to stay in its place\n\n"
  }, {
    "score": 2,
    "matches": ["ripple"],
    "content": "Soca coin that has been around for years is fighting to take the second spot from a new coin?  Please someone call Ripple a shit coin again. "
  }, {
    "score": 2,
    "matches": ["ethereum", "ripple"],
    "content": "Looking into buying small amounts of crypto. What exchanges/wallets should I use?\n\nBuying into:\n\nEth\nRipple\nIOTA\nLitecoin\n\nI'm a nub to crypto and would like some opinions"
  }, {
    "score": 6,
    "matches": ["ethereum"],
    "content": "ethereum so promising its not even funny"
  }, {
    "score": 5,
    "matches": ["ethereum"],
    "content": "281 comments and not one mention of LEEK? LEEK/ETH (Coinbene) has 10.66% of ETH's total trading volume right now and is well ahead of the second highest volume market of BTC/ETH (Binance) at 6.92%.\n\nThat a shitload of ETH trading for a currency I've never heard of on a market I've never heard of."
  }, {
    "score": 11,
    "matches": ["ripple"],
    "content": "Long live ETH, XRP is an imposter. "
  }, {
    "score": 2,
    "matches": ["ethereum"],
    "content": "And here I was looking for a way to get funds into Quadriga to buy some ETH and Alt coins and it has jumped 22%... story of my life..."
  }, {
    "score": 2,
    "matches": ["ripple"],
    "content": "12hrs later XRP regains #2 by $10B. Welcome to the insanity"
  }]
}, {
  "title": "A quick example of Ark's speed",
  "score": 616,
  "comments": [{
    "score": 85,
    "matches": ["ark"],
    "content": "ARK has a lot of potential. What’s great is that transaction speed is really just a small fraction of what ARK aims to do. If ARK is going to be shilled, the discussion needs to be around Push-button Deployable Blockchains, SmartBridge, VM, Core V2, etc. etc.\n\nThe technology and the team behind this project only continue to impress me more and more over time. Not to mention, they also listen to the community.\n\nI see nothing but wins all around long-term. "
  }, {
    "score": 27,
    "matches": ["ark", "tenx"],
    "content": "Certain delegates offer free transactions. \n\nThey do this because The fee you pay goes to a delegate to process your transaction. Delegates like biz_classic are simply having their voter’s transactions go through their node, taking the fee to process, then giving it right back. Ark protocol does this to incentivize the delegates but biz is clearly fine with giving it back to their users. So that’s pretty cool. Each delegate is different though. And hopefully with core v2 the delegates will have an option to make fees dynamic. They will be dramatically reduced if not. "
  }, {
    "score": 53,
    "matches": ["ark"],
    "content": "Yeah ARK's transactions are really fast and they are only gonna get faster when ARK Core V2 gets released. Going to be interesting to see the difference."
  }, {
    "score": 25,
    "matches": ["ethereum"],
    "content": "Did we forget that Ethereum had 10 sec transactions just two months ago?"
  }, {
    "score": 11,
    "matches": ["ark"],
    "content": "Off topic but i still can't believe how slick both those wallets look. Ark is definitely a leader in wallets."
  }, {
    "score": 61,
    "matches": ["ark"],
    "content": "Concerning the fee, ARK v2 will greatly improve the way fees operate. Here is a run down of how dynamic fees will work from Jarunik, a community delegate. https://i.imgur.com/Ppe3leU.png"
  }, {
    "score": 7,
    "matches": ["ark"],
    "content": "Ark is one of the sleeping giants out there but is having a healthy grow which is good for the coin."
  }, {
    "score": 13,
    "matches": ["ark"],
    "content": "Like I said in the subreddit. It's a bit insane how Ark has great tech, great devs, a great roadmap yet they seem completely unable to show their intrinsic value.\n\nThanks a lot for this. It's simple yet very intuitive. \n\nAlthough at top40, this is still a hidden gem."
  }, {
    "score": 3,
    "matches": ["ark"],
    "content": "Would expect no less! People are often skeptical if ARK can actually achieve everything they are trying to accomplish (Payment system, ICO/dapp platform, smart bridges, point of sale integration, push button blockchain, Ark VM,  RFID and IOT device integration, etc... on and on) but they are kicking ass getting this stuff out, and EVERYTHING ARK has done so far has been top notch!! I have full confidence in the team and know they will continue to deliver...Love me some ARK!!!"
  }, {
    "score": 8,
    "matches": ["ark"],
    "content": "Ark is going to be big."
  }, {
    "score": 9,
    "matches": ["ark"],
    "content": "Ark ftw!"
  }, {
    "score": 24,
    "matches": ["ark"],
    "content": "As posted on r/ArkEcosystem, the difference between Raiblocks and Ark is that what you see here, is a transaction fully included in the blockchain and propagated. In Raiblocks it actually takes a few more seconds up to minutes before it is truly incorporated."
  }, {
    "score": 2,
    "matches": ["ark"],
    "content": "Ark is great. The wallet is the best wallet out there. Progress is slow, but Whats there is awesome. "
  }, {
    "score": 2,
    "matches": ["ethereum"],
    "content": "When eth moves to POS, you will see the same blocktimes"
  }]
}, {
  "title": "VeChain to Become an Integrated Ecosystem and Platform for ICOs and DAPPs!",
  "score": 379,
  "comments": [{
    "score": 36,
    "matches": ["walton"],
    "content": "I was pretty impressed with the ama from the ceo. I was always in on walton and did not consider ven to be as good but I am starting to believe they are closer than I thought."
  }, {
    "score": 11,
    "matches": ["ethereum", "vechain"],
    "content": "VeChain = Apple\n\nEthereum = Android\n"
  }]
}, {
  "title": "BOSCH's industrial IoT division is likely going to have an AMA on IOTA subreddit.",
  "score": 104,
  "comments": []
}, {
  "title": "After a $230 billion dip in December, the total market cap is now at an all-time high of $650 billion! Bitcoin dominance down to an all-time low of 36%.",
  "score": 358,
  "comments": []
}, {
  "title": "Dear Kraken, just change your homepage to THIS and save us all the trouble. Sincerely, everybody on the planet.",
  "score": 174,
  "comments": []
}, {
  "title": "The Stellar coin has some of the Whose Who of Silicon Valley on their team. Definitely undervalued @ only $.48 cents.",
  "score": 979,
  "comments": [{
    "score": 62,
    "matches": ["stellar"],
    "content": "This is a bit misleading in my opinion. McCaleb is the only one on your image that actually works on this project on a daily basis. Rabois is a board member.\n\nThe rest are advisors. From my research in crypto, this usually just means their names are attached and they don't have meaningful contributions to the project. Maybe Stellar is different, but you probably should specify their titles because I definitely would not say these advisors are part of the proper team.\n\nhttps://www.stellar.org/about/"
  }, {
    "score": 11,
    "matches": ["ripple", "stellar"],
    "content": "The price of a coin doesn't matter, only the market cap\n\nEdit: Guys listen, individual coin price tells you nothing on its own. There are 16M bitcoin and 17,000M Stellar. If there were only 16M Stellar coins, each one would be worth ~$480.\n\nStellar is already the 9th largest cryptocurrency. It's only ~32x cheaper than bitcoin and ~10x cheaper than XRP and ETH. \"Only 48 cents\" is misleading."
  }, {
    "score": 32,
    "matches": ["ripple", "stellar"],
    "content": "Didn't anyone here educate himself about [Jed McCaleb, Ripple and Stellar](http://observer.com/2015/02/the-race-to-replace-bitcoin/)?\n\nIt's a long but interesting read. Anyone thinking about investing in Stellar or Ripple should give this a read. "
  }, {
    "score": 4,
    "matches": ["stellar"],
    "content": "Honestly do believe XLM will the the first smaller coin to have a big breakout in 2018. If fairx.io does what it says it will using Stellar, essentially a much better version of coinbase, it will send the price way up. "
  }, {
    "score": 3,
    "matches": ["stellar"],
    "content": "I'm just a bad day trader. I had XLM when it was 0.05 and sold it with profit a while ago. My question, is it still profitable to invest in XLM today when the price is around 0.5$?"
  }, {
    "score": 12,
    "matches": ["ripple"],
    "content": "Also good to note that besides Ripple & MtGox, Jed McCaleb is also the founder of uDonkey, the guy is old-school. Also worth noting all the IBM directors on the team."
  }, {
    "score": 4,
    "matches": ["stellar"],
    "content": "Stellar will buy me a house one day - just you wait"
  }, {
    "score": 2,
    "matches": ["stellar"],
    "content": "whats the best place to buy stellar and how does it work? there are those memo and send/receice addresses, Im lost"
  }, {
    "score": 2,
    "matches": ["stellar"],
    "content": "100b+ max coin supply, and you talk about stellar beeing undervalued at .50USD, lmao get out."
  }, {
    "score": 5,
    "matches": ["stellar"],
    "content": "Stellar is going to take the crypto world by storm. Such a professional team, great subreddit and mature community. "
  }, {
    "score": 5,
    "matches": ["stellar"],
    "content": "Why do we like XLM but hate XRP? Aren't they very similar?"
  }, {
    "score": 3,
    "matches": ["ripple", "stellar"],
    "content": "But what is the ceiling? The supply is huuuge... I don´t understand why this high supply coins pump so much...There are less rice grains in China than XRP and XLM coins. Is 1 rice grain worth 1$ ?!"
  }]
}, {
  "title": "To people new to Crypto don't panic and sell all your shit, bitcoins just having a moment.",
  "score": 97,
  "comments": [{
    "score": 16,
    "matches": ["factom"],
    "content": "Which major alts are down? All mine are up!\n\nI see FCT is down after McShill's pump and dump, only one on my watch list that is down."
  }]
}, {
  "title": "I'm so overwhelmed",
  "score": 502,
  "comments": [{
    "score": 4,
    "matches": ["neo"],
    "content": "No, I meant that there are upcoming ICOs hosted on the NEO blockchain (NEP-5 tokens). I’m personally most excited on Thekey and APEX  - solid team and partnerships, and in the case of Thekey, with actual backing of the Chinese government."
  }, {
    "score": 2,
    "matches": ["tenx"],
    "content": "I know i'm a greedy cunt. Mostly because i'm afraid all of this is going to come to a crashing end one day and i want my moon before then ( to pay off student loans). I literally have no patience in this market, its too stressful."
  }, {
    "score": 3,
    "matches": ["stellar", "icon", "request"],
    "content": "Since September I've added 2 digits to my portfolio.  I rode half of BTC's run, the entire LTC, XVG, GRS, and (currently in) the XLM runs.  I could have gotten in XRB at .17, but I didn't want to mess with Mercatox, eventually got in at $5 anyways.  Currently sleeping on REQ :(\n\nSumo went up like crazy, just waiting for more.  Holding ICX and PRL.  \n\nThe rest of my portfolio is boring safe stuff."
  }]
}, {
  "title": "Started 2-3 weeks ago with a small amount and no clue what I was doing. I decided to make small gif about my early experience.",
  "score": 119,
  "comments": []
}, {
  "title": "Interesting crypto stats for 2017",
  "score": 549,
  "comments": [{
    "score": 14,
    "matches": ["neo"],
    "content": "You forgot to take NEO gas dividends into the calculation. You would yield 1,75 gas each day with those amount (6000 neo). Currently that's an easy 50 bucks extra in the pocket EACH DAY :)"
  }, {
    "score": 7,
    "matches": ["pivx"],
    "content": "Or with PIVX you'd have $1,669,780.14"
  }, {
    "score": 3,
    "matches": ["ethereum"],
    "content": "Yeah but for each of these, there would be about 10 alts that didn't go anywhere (some probably even went under).\n\nThe most rational Jan 1, 2017 'you' would diversify the $1000 into 20 different coins, investing $50 worth in each. Using the 10 to 1 ratio of losers and winners, probably only two of the 20 altcoins would be in the winners list of yours. Pick BTC as one, and any of the random ones from the rest. Let's pick the second top performer, XRP.\n\n- BTC: $50 x 14 = $700\n- XRP: $50 x 335 = $16750\n\nTotal comes out at $16750 + $700 = roughtly $17,500 (and you would probably lose some of the remaining $900 of your original $1000).\n\nSo a typical gain (assuming a lot of things like rational diversification, HODLing, no-FOMO, etc) would be 15x to 20x over $1000. Any other kind of strategy would be not too different from gambling.\n\n15x to 20x in one year is pretty good. But not as good as the gains in XRP, NEO, ETH etc.\n\n**edit**: I noticed OP may have meant $1000 per coin not $1000 total. My point still holds. A $10k would turn into $150k to $200k in a near best case scenario.\n\n**edit 2**: Would this be repeated in 2018? who knows. Total coin market cap is hovering around $600b for the past many weeks. On Jan 1, 2017 it was $18b, so a 33x increase in one year. For 2018 to repeat 2017 performance, cap will have go from $6b to $20T (twenty trillion USD) which is very unrealistic IMO (that's a quarter of the world economy!). But if 2017 was a unique year that followed the center of the \"S curve\" then we might see a slowdown, i.e., a cap increase from $600b to maybe a $1T or so. In which case the gains would be more like 1.5x to 2x, not 15x to 20x! (or in the worst case, the $600b is a bubble and we might see a correction down to $300b or something, in which case the rational actor actually loses money)."
  }, {
    "score": 2,
    "matches": ["ripple", "neo"],
    "content": "While I don't talk about price much, was pretty shocked with increases this year, like bts going up 200-250x but I guess would still be behind neo and ripple for buying which I wouldn't do because I don't like supporting centralized  premines where devs control 50%+ of coins. At least it's not just scams going up so everyone wins somehow. Seeing bytecoin do almost just as well worries me how little anyone cares about security or tech-literacy anymore. They are marketing these things like candy to newbies, even publicly proven scams. "
  }]
}, {
  "title": "Ripple makes the front page of the Wall Street Journal",
  "score": 82,
  "comments": []
}, {
  "title": "Stellar (XLM) listed on OKEx",
  "score": 292,
  "comments": [{
    "score": 13,
    "matches": ["ripple", "stellar"],
    "content": "For those who are still on the fence, keep in mind that Stellar is still listed on only a select few exchanges. As soon as Stellar gets added to Bithumb (biggest Ripple exchange), Bitfinex, Coinbase/GDAX and when FairX will launch it is really going to take off."
  }, {
    "score": 7,
    "matches": ["tron", "binance"],
    "content": "Cup and handle forming on binance should be an interesting day. Also what news did I miss on tron ? It's at nearly 2x for the day."
  }, {
    "score": 5,
    "matches": ["stellar"],
    "content": "Big stellar push in reddit today then"
  }]
}, {
  "title": "Crypto trading logic",
  "score": 2257,
  "comments": [{
    "score": 48,
    "matches": ["stellar"],
    "content": "Is this a documentary?\n\nMe with XLM today "
  }, {
    "score": 31,
    "matches": ["ethereum", "stellar", "icon", "request"],
    "content": "So True. I had some ETH to trade and wanted so bad to throw it in on REQ or XLM after they where already mooning since I had planned on buying but haven't gotten the funds in yet. To stop myself I threw it into ICX to stop the FOMO. Lucky for me that's gone up a buck after I did that too :)"
  }, {
    "score": 13,
    "matches": ["binance"],
    "content": "I just log into binance and buy the lowest performing coin. Wake up the next day with my stop-limit sell complete and make a lambo payment from the gains."
  }, {
    "score": 7,
    "matches": ["request"],
    "content": "Is this REQ or XLM?"
  }, {
    "score": 2,
    "matches": ["ripple"],
    "content": "If you put $100 into 100 different coins at a starting cost of $0.01, 99 could fail and 1 would make you rich.\nImagine buying Ripple when it was $0.01"
  }]
}, {
  "title": "DRGN just hit $3 on Kucoin!",
  "score": 114,
  "comments": [{
    "score": 19,
    "matches": ["ethereum"],
    "content": "To the people 10 people who invested 100+ ETH in this ICO... you lucky fucks ;)"
  }, {
    "score": 22,
    "matches": ["dragonchain"],
    "content": "Slightly concerning that everyone here is focussing on price.\n\nI’ve read their website and I still can’t understand what DRGN does. \n\nI totally agree that there might be a lot of money to be made before everyone realises the true value (or lack of). But I only invest in things I understand and believe in. Maybe that makes me a sucka. \n\nBitcoin as a store of value / emancipation from financial corporations is something I’ve longed for my whole life. It’s something I want for my children and everyone I know. It will make us all better off.\n\nBeing able to layer an application on top of bitcoin however (is that what DRGN does?), is much more of a niche craving.\n\nThe best of luck anyway, to the moon! "
  }, {
    "score": 5,
    "matches": ["dragonchain"],
    "content": "I just want to hodl 1 dragon at any price without signing up for another exchange. \n\nPlease drgn on binance. "
  }, {
    "score": 3,
    "matches": ["dragonchain"],
    "content": "A lot of corporate money flowing in. Still haven't sold a single DRGN. It is so rewarding to be holder and receive discounts on all upcoming ICOs. Can't wait for DRGN blockchain to be released!!"
  }]
}, {
  "title": "Why Tron (TRX) may be the most ambitious project in crypto right now.",
  "score": 94,
  "comments": [{
    "score": 22,
    "matches": ["tron"],
    "content": "Anyone not in tron is going to hate themselves in a month. Early adopters are going to be heavily rewarded "
  }]
}, {
  "title": "NavPay: optional privacy mobile wallet from NavCoin",
  "score": 65,
  "comments": [{
    "score": 17,
    "matches": ["ethereum", "monero", "nav", "achain"],
    "content": "To understand what is Navcoin, and it will target the Top 20 Crytocurrencies market cap in 2018 (have a look, compare and make your choice) :\n\n\nTo start, NAV isn't just a \"privacy\" focused coin. In Q1 2018, it will become a \"privacy\" focused platform/ecosystem. That makes NAV markedly different than Verge and Monero, aka huge growth potential over the next few months :). NAV is also POS whereas Monero is POW. I believe POS is the future of blockchain. No surprise that Ethereum is looking to migrate to POS as well in 2018. There are many more attributes that make NAV more versatile than Monero. That said, I like Monero as well. Here's a few highlights that explain NAV more for you:\n\nNavChain (the teams working title for the anonymous dapps platform)\n\nAs I mentioned above will be a privacy focused platform/ecosystem (I hate linking us to another project, but think anonymity of ethereum/neo). Once NavChain (Adapps) is built (the whitepaper is set to release in early Q1), the first planned anonymous application will be NavTech2.0.\n\nBonus: The devs are developing a working prototype of NavChain as we speak (including a working protoype of NavTech2.0). This will lead to faster development of the actual product.\n\nRead more from the AMA: https://navtechservers.com/ama30102017/\n\nNavTech2.0\n\nBecause NAV is a POS coin, NavTech2.0 will make every individual staking wallet have the option to act as a private server, which will create a fully decentralized mesh network of private payment servers. This is truly revolutionary in that it will create a trustless network. It solves the current concerns regarding trusting a small set of servers for private payments.\n\nFor more information https://navcoin.org/news/a-guide-to-navtech/\n\nCommunity Fund\n\nNav recently passed a community fund which will reduce the staking rewards from 5% to 4%. The purpose is to use the 1% staking rewards to finish roadmap projects; hire more devs/marketers; market product launches; and finish community projects. \"This equates to about $1M USD per year (at the current price) to spend on community projects, the core teams development roadmap and marketing initiatives – which will be a huge boost to the project.\"\n\nRead more here: https://navcoin.org/news/community-fund-success/\n\nPolymorph:\n\nPolymorph is a web service designed to allow users to anonymise any of the currencies which are exchangeable on Changelly. How it works is best summarised by this slide from our 2016 Nav Coin Conference:\n\nhttp://i.imgur.com/UpNL6uA.jpg\n\nThe user chooses their input currency & amount, output currency & destination address. Polymorph will exchange whatever currency is input to NAV with Changelly, send it through our dual blockchain private payment platform NavTech, then exchange it back to the specified output currency and send it to its destination.\n\nYou can specify the same input and output currencies, or you could actually use it as an exchange service also, inputting BTC and outputting ETH for example.\n\nCopied from our lead dev here: https://www.reddit.com/r/NavCoin/comments/6ii8xm/what_is_polymorph_project/dj6wn02/\n\nNavPay\n\nCheck out the most recent NavPay launch: https://twitter.com/NAVCoin/status/943738103839289344. If you have android, try it out! It's coming to iOS soon.\n\nMore info here: https://navcoin.org/navpay/\n\nEDIT\n\nNavPi and coming in 2018 NavPi 2.0 25% complete\n\nThe NavPi is the Nav Coin Raspberry Pi 3 Stakebox. With the NavPi you can stake your NavCoin at efficient cost, saving electricity. Use NavPi as passive income generator while you sleep: https://store.navcoin.org/product/navpi-stakebox/\n\nhttps://navtechservers.com/video-tutorials/navpi/\n\nhttps://store.navcoin.org/product/navpi-stakebox/\n\nhttps://navtechservers.com/navtech-tools/staking-calculator/\n\nNavPi 2.0 - \"After the successful launch of NavPi, we are working towards streamlining the interface. This means a full redevelopment using Angular2 served by NodeJS. This also aims to improve the performance of the front end giving a smoother user experience.\"\n\nCopied from NavCoin Roadmap: https://navcoin.org/project-roadmap/\n\nNAV Details at a Glance\n\nNAV's Website: https://navcoin.org/\nNAV's Roadmap: https://navcoin.org/project-roadmap/\nNAV Team Section: (Scroll Half Way Down) https://navcoin.org/))\n\nHow to buy NAV: https://navcoin.org/exchanges-and-services/\n\nAlgorithm: POS\n\nBlock Time: 30 sec\n\nNumber of Transactions/Second: 1120\n\nCoin Circulation (as of 1/1/18): ~62,250,000 NAV\n\nInflation: 4% (once community fund is up and running in Q1 2018).\n\nLastly, Another great resource is https://navtechservers.com/. This website was created by a community member and (reddit moderator /u/navtechservers) as an independent resource guide from the NAV development team. The tutorials/videos/links are extremely helpful!\n\n"
  }]
}]